the-nw1-group/acb-modules/acb-common/include/stm32f0xx.inc
@ File automatically generated from D:\Model Railways\Electronics\Information\ST-DemoCode\STM32F072B-Discovery_FW_V1.0.1\Libraries\CMSIS\Device\Include\stm32f0xx.h on 15/05/2014 20:42:48
@ by ConvertHeaderFiles (c) The NW1 Group

/**
  ******************************************************************************
  * @file    stm32f0xx.h
  * @author  MCD Application Team
  * @version V1.3.1
  * @date    17-January-2014
  * @brief   CMSIS Cortex-M0 Device Peripheral Access Layer Header File. 
  *          This file contains all the peripheral register's definitions, bits 
  *          definitions and memory mapping for STM32F0xx devices.  
  *          
  *          The file is the unique include file that the application programmer
  *          is using in the C source code, usually in main.c. This file contains:
  *           - Configuration section that allows to select:
  *              - The device used in the target application
  *              - To use or not the peripheral’s drivers in application code(i.e. 
  *                code will be based on direct access to peripheral’s registers 
  *                rather than drivers API), this option is controlled by 
  *                "#define USE_STDPERIPH_DRIVER"
  *              - To change few application-specific parameters such as the HSE 
  *                crystal frequency
  *           - Data structures and the address mapping for all peripherals
  *           - Peripheral's registers declarations and bits definition
  *           - Macros to access peripheral’s registers hardware
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2014 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software 
  * distributed under the License is distributed on an "AS IS" BASIS, 
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */

/** @addtogroup CMSIS
  * @{
  */

/** @addtogroup stm32f0xx
  * @{
  */

#ifndef __STM32F0XX_H
#define __STM32F0XX_H

#ifdef __cplusplus
#endif 

/** @addtogroup Library_configuration_section
  * @{
  */

/* Uncomment the line below according to the target STM32F0 device used in your 
   application 
  */

#if !defined (STM32F030) && !defined (STM32F031) && !defined (STM32F051) && !defined (STM32F072) && !defined (STM32F042)
  #define STM32F072   
#endif

/*  Tip: To avoid modifying this file each time you need to switch between these
        devices, you can define the device in your toolchain compiler preprocessor.
  */

#if defined(STM32F0XX) || defined(STM32F0XX_MD) 
  #define STM32F051
#endif /* STM32F0XX */

#ifdef STM32F0XX_LD
  #define     STM32F031
#endif /* STM32F0XX_LD */

#ifdef STM32F0XX_HD
   #define   STM32F072
#endif /* STM32F0XX_HD */

#if defined (STM32F030X8) || defined (STM32F030X6)
  #define    STM32F030
#endif /* STM32F030X8 or  STM32F030X6 */


#if !defined (STM32F030) && !defined (STM32F031) && !defined (STM32F051) && !defined (STM32F072) && !defined (STM32F042)
#endif

#if !defined  USE_STDPERIPH_DRIVER
/**
 * @brief Comment the line below if you will not use the peripherals drivers.
   In this case, these drivers will not be included and the application code will 
   be based on direct access to peripherals registers 
   */
#endif /* USE_STDPERIPH_DRIVER */

/**
 * @brief In the following line adjust the value of External High Speed oscillator (HSE)
   used in your application 

   Tip: To avoid modifying this file each time you need to use different HSE, you
        can define the HSE value in your toolchain compiler preprocessor.
  */
#if !defined  (HSE_VALUE)     
#define HSE_VALUE    (8000000) /*!< Value of the External oscillator in Hz*/
#endif /* HSE_VALUE */

/**
 * @brief In the following line adjust the External High Speed oscillator (HSE) Startup 
   Timeout value 
   */
#if !defined  (HSE_STARTUP_TIMEOUT)
#define HSE_STARTUP_TIMEOUT   (0x5000) /*!< Time out for HSE start up */
#endif /* HSE_STARTUP_TIMEOUT */

/**
 * @brief In the following line adjust the Internal High Speed oscillator (HSI) Startup 
   Timeout value 
   */
#if !defined  (HSI_STARTUP_TIMEOUT)
#define HSI_STARTUP_TIMEOUT   (0x5000) /*!< Time out for HSI start up */
#endif /* HSI_STARTUP_TIMEOUT */

#if !defined  (HSI_VALUE) 
#define HSI_VALUE  (8000000) /*!< Value of the Internal High Speed oscillator in Hz.
                                             The real value may vary depending on the variations
                                             in voltage and temperature.  */
#endif /* HSI_VALUE */

#if !defined  (HSI14_VALUE) 
#define HSI14_VALUE (14000000) /*!< Value of the Internal High Speed oscillator for ADC in Hz.
                                             The real value may vary depending on the variations
                                             in voltage and temperature.  */
#endif /* HSI14_VALUE */

#if !defined  (HSI48_VALUE) 
#define HSI48_VALUE (48000000) /*!< Value of the Internal High Speed oscillator for USB in Hz.
                                             The real value may vary depending on the variations
                                             in voltage and temperature.  */
#endif /* HSI48_VALUE */

#if !defined  (LSI_VALUE) 
#define LSI_VALUE  (40000)    /*!< Value of the Internal Low Speed oscillator in Hz
                                             The real value may vary depending on the variations
                                             in voltage and temperature.  */
#endif /* LSI_VALUE */

#if !defined  (LSE_VALUE) 
#define LSE_VALUE  (32768)    /*!< Value of the External Low Speed oscillator in Hz */
#endif /* LSE_VALUE */

/**
 * @brief STM32F0xx Standard Peripheral Library version number V1.3.1
   */
#define __STM32F0XX_STDPERIPH_VERSION_MAIN   (0x01) /*!< [31:24] main version */
#define __STM32F0XX_STDPERIPH_VERSION_SUB1   (0x03) /*!< [23:16] sub1 version */
#define __STM32F0XX_STDPERIPH_VERSION_SUB2   (0x01) /*!< [15:8]  sub2 version */
#define __STM32F0XX_STDPERIPH_VERSION_RC     (0x00) /*!< [7:0]  release candidate */ 
#define __STM32F0XX_STDPERIPH_VERSION        ((__STM32F0XX_STDPERIPH_VERSION_MAIN << 24)\
                                             |(__STM32F0XX_STDPERIPH_VERSION_SUB1 << 16)\
                                             |(__STM32F0XX_STDPERIPH_VERSION_SUB2 << 8)\
                                             |(__STM32F0XX_STDPERIPH_VERSION_RC))

/**
  * @}
  */

/** @addtogroup Configuration_section_for_CMSIS
  * @{
  */

/**
 * @brief STM32F0xx Interrupt Number Definition, according to the selected device 
 *        in @ref Library_configuration_section 
 */
#define __CM0_REV                 0 /*!< Core Revision r0p0                            */
#define __MPU_PRESENT             0 /*!< STM32F0xx do not provide MPU                  */
#define __NVIC_PRIO_BITS          2 /*!< STM32F0xx uses 2 Bits for the Priority Levels */
#define __Vendor_SysTickConfig    0 /*!< Set to 1 if different SysTick Config is used  */

  NonMaskableInt_IRQn         = -14    /*!< 2 Non Maskable Interrupt                                */
  HardFault_IRQn              = -13    /*!< 3 Cortex-M0 Hard Fault Interrupt                        */
  SVC_IRQn                    = -5     /*!< 11 Cortex-M0 SV Call Interrupt                          */
  PendSV_IRQn                 = -2     /*!< 14 Cortex-M0 Pend SV Interrupt                          */
  SysTick_IRQn                = -1     /*!< 15 Cortex-M0 System Tick Interrupt                      */

#if defined (STM32F051)
  WWDG_IRQn                   = 0      /*!< Window WatchDog Interrupt                               */
  PVD_IRQn                    = 1      /*!< PVD through EXTI Line detect Interrupt                  */
  RTC_IRQn                    = 2      /*!< RTC through EXTI Line Interrupt                         */
  FLASH_IRQn                  = 3      /*!< FLASH Interrupt                                         */
  RCC_IRQn                    = 4      /*!< RCC Interrupt                                           */
  EXTI0_1_IRQn                = 5      /*!< EXTI Line 0 and 1 Interrupts                            */
  EXTI2_3_IRQn                = 6      /*!< EXTI Line 2 and 3 Interrupts                            */
  EXTI4_15_IRQn               = 7      /*!< EXTI Line 4 to 15 Interrupts                            */
  TS_IRQn                     = 8      /*!< Touch sense controller Interrupt                        */
  DMA1_Channel1_IRQn          = 9      /*!< DMA1 Channel 1 Interrupt                                */
  DMA1_Channel2_3_IRQn        = 10     /*!< DMA1 Channel 2 and Channel 3 Interrupts                 */
  DMA1_Channel4_5_IRQn        = 11     /*!< DMA1 Channel 4 and Channel 5 Interrupts                 */
  ADC1_COMP_IRQn              = 12     /*!< ADC1 COMP1 and COMP2 Interrupts                        */
  TIM1_BRK_UP_TRG_COM_IRQn    = 13     /*!< TIM1 Break Update Trigger and Commutation Interrupts  */
  TIM1_CC_IRQn                = 14     /*!< TIM1 Capture Compare Interrupt                          */
  TIM2_IRQn                   = 15     /*!< TIM2 Interrupt                                          */
  TIM3_IRQn                   = 16     /*!< TIM3 Interrupt                                          */
  TIM6_DAC_IRQn               = 17     /*!< TIM6 and DAC Interrupts                                 */
  TIM14_IRQn                  = 19     /*!< TIM14 Interrupt                                         */
  TIM15_IRQn                  = 20     /*!< TIM15 Interrupt                                         */
  TIM16_IRQn                  = 21     /*!< TIM16 Interrupt                                         */
  TIM17_IRQn                  = 22     /*!< TIM17 Interrupt                                         */
  I2C1_IRQn                   = 23     /*!< I2C1 Interrupt                                          */
  I2C2_IRQn                   = 24     /*!< I2C2 Interrupt                                          */
  SPI1_IRQn                   = 25     /*!< SPI1 Interrupt                                          */
  SPI2_IRQn                   = 26     /*!< SPI2 Interrupt                                          */
  USART1_IRQn                 = 27     /*!< USART1 Interrupt                                        */
  USART2_IRQn                 = 28     /*!< USART2 Interrupt                                        */
  CEC_IRQn                    = 30      /*!< CEC Interrupt                                           */
#elif defined (STM32F031)
  WWDG_IRQn                   = 0      /*!< Window WatchDog Interrupt                               */
  PVD_IRQn                    = 1      /*!< PVD through EXTI Line detect Interrupt                  */
  RTC_IRQn                    = 2      /*!< RTC through EXTI Line Interrupt                         */
  FLASH_IRQn                  = 3      /*!< FLASH Interrupt                                         */
  RCC_IRQn                    = 4      /*!< RCC Interrupt                                           */
  EXTI0_1_IRQn                = 5      /*!< EXTI Line 0 and 1 Interrupts                            */
  EXTI2_3_IRQn                = 6      /*!< EXTI Line 2 and 3 Interrupts                            */
  EXTI4_15_IRQn               = 7      /*!< EXTI Line 4 to 15 Interrupts                            */
  DMA1_Channel1_IRQn          = 9      /*!< DMA1 Channel 1 Interrupt                                */
  DMA1_Channel2_3_IRQn        = 10     /*!< DMA1 Channel 2 and Channel 3 Interrupts                 */
  DMA1_Channel4_5_IRQn        = 11     /*!< DMA1 Channel 4 and Channel 5 Interrupts                 */
  ADC1_IRQn                   = 12     /*!< ADC1 Interrupt                                          */
  TIM1_BRK_UP_TRG_COM_IRQn    = 13     /*!< TIM1 Break Update Trigger and Commutation Interrupts  */
  TIM1_CC_IRQn                = 14     /*!< TIM1 Capture Compare Interrupt                          */
  TIM2_IRQn                   = 15     /*!< TIM2 Interrupt                                          */
  TIM3_IRQn                   = 16     /*!< TIM3 Interrupt                                          */
  TIM14_IRQn                  = 19     /*!< TIM14 Interrupt                                         */
  TIM16_IRQn                  = 21     /*!< TIM16 Interrupt                                         */
  TIM17_IRQn                  = 22     /*!< TIM17 Interrupt                                         */
  I2C1_IRQn                   = 23     /*!< I2C1 Interrupt                                          */
  SPI1_IRQn                   = 25     /*!< SPI1 Interrupt                                          */
  USART1_IRQn                 = 27      /*!< USART1 Interrupt                                        */
#elif defined (STM32F030)
  WWDG_IRQn                   = 0      /*!< Window WatchDog Interrupt                               */
  RTC_IRQn                    = 2      /*!< RTC through EXTI Line Interrupt                         */
  FLASH_IRQn                  = 3      /*!< FLASH Interrupt                                         */
  RCC_IRQn                    = 4      /*!< RCC Interrupt                                           */
  EXTI0_1_IRQn                = 5      /*!< EXTI Line 0 and 1 Interrupts                            */
  EXTI2_3_IRQn                = 6      /*!< EXTI Line 2 and 3 Interrupts                            */
  EXTI4_15_IRQn               = 7      /*!< EXTI Line 4 to 15 Interrupts                            */
  DMA1_Channel1_IRQn          = 9      /*!< DMA1 Channel 1 Interrupt                                */
  DMA1_Channel2_3_IRQn        = 10     /*!< DMA1 Channel 2 and Channel 3 Interrupts                 */
  DMA1_Channel4_5_IRQn        = 11     /*!< DMA1 Channel 4 and Channel 5 Interrupts                 */
  ADC1_IRQn                   = 12     /*!< ADC1 Interrupt                                          */
  TIM1_BRK_UP_TRG_COM_IRQn    = 13     /*!< TIM1 Break Update Trigger and Commutation Interrupts  */
  TIM1_CC_IRQn                = 14     /*!< TIM1 Capture Compare Interrupt                          */
  TIM3_IRQn                   = 16     /*!< TIM3 Interrupt                                          */
  TIM14_IRQn                  = 19     /*!< TIM14 Interrupt                                         */
  TIM15_IRQn                  = 20     /*!< TIM15 Interrupt                                         */
  TIM16_IRQn                  = 21     /*!< TIM16 Interrupt                                         */
  TIM17_IRQn                  = 22     /*!< TIM17 Interrupt                                         */
  I2C1_IRQn                   = 23     /*!< I2C1 Interrupt                                          */
  I2C2_IRQn                   = 24     /*!< I2C2 Interrupt                                          */
  SPI1_IRQn                   = 25     /*!< SPI1 Interrupt                                          */
  SPI2_IRQn                   = 26     /*!< SPI2 Interrupt                                          */
  USART1_IRQn                 = 27     /*!< USART1 Interrupt                                        */
  USART2_IRQn                 = 28      /*!< USART2 Interrupt                                        */
#elif defined (STM32F072)
  WWDG_IRQn                   = 0      /*!< Window WatchDog Interrupt                                     */
  PVD_VDDIO2_IRQn             = 1      /*!< PVD and VDDIO2 supply comparator through EXTI Line detect Interrupt */
  RTC_IRQn                    = 2      /*!< RTC through EXTI Line Interrupt                               */
  FLASH_IRQn                  = 3      /*!< FLASH Interrupt                                               */
  RCC_CRS_IRQn                = 4      /*!< RCC and CRS Interrupts                                        */
  EXTI0_1_IRQn                = 5      /*!< EXTI Line 0 and 1 Interrupts                                  */
  EXTI2_3_IRQn                = 6      /*!< EXTI Line 2 and 3 Interrupts                                  */
  EXTI4_15_IRQn               = 7      /*!< EXTI Line 4 to 15 Interrupts                                  */
  TSC_IRQn                    = 8      /*!< TSC Interrupt                                                 */
  DMA1_Channel1_IRQn          = 9      /*!< DMA1 Channel 1 Interrupt                                      */
  DMA1_Channel2_3_IRQn        = 10     /*!< DMA1 Channel 2 and Channel 3 Interrupts                       */
  DMA1_Channel4_5_6_7_IRQn    = 11     /*!< DMA1 Channel 4 Channel 5 Channel 6 and Channel 7 Interrupts */
  ADC1_COMP_IRQn              = 12     /*!< ADC1 COMP1 and COMP2 Interrupts                              */
  TIM1_BRK_UP_TRG_COM_IRQn    = 13     /*!< TIM1 Break Update Trigger and Commutation Interrupts        */
  TIM1_CC_IRQn                = 14     /*!< TIM1 Capture Compare Interrupt                                */
  TIM2_IRQn                   = 15     /*!< TIM2 Interrupt                                                */
  TIM3_IRQn                   = 16     /*!< TIM3 Interrupt                                                */
  TIM6_DAC_IRQn               = 17     /*!< TIM6 and DAC Interrupts                                       */
  TIM7_IRQn                   = 18     /*!< TIM7 Interrupts                                               */
  TIM14_IRQn                  = 19     /*!< TIM14 Interrupt                                               */
  TIM15_IRQn                  = 20     /*!< TIM15 Interrupt                                               */
  TIM16_IRQn                  = 21     /*!< TIM16 Interrupt                                               */
  TIM17_IRQn                  = 22     /*!< TIM17 Interrupt                                               */
  I2C1_IRQn                   = 23     /*!< I2C1 Interrupt                                                */
  I2C2_IRQn                   = 24     /*!< I2C2 Interrupt                                                */
  SPI1_IRQn                   = 25     /*!< SPI1 Interrupt                                                */
  SPI2_IRQn                   = 26     /*!< SPI2 Interrupt                                                */
  USART1_IRQn                 = 27     /*!< USART1 Interrupt                                              */
  USART2_IRQn                 = 28     /*!< USART2 Interrupt                                              */
  USART3_4_IRQn               = 29     /*!< USART3 and USART4 Interrupts                                  */
  CEC_CAN_IRQn                = 30     /*!< CEC and CAN Interrupts                                        */
  USB_IRQn                    = 31      /*!< USB Low Priority global Interrupt                             */
#elif defined (STM32F042)
  WWDG_IRQn                   = 0      /*!< Window WatchDog Interrupt                                     */
  PVD_VDDIO2_IRQn             = 1      /*!< PVD and VDDIO2 supply comparator through EXTI Line detect Interrupt */
  RTC_IRQn                    = 2      /*!< RTC through EXTI Line Interrupt                               */
  FLASH_IRQn                  = 3      /*!< FLASH Interrupt                                               */
  RCC_CRS_IRQn                = 4      /*!< RCC and CRS Interrupts                                        */
  EXTI0_1_IRQn                = 5      /*!< EXTI Line 0 and 1 Interrupts                                  */
  EXTI2_3_IRQn                = 6      /*!< EXTI Line 2 and 3 Interrupts                                  */
  EXTI4_15_IRQn               = 7      /*!< EXTI Line 4 to 15 Interrupts                                  */
  TSC_IRQn                    = 8      /*!< TSC Interrupt                                                 */
  DMA1_Channel1_IRQn          = 9      /*!< DMA1 Channel 1 Interrupt                                      */
  DMA1_Channel2_3_IRQn        = 10     /*!< DMA1 Channel 2 and Channel 3 Interrupts                       */
  DMA1_Channel4_5_IRQn        = 11     /*!< DMA1 Channel 4 Channel 5 Interrupts                          */
  ADC1_IRQn                   = 12     /*!< ADC1 Interrupts                                               */
  TIM1_BRK_UP_TRG_COM_IRQn    = 13     /*!< TIM1 Break Update Trigger and Commutation Interrupts        */
  TIM1_CC_IRQn                = 14     /*!< TIM1 Capture Compare Interrupt                                */
  TIM2_IRQn                   = 15     /*!< TIM2 Interrupt                                                */
  TIM3_IRQn                   = 16     /*!< TIM3 Interrupt                                                */
  TIM14_IRQn                  = 19     /*!< TIM14 Interrupt                                               */
  TIM16_IRQn                  = 21     /*!< TIM16 Interrupt                                               */
  TIM17_IRQn                  = 22     /*!< TIM17 Interrupt                                               */
  I2C1_IRQn                   = 23     /*!< I2C1 Interrupt                                                */
  SPI1_IRQn                   = 25     /*!< SPI1 Interrupt                                                */
  SPI2_IRQn                   = 26     /*!< SPI2 Interrupt                                                */
  USART1_IRQn                 = 27     /*!< USART1 Interrupt                                              */
  USART2_IRQn                 = 28     /*!< USART2 Interrupt                                              */
  CEC_CAN_IRQn                = 30     /*!< CEC and CAN Interrupts                                        */
  USB_IRQn                    = 31      /*!< USB Low Priority global Interrupt                             */
#endif /* STM32F051 */ 

/**
  * @}
  */


