the-nw1-group/acb-modules/acb-common/include/stm32f0xx.inc
/** @addtogroup Exported_types
  * @{
  */  

RESET = 0
SET = !RESET

DISABLE = 0
ENABLE = !DISABLE
#define IS_FUNCTIONAL_STATE(STATE) (((STATE) == DISABLE) || ((STATE) == ENABLE))

ERROR = 0
SUCCESS = !ERROR

/** @addtogroup Peripheral_registers_structures
  * @{
  */   

/** 
  * @brief Analog to Digital Converter  
  */

#define ADC_ISR_OFFSET          0x0000    /*!< ADC Interrupt and Status register,                          Address offset:0x00 */
#define ADC_IER_OFFSET          0x0004    /*!< ADC Interrupt Enable register,                              Address offset:0x04 */
#define ADC_CR_OFFSET           0x0008    /*!< ADC Control register,                                       Address offset:0x08 */
#define ADC_CFGR1_OFFSET        0x000C    /*!< ADC Configuration register 1,                               Address offset:0x0C */
#define ADC_CFGR2_OFFSET        0x0010    /*!< ADC Configuration register 2,                               Address offset:0x10 */
#define ADC_SMPR_OFFSET         0x0014    /*!< ADC Sampling time register,                                 Address offset:0x14 */
#define ADC_RESERVED1_OFFSET    0x0018    /*!< Reserved,                                                                  0x18 */
#define ADC_RESERVED2_OFFSET    0x001C    /*!< Reserved,                                                                  0x1C */
#define ADC_TR_OFFSET           0x0020    /*!< ADC watchdog threshold register,                            Address offset:0x20 */
#define ADC_RESERVED3_OFFSET    0x0024    /*!< Reserved,                                                                  0x24 */
#define ADC_CHSELR_OFFSET       0x0028    /*!< ADC channel selection register,                             Address offset:0x28 */
#define ADC_RESERVED4_OFFSET    0x002C    /*!< Reserved,                                                                  0x2C */
#define ADC_DR_OFFSET           0x0040    /*!< ADC data register,                                          Address offset:0x40 */

#define ADC_Common_CCR_OFFSET    0x0000    


/** 
  * @brief Controller Area Network TxMailBox 
  */
#define CAN_TxMailBox_TIR_OFFSET     0x0000    /*!< CAN TX mailbox identifier register */
#define CAN_TxMailBox_TDTR_OFFSET    0x0004    /*!< CAN mailbox data length control and time stamp register */
#define CAN_TxMailBox_TDLR_OFFSET    0x0008    /*!< CAN mailbox data low register */
#define CAN_TxMailBox_TDHR_OFFSET    0x000C    /*!< CAN mailbox data high register */

/** 
  * @brief Controller Area Network FIFOMailBox 
  */
#define CAN_FIFOMailBox_RIR_OFFSET     0x0000    /*!< CAN receive FIFO mailbox identifier register */
#define CAN_FIFOMailBox_RDTR_OFFSET    0x0004    /*!< CAN receive FIFO mailbox data length control and time stamp register */
#define CAN_FIFOMailBox_RDLR_OFFSET    0x0008    /*!< CAN receive FIFO mailbox data low register */
#define CAN_FIFOMailBox_RDHR_OFFSET    0x000C    /*!< CAN receive FIFO mailbox data high register */

/** 
  * @brief Controller Area Network FilterRegister 
  */
#define CAN_FilterRegister_FR1_OFFSET    0x0000    /*!< CAN Filter bank register 1 */
#define CAN_FilterRegister_FR2_OFFSET    0x0004    /*!< CAN Filter bank register 1 */

/** 
  * @brief Controller Area Network 
  */
#define CAN_MCR_OFFSET                0x0000    /*!< CAN master control register,         Address offset: 0x00          */
#define CAN_MSR_OFFSET                0x0004    /*!< CAN master status register,          Address offset: 0x04          */
#define CAN_TSR_OFFSET                0x0008    /*!< CAN transmit status register,        Address offset: 0x08          */
#define CAN_RF0R_OFFSET               0x000C    /*!< CAN receive FIFO 0 register,         Address offset: 0x0C          */
#define CAN_RF1R_OFFSET               0x0010    /*!< CAN receive FIFO 1 register,         Address offset: 0x10          */
#define CAN_IER_OFFSET                0x0014    /*!< CAN interrupt enable register,       Address offset: 0x14          */
#define CAN_ESR_OFFSET                0x0018    /*!< CAN error status register,           Address offset: 0x18          */
#define CAN_BTR_OFFSET                0x001C    /*!< CAN bit timing register,             Address offset: 0x1C          */
#define CAN_RESERVED0_OFFSET          0x0020    /*!< Reserved, 0x020 - 0x17F                                            */
#define CAN_sTxMailBox_OFFSET         0x0180    /*!< CAN Tx MailBox,                      Address offset: 0x180 - 0x1AC */
#define CAN_sFIFOMailBox_OFFSET       0x01B0    /*!< CAN FIFO MailBox,                    Address offset: 0x1B0 - 0x1CC */
#define CAN_RESERVED1_OFFSET          0x01D0    /*!< Reserved, 0x1D0 - 0x1FF                                            */
#define CAN_FMR_OFFSET                0x0200    /*!< CAN filter master register,          Address offset: 0x200         */
#define CAN_FM1R_OFFSET               0x0204    /*!< CAN filter mode register,            Address offset: 0x204         */
#define CAN_RESERVED2_OFFSET          0x0208    /*!< Reserved, 0x208                                                    */
#define CAN_FS1R_OFFSET               0x020C    /*!< CAN filter scale register,           Address offset: 0x20C         */
#define CAN_RESERVED3_OFFSET          0x0210    /*!< Reserved, 0x210                                                    */
#define CAN_FFA1R_OFFSET              0x0214    /*!< CAN filter FIFO assignment register, Address offset: 0x214         */
#define CAN_RESERVED4_OFFSET          0x0218    /*!< Reserved, 0x218                                                    */
#define CAN_FA1R_OFFSET               0x021C    /*!< CAN filter activation register,      Address offset: 0x21C         */
#define CAN_RESERVED5_OFFSET          0x0220    /*!< Reserved, 0x220-0x23F                                              */
#define CAN_sFilterRegister_OFFSET    0x0240    /*!< CAN Filter Register,                 Address offset: 0x240-0x31C   */

/** 
  * @brief HDMI-CEC 
  */

#define CEC_CR_OFFSET      0x0000    /*!< CEC control register,                                       Address offset:0x00 */
#define CEC_CFGR_OFFSET    0x0004    /*!< CEC configuration register,                                 Address offset:0x04 */
#define CEC_TXDR_OFFSET    0x0008    /*!< CEC Tx data register ,                                      Address offset:0x08 */
#define CEC_RXDR_OFFSET    0x000C    /*!< CEC Rx Data Register,                                       Address offset:0x0C */
#define CEC_ISR_OFFSET     0x0010    /*!< CEC Interrupt and Status Register,                          Address offset:0x10 */
#define CEC_IER_OFFSET     0x0014    /*!< CEC interrupt enable register,                              Address offset:0x14 */

/**
  * @brief Comparator 
  */

#define COMP_CSR_OFFSET    0x0000    /*!< COMP comparator control and status register, Address offset: 0x1C */


/** 
  * @brief CRC calculation unit 
  */

