the-nw1-group/acb-modules/acb-common/include/stm32f0xx.inc
#define CRC_DR_OFFSET           0x0000    /*!< CRC Data register,                           Address offset: 0x00 */
#define CRC_IDR_OFFSET          0x0004    /*!< CRC Independent data register,               Address offset: 0x04 */
#define CRC_RESERVED0_OFFSET    0x0005    /*!< Reserved,                                                    0x05 */
#define CRC_RESERVED1_OFFSET    0x0006    /*!< Reserved,                                                    0x06 */
#define CRC_CR_OFFSET           0x0008    /*!< CRC Control register,                        Address offset: 0x08 */
#define CRC_RESERVED2_OFFSET    0x000C    /*!< Reserved,                                                    0x0C */
#define CRC_INIT_OFFSET         0x0010    /*!< Initial CRC value register,                  Address offset: 0x10 */
#define CRC_POL_OFFSET          0x0014    /*!< CRC polynomial register,                     Address offset: 0x14 */

/**
  * @brief Clock Recovery System 
  */
#define CRS_CR_OFFSET      0x0000    /*!< CRS ccontrol register,              Address offset: 0x00 */
#define CRS_CFGR_OFFSET    0x0004    /*!< CRS configuration register,         Address offset: 0x04 */
#define CRS_ISR_OFFSET     0x0008    /*!< CRS interrupt and status register,  Address offset: 0x08 */
#define CRS_ICR_OFFSET     0x000C    /*!< CRS interrupt flag clear register,  Address offset: 0x0C */

/** 
  * @brief Digital to Analog Converter
  */

#define DAC_CR_OFFSET         0x0000    /*!< DAC control register,                                    Address offset: 0x00 */
#define DAC_SWTRIGR_OFFSET    0x0004    /*!< DAC software trigger register,                           Address offset: 0x04 */
#define DAC_DHR12R1_OFFSET    0x0008    /*!< DAC channel1 12-bit right-aligned data holding register, Address offset: 0x08 */
#define DAC_DHR12L1_OFFSET    0x000C    /*!< DAC channel1 12-bit left aligned data holding register,  Address offset: 0x0C */
#define DAC_DHR8R1_OFFSET     0x0010    /*!< DAC channel1 8-bit right aligned data holding register,  Address offset: 0x10 */
#define DAC_DHR12R2_OFFSET    0x0014    /*!< DAC channel2 12-bit right aligned data holding register, Address offset: 0x14 */
#define DAC_DHR12L2_OFFSET    0x0018    /*!< DAC channel2 12-bit left aligned data holding register,  Address offset: 0x18 */
#define DAC_DHR8R2_OFFSET     0x001C    /*!< DAC channel2 8-bit right-aligned data holding register,  Address offset: 0x1C */
#define DAC_DHR12RD_OFFSET    0x0020    /*!< Dual DAC 12-bit right-aligned data holding register,     Address offset: 0x20 */
#define DAC_DHR12LD_OFFSET    0x0024    /*!< DUAL DAC 12-bit left aligned data holding register,      Address offset: 0x24 */
#define DAC_DHR8RD_OFFSET     0x0028    /*!< DUAL DAC 8-bit right aligned data holding register,      Address offset: 0x28 */
#define DAC_DOR1_OFFSET       0x002C    /*!< DAC channel1 data output register,                       Address offset: 0x2C */
#define DAC_DOR2_OFFSET       0x0030    /*!< DAC channel2 data output register,                       Address offset: 0x30 */
#define DAC_SR_OFFSET         0x0034    /*!< DAC status register,                                     Address offset: 0x34 */

/** 
  * @brief Debug MCU
  */

#define DBGMCU_IDCODE_OFFSET    0x0000    /*!< MCU device ID code,                          Address offset: 0x00 */
#define DBGMCU_CR_OFFSET        0x0004    /*!< Debug MCU configuration register,            Address offset: 0x04 */
#define DBGMCU_APB1FZ_OFFSET    0x0008    /*!< Debug MCU APB1 freeze register,              Address offset: 0x08 */
#define DBGMCU_APB2FZ_OFFSET    0x000C    /*!< Debug MCU APB2 freeze register,              Address offset: 0x0C */

/** 
  * @brief DMA Controller
  */

#define DMA_Channel_CCR_OFFSET      0x0000    /*!< DMA channel x configuration register                                           */
#define DMA_Channel_CNDTR_OFFSET    0x0004    /*!< DMA channel x number of data register                                          */
#define DMA_Channel_CPAR_OFFSET     0x0008    /*!< DMA channel x peripheral address register                                      */
#define DMA_Channel_CMAR_OFFSET     0x000C    /*!< DMA channel x memory address register                                          */

#define DMA_ISR_OFFSET     0x0000    /*!< DMA interrupt status register,                            Address offset: 0x00 */
#define DMA_IFCR_OFFSET    0x0004    /*!< DMA interrupt flag clear register,                        Address offset: 0x04 */

/** 
  * @brief External Interrupt/Event Controller
  */

#define EXTI_IMR_OFFSET      0x0000    /*!<EXTI Interrupt mask register,                             Address offset: 0x00 */
#define EXTI_EMR_OFFSET      0x0004    /*!<EXTI Event mask register,                                 Address offset: 0x04 */
#define EXTI_RTSR_OFFSET     0x0008    /*!<EXTI Rising trigger selection register ,                  Address offset: 0x08 */
#define EXTI_FTSR_OFFSET     0x000C    /*!<EXTI Falling trigger selection register,                  Address offset: 0x0C */
#define EXTI_SWIER_OFFSET    0x0010    /*!<EXTI Software interrupt event register,                   Address offset: 0x10 */
#define EXTI_PR_OFFSET       0x0014    /*!<EXTI Pending register,                                    Address offset: 0x14 */

/** 
  * @brief FLASH Registers
  */
#define FLASH_ACR_OFFSET         0x0000    /*!<FLASH access control register,                 Address offset: 0x00 */
#define FLASH_KEYR_OFFSET        0x0004    /*!<FLASH key register,                            Address offset: 0x04 */
#define FLASH_OPTKEYR_OFFSET     0x0008    /*!<FLASH OPT key register,                        Address offset: 0x08 */
#define FLASH_SR_OFFSET          0x000C    /*!<FLASH status register,                         Address offset: 0x0C */
#define FLASH_CR_OFFSET          0x0010    /*!<FLASH control register,                        Address offset: 0x10 */
#define FLASH_AR_OFFSET          0x0014    /*!<FLASH address register,                        Address offset: 0x14 */
#define FLASH_RESERVED_OFFSET    0x0018    /*!< Reserved,                                                     0x18 */
#define FLASH_OBR_OFFSET         0x001C    /*!<FLASH option bytes register,                   Address offset: 0x1C */
#define FLASH_WRPR_OFFSET        0x0020    /*!<FLASH option bytes register,                   Address offset: 0x20 */


/** 
  * @brief Option Bytes Registers
  */
#define OB_RDP_OFFSET      0x0000    /*!< FLASH option byte Read protection,             Address offset: 0x00 */
#define OB_USER_OFFSET     0x0002    /*!< FLASH option byte user options,                Address offset: 0x02 */
#define OB_DATA0_OFFSET    0x0004    /*!< User data byte 0 (stored in FLASH_OBR[23:16]), Address offset: 0x04 */
#define OB_DATA1_OFFSET    0x0006    /*!< User data byte 1 (stored in FLASH_OBR[31:24]), Address offset: 0x06 */
#define OB_WRP0_OFFSET     0x0008    /*!< FLASH option byte write protection 0,          Address offset: 0x08 */
#define OB_WRP1_OFFSET     0x000A    /*!< FLASH option byte write protection 1,          Address offset: 0x0A */
#define OB_WRP2_OFFSET     0x000C    /*!< FLASH option byte write protection 2,          Address offset: 0x0C */
#define OB_WRP3_OFFSET     0x000E    /*!< FLASH option byte write protection 3,          Address offset: 0x0E */


/** 
  * @brief General Purpose IO
  */

#define GPIO_MODER_OFFSET        0x0000    /*!< GPIO port mode register,                                  Address offset: 0x00 */
#define GPIO_OTYPER_OFFSET       0x0004    /*!< GPIO port output type register,                           Address offset: 0x04 */
#define GPIO_RESERVED0_OFFSET    0x0006    /*!< Reserved,                                                                 0x06 */
#define GPIO_OSPEEDR_OFFSET      0x0008    /*!< GPIO port output speed register,                          Address offset: 0x08 */
#define GPIO_PUPDR_OFFSET        0x000C    /*!< GPIO port pull-up/pull-down register,                     Address offset: 0x0C */
#define GPIO_IDR_OFFSET          0x0010    /*!< GPIO port input data register,                            Address offset: 0x10 */
#define GPIO_RESERVED1_OFFSET    0x0012    /*!< Reserved,                                                                 0x12 */
#define GPIO_ODR_OFFSET          0x0014    /*!< GPIO port output data register,                           Address offset: 0x14 */
#define GPIO_RESERVED2_OFFSET    0x0016    /*!< Reserved,                                                                 0x16 */
#define GPIO_BSRR_OFFSET         0x0018    /*!< GPIO port bit set/reset registerBSRR,                     Address offset: 0x18 */
#define GPIO_LCKR_OFFSET         0x001C    /*!< GPIO port configuration lock register,                    Address offset: 0x1C */
#define GPIO_AFR_OFFSET          0x0020    /*!< GPIO alternate function low register,                Address offset: 0x20-0x24 */
#define GPIO_BRR_OFFSET          0x0028    /*!< GPIO bit reset register,                                  Address offset: 0x28 */
#define GPIO_RESERVED3_OFFSET    0x002A    /*!< Reserved,                                                                 0x2A */

/** 
  * @brief SysTem Configuration
  */

