the-nw1-group/acb-modules/acb-common/include/stm32f0xx.inc
#define SYSCFG_CFGR1_OFFSET       0x0000    /*!< SYSCFG configuration register 1,                           Address offset: 0x00 */
#define SYSCFG_RESERVED_OFFSET    0x0004    /*!< Reserved,                                                                  0x04 */
#define SYSCFG_EXTICR_OFFSET      0x0008    /*!< SYSCFG external interrupt configuration register,     Address offset: 0x14-0x08 */
#define SYSCFG_CFGR2_OFFSET       0x0018    /*!< SYSCFG configuration register 2,                           Address offset: 0x18 */

/** 
  * @brief Inter-integrated Circuit Interface
  */

#define I2C_CR1_OFFSET         0x0000    /*!< I2C Control register 1,            Address offset: 0x00 */
#define I2C_CR2_OFFSET         0x0004    /*!< I2C Control register 2,            Address offset: 0x04 */
#define I2C_OAR1_OFFSET        0x0008    /*!< I2C Own address 1 register,        Address offset: 0x08 */
#define I2C_OAR2_OFFSET        0x000C    /*!< I2C Own address 2 register,        Address offset: 0x0C */
#define I2C_TIMINGR_OFFSET     0x0010    /*!< I2C Timing register,               Address offset: 0x10 */
#define I2C_TIMEOUTR_OFFSET    0x0014    /*!< I2C Timeout register,              Address offset: 0x14 */
#define I2C_ISR_OFFSET         0x0018    /*!< I2C Interrupt and status register, Address offset: 0x18 */
#define I2C_ICR_OFFSET         0x001C    /*!< I2C Interrupt clear register,      Address offset: 0x1C */
#define I2C_PECR_OFFSET        0x0020    /*!< I2C PEC register,                  Address offset: 0x20 */
#define I2C_RXDR_OFFSET        0x0024    /*!< I2C Receive data register,         Address offset: 0x24 */
#define I2C_TXDR_OFFSET        0x0028    /*!< I2C Transmit data register,        Address offset: 0x28 */


/** 
  * @brief Independent WATCHDOG
  */
#define IWDG_KR_OFFSET      0x0000    /*!< IWDG Key register,       Address offset: 0x00 */
#define IWDG_PR_OFFSET      0x0004    /*!< IWDG Prescaler register, Address offset: 0x04 */
#define IWDG_RLR_OFFSET     0x0008    /*!< IWDG Reload register,    Address offset: 0x08 */
#define IWDG_SR_OFFSET      0x000C    /*!< IWDG Status register,    Address offset: 0x0C */
#define IWDG_WINR_OFFSET    0x0010    /*!< IWDG Window register,    Address offset: 0x10 */

/** 
  * @brief Power Control
  */

#define PWR_CR_OFFSET     0x0000    /*!< PWR power control register,        Address offset: 0x00 */
#define PWR_CSR_OFFSET    0x0004    /*!< PWR power control/status register, Address offset: 0x04 */


/** 
  * @brief Reset and Clock Control
  */
#define RCC_CR_OFFSET          0x0000    /*!< RCC clock control register,                                  Address offset: 0x00 */
#define RCC_CFGR_OFFSET        0x0004    /*!< RCC clock configuration register,                            Address offset: 0x04 */
#define RCC_CIR_OFFSET         0x0008    /*!< RCC clock interrupt register,                                Address offset: 0x08 */
#define RCC_APB2RSTR_OFFSET    0x000C    /*!< RCC APB2 peripheral reset register,                          Address offset: 0x0C */
#define RCC_APB1RSTR_OFFSET    0x0010    /*!< RCC APB1 peripheral reset register,                          Address offset: 0x10 */
#define RCC_AHBENR_OFFSET      0x0014    /*!< RCC AHB peripheral clock register,                           Address offset: 0x14 */
#define RCC_APB2ENR_OFFSET     0x0018    /*!< RCC APB2 peripheral clock enable register,                   Address offset: 0x18 */
#define RCC_APB1ENR_OFFSET     0x001C    /*!< RCC APB1 peripheral clock enable register,                   Address offset: 0x1C */
#define RCC_BDCR_OFFSET        0x0020    /*!< RCC Backup domain control register,                          Address offset: 0x20 */
#define RCC_CSR_OFFSET         0x0024    /*!< RCC clock control & status register,                         Address offset: 0x24 */
#define RCC_AHBRSTR_OFFSET     0x0028    /*!< RCC AHB peripheral reset register,                           Address offset: 0x28 */
#define RCC_CFGR2_OFFSET       0x002C    /*!< RCC clock configuration register 2,                          Address offset: 0x2C */
#define RCC_CFGR3_OFFSET       0x0030    /*!< RCC clock configuration register 3,                          Address offset: 0x30 */
#define RCC_CR2_OFFSET         0x0034    /*!< RCC clock control register 2,                                Address offset: 0x34 */

/** 
  * @brief Real-Time Clock
  */

#define RTC_TR_OFFSET           0x0000    /*!< RTC time register,                                        Address offset: 0x00 */
#define RTC_DR_OFFSET           0x0004    /*!< RTC date register,                                        Address offset: 0x04 */
#define RTC_CR_OFFSET           0x0008    /*!< RTC control register,                                     Address offset: 0x08 */
#define RTC_ISR_OFFSET          0x000C    /*!< RTC initialization and status register,                   Address offset: 0x0C */
#define RTC_PRER_OFFSET         0x0010    /*!< RTC prescaler register,                                   Address offset: 0x10 */
#define RTC_WUTR_OFFSET         0x0014    /*!< RTC wakeup timer register,(only for STM32F072 devices)    Address offset: 0x14 */
#define RTC_RESERVED1_OFFSET    0x0018    /*!< Reserved,                                                 Address offset: 0x18 */
#define RTC_ALRMAR_OFFSET       0x001C    /*!< RTC alarm A register,                                     Address offset: 0x1C */
#define RTC_RESERVED2_OFFSET    0x0020    /*!< Reserved,                                                 Address offset: 0x20 */
#define RTC_WPR_OFFSET          0x0024    /*!< RTC write protection register,                            Address offset: 0x24 */
#define RTC_SSR_OFFSET          0x0028    /*!< RTC sub second register,                                  Address offset: 0x28 */
#define RTC_SHIFTR_OFFSET       0x002C    /*!< RTC shift control register,                               Address offset: 0x2C */
#define RTC_TSTR_OFFSET         0x0030    /*!< RTC time stamp time register,                             Address offset: 0x30 */
#define RTC_TSDR_OFFSET         0x0034    /*!< RTC time stamp date register,                             Address offset: 0x34 */
#define RTC_TSSSR_OFFSET        0x0038    /*!< RTC time-stamp sub second register,                       Address offset: 0x38 */
#define RTC_CALR_OFFSET         0x003C    /*!< RTC calibration register,                                 Address offset: 0x3C */
#define RTC_TAFCR_OFFSET        0x0040    /*!< RTC tamper and alternate function configuration register, Address offset: 0x40 */
#define RTC_ALRMASSR_OFFSET     0x0044    /*!< RTC alarm A sub second register,                          Address offset: 0x44 */
#define RTC_RESERVED3_OFFSET    0x0048    /*!< Reserved,                                                 Address offset: 0x48 */
#define RTC_RESERVED4_OFFSET    0x004C    /*!< Reserved,                                                 Address offset: 0x4C */
#define RTC_BKP0R_OFFSET        0x0050    /*!< RTC backup register 0,                                    Address offset: 0x50 */
#define RTC_BKP1R_OFFSET        0x0054    /*!< RTC backup register 1,                                    Address offset: 0x54 */
#define RTC_BKP2R_OFFSET        0x0058    /*!< RTC backup register 2,                                    Address offset: 0x58 */
#define RTC_BKP3R_OFFSET        0x005C    /*!< RTC backup register 3,                                    Address offset: 0x5C */
#define RTC_BKP4R_OFFSET        0x0060    /*!< RTC backup register 4,                                    Address offset: 0x60 */

