the-nw1-group/acb-modules/acb-common/include/stm32f0xx.inc
#define CAL   CALR

/** 
  * @brief Serial Peripheral Interface
  */

#define SPI_CR1_OFFSET          0x0000    /*!< SPI Control register 1 (not used in I2S mode),       Address offset: 0x00 */
#define SPI_RESERVED0_OFFSET    0x0002    /*!< Reserved, 0x02                                                            */
#define SPI_CR2_OFFSET          0x0004    /*!< SPI Control register 2,                              Address offset: 0x04 */
#define SPI_RESERVED1_OFFSET    0x0006    /*!< Reserved, 0x06                                                            */
#define SPI_SR_OFFSET           0x0008    /*!< SPI Status register,                                 Address offset: 0x08 */
#define SPI_RESERVED2_OFFSET    0x000A    /*!< Reserved, 0x0A                                                            */
#define SPI_DR_OFFSET           0x000C    /*!< SPI data register,                                   Address offset: 0x0C */
#define SPI_RESERVED3_OFFSET    0x000E    /*!< Reserved, 0x0E                                                            */
#define SPI_CRCPR_OFFSET        0x0010    /*!< SPI CRC polynomial register (not used in I2S mode),  Address offset: 0x10 */
#define SPI_RESERVED4_OFFSET    0x0012    /*!< Reserved, 0x12                                                            */
#define SPI_RXCRCR_OFFSET       0x0014    /*!< SPI Rx CRC register (not used in I2S mode),          Address offset: 0x14 */
#define SPI_RESERVED5_OFFSET    0x0016    /*!< Reserved, 0x16                                                            */
#define SPI_TXCRCR_OFFSET       0x0018    /*!< SPI Tx CRC register (not used in I2S mode),          Address offset: 0x18 */
#define SPI_RESERVED6_OFFSET    0x001A    /*!< Reserved, 0x1A                                                            */
#define SPI_I2SCFGR_OFFSET      0x001C    /*!< SPI_I2S configuration register,                      Address offset: 0x1C */
#define SPI_RESERVED7_OFFSET    0x001E    /*!< Reserved, 0x1E                                                            */
#define SPI_I2SPR_OFFSET        0x0020    /*!< SPI_I2S prescaler register,                          Address offset: 0x20 */
#define SPI_RESERVED8_OFFSET    0x0022    /*!< Reserved, 0x22                                                            */


/** 
  * @brief TIM
  */
#define TIM_CR1_OFFSET           0x0000    /*!< TIM control register 1,                      Address offset: 0x00 */
#define TIM_RESERVED0_OFFSET     0x0002    /*!< Reserved,                                                    0x02 */
#define TIM_CR2_OFFSET           0x0004    /*!< TIM control register 2,                      Address offset: 0x04 */
#define TIM_RESERVED1_OFFSET     0x0006    /*!< Reserved,                                                    0x06 */
#define TIM_SMCR_OFFSET          0x0008    /*!< TIM slave Mode Control register,             Address offset: 0x08 */
#define TIM_RESERVED2_OFFSET     0x000A    /*!< Reserved,                                                    0x0A */
#define TIM_DIER_OFFSET          0x000C    /*!< TIM DMA/interrupt enable register,           Address offset: 0x0C */
#define TIM_RESERVED3_OFFSET     0x000E    /*!< Reserved,                                                    0x0E */
#define TIM_SR_OFFSET            0x0010    /*!< TIM status register,                         Address offset: 0x10 */
#define TIM_RESERVED4_OFFSET     0x0012    /*!< Reserved,                                                    0x12 */
#define TIM_EGR_OFFSET           0x0014    /*!< TIM event generation register,               Address offset: 0x14 */
#define TIM_RESERVED5_OFFSET     0x0016    /*!< Reserved,                                                    0x16 */
#define TIM_CCMR1_OFFSET         0x0018    /*!< TIM  capture/compare mode register 1,        Address offset: 0x18 */
#define TIM_RESERVED6_OFFSET     0x001A    /*!< Reserved,                                                    0x1A */
#define TIM_CCMR2_OFFSET         0x001C    /*!< TIM  capture/compare mode register 2,        Address offset: 0x1C */
#define TIM_RESERVED7_OFFSET     0x001E    /*!< Reserved,                                                    0x1E */
#define TIM_CCER_OFFSET          0x0020    /*!< TIM capture/compare enable register,         Address offset: 0x20 */
#define TIM_RESERVED8_OFFSET     0x0022    /*!< Reserved,                                                    0x22 */
#define TIM_CNT_OFFSET           0x0024    /*!< TIM counter register,                        Address offset: 0x24 */
#define TIM_PSC_OFFSET           0x0028    /*!< TIM prescaler register,                      Address offset: 0x28 */
#define TIM_RESERVED10_OFFSET    0x002A    /*!< Reserved,                                                    0x2A */
#define TIM_ARR_OFFSET           0x002C    /*!< TIM auto-reload register,                    Address offset: 0x2C */
#define TIM_RCR_OFFSET           0x0030    /*!< TIM  repetition counter register,            Address offset: 0x30 */
#define TIM_RESERVED12_OFFSET    0x0032    /*!< Reserved,                                                    0x32 */
#define TIM_CCR1_OFFSET          0x0034    /*!< TIM capture/compare register 1,              Address offset: 0x34 */
#define TIM_CCR2_OFFSET          0x0038    /*!< TIM capture/compare register 2,              Address offset: 0x38 */
#define TIM_CCR3_OFFSET          0x003C    /*!< TIM capture/compare register 3,              Address offset: 0x3C */
#define TIM_CCR4_OFFSET          0x0040    /*!< TIM capture/compare register 4,              Address offset: 0x40 */
#define TIM_BDTR_OFFSET          0x0044    /*!< TIM break and dead-time register,            Address offset: 0x44 */
#define TIM_RESERVED17_OFFSET    0x0046    /*!< Reserved,                                                    0x26 */
#define TIM_DCR_OFFSET           0x0048    /*!< TIM DMA control register,                    Address offset: 0x48 */
#define TIM_RESERVED18_OFFSET    0x004A    /*!< Reserved,                                                    0x4A */
#define TIM_DMAR_OFFSET          0x004C    /*!< TIM DMA address for full transfer register,  Address offset: 0x4C */
#define TIM_RESERVED19_OFFSET    0x004E    /*!< Reserved,                                                    0x4E */
#define TIM_OR_OFFSET            0x0050    /*!< TIM option register,                         Address offset: 0x50 */
#define TIM_RESERVED20_OFFSET    0x0052    /*!< Reserved,                                                    0x52 */

/** 
  * @brief Touch Sensing Controller (TSC)
  */
#define TSC_CR_OFFSET           0x0000    /*!< TSC control register,                                     Address offset: 0x00 */
#define TSC_IER_OFFSET          0x0004    /*!< TSC interrupt enable register,                            Address offset: 0x04 */
#define TSC_ICR_OFFSET          0x0008    /*!< TSC interrupt clear register,                             Address offset: 0x08 */
#define TSC_ISR_OFFSET          0x000C    /*!< TSC interrupt status register,                            Address offset: 0x0C */
#define TSC_IOHCR_OFFSET        0x0010    /*!< TSC I/O hysteresis control register,                      Address offset: 0x10 */
#define TSC_RESERVED1_OFFSET    0x0014    /*!< Reserved,                                                 Address offset: 0x14 */
#define TSC_IOASCR_OFFSET       0x0018    /*!< TSC I/O analog switch control register,                   Address offset: 0x18 */
#define TSC_RESERVED2_OFFSET    0x001C    /*!< Reserved,                                                 Address offset: 0x1C */
#define TSC_IOSCR_OFFSET        0x0020    /*!< TSC I/O sampling control register,                        Address offset: 0x20 */
#define TSC_RESERVED3_OFFSET    0x0024    /*!< Reserved,                                                 Address offset: 0x24 */
#define TSC_IOCCR_OFFSET        0x0028    /*!< TSC I/O channel control register,                         Address offset: 0x28 */
#define TSC_RESERVED4_OFFSET    0x002C    /*!< Reserved,                                                 Address offset: 0x2C */
#define TSC_IOGCSR_OFFSET       0x0030    /*!< TSC I/O group control status register,                    Address offset: 0x30 */
#define TSC_IOGXCR_OFFSET       0x0034    /*!< TSC I/O group x counter register,                         Address offset: 0x34-50 */

/** 
  * @brief Universal Synchronous Asynchronous Receiver Transmitter
  */

#define USART_CR1_OFFSET          0x0000    /*!< USART Control register 1,                 Address offset: 0x00 */
#define USART_CR2_OFFSET          0x0004    /*!< USART Control register 2,                 Address offset: 0x04 */
#define USART_CR3_OFFSET          0x0008    /*!< USART Control register 3,                 Address offset: 0x08 */
#define USART_BRR_OFFSET          0x000C    /*!< USART Baud rate register,                 Address offset: 0x0C */
#define USART_RESERVED1_OFFSET    0x000E    /*!< Reserved, 0x0E                                                 */
#define USART_GTPR_OFFSET         0x0010    /*!< USART Guard time and prescaler register,  Address offset: 0x10 */
#define USART_RESERVED2_OFFSET    0x0012    /*!< Reserved, 0x12                                                 */
#define USART_RTOR_OFFSET         0x0014    /*!< USART Receiver Time Out register,         Address offset: 0x14 */
#define USART_RQR_OFFSET          0x0018    /*!< USART Request register,                   Address offset: 0x18 */
#define USART_RESERVED3_OFFSET    0x001A    /*!< Reserved, 0x1A                                                 */
#define USART_ISR_OFFSET          0x001C    /*!< USART Interrupt and status register,      Address offset: 0x1C */
#define USART_ICR_OFFSET          0x0020    /*!< USART Interrupt flag Clear register,      Address offset: 0x20 */
#define USART_RDR_OFFSET          0x0024    /*!< USART Receive Data register,              Address offset: 0x24 */
#define USART_RESERVED4_OFFSET    0x0026    /*!< Reserved, 0x26                                                 */
#define USART_TDR_OFFSET          0x0028    /*!< USART Transmit Data register,             Address offset: 0x28 */
#define USART_RESERVED5_OFFSET    0x002A    /*!< Reserved, 0x2A                                                 */


/** 
  * @brief Window WATCHDOG
  */
#define WWDG_CR_OFFSET     0x0000    /*!< WWDG Control register,       Address offset: 0x00 */
#define WWDG_CFR_OFFSET    0x0004    /*!< WWDG Configuration register, Address offset: 0x04 */
#define WWDG_SR_OFFSET     0x0008    /*!< WWDG Status register,        Address offset: 0x08 */


/**
  * @}
  */

/** @addtogroup Peripheral_memory_map
  * @{
  */

