the-nw1-group/acb-modules/acb-common/include/stm32f0xx.inc
#define FLASH_BASE            (0x08000000) /*!< FLASH base address in the alias region */
#define SRAM_BASE             (0x20000000) /*!< SRAM base address in the alias region */
#define PERIPH_BASE           (0x40000000) /*!< Peripheral base address in the alias region */

#define APBPERIPH_BASE        PERIPH_BASE
#define AHBPERIPH_BASE        (PERIPH_BASE + 0x00020000)
#define AHB2PERIPH_BASE       (PERIPH_BASE + 0x08000000)

#define TIM2_BASE             (APBPERIPH_BASE + 0x00000000)
#define TIM3_BASE             (APBPERIPH_BASE + 0x00000400)
#define TIM6_BASE             (APBPERIPH_BASE + 0x00001000)
#define TIM7_BASE             (APBPERIPH_BASE + 0x00001400)
#define TIM14_BASE            (APBPERIPH_BASE + 0x00002000)
#define RTC_BASE              (APBPERIPH_BASE + 0x00002800)
#define WWDG_BASE             (APBPERIPH_BASE + 0x00002C00)
#define IWDG_BASE             (APBPERIPH_BASE + 0x00003000)
#define SPI2_BASE             (APBPERIPH_BASE + 0x00003800)
#define USART2_BASE           (APBPERIPH_BASE + 0x00004400)
#define USART3_BASE           (APBPERIPH_BASE + 0x00004800)
#define USART4_BASE           (APBPERIPH_BASE + 0x00004C00)
#define I2C1_BASE             (APBPERIPH_BASE + 0x00005400)
#define I2C2_BASE             (APBPERIPH_BASE + 0x00005800)
#define CAN_BASE              (APBPERIPH_BASE + 0x00006400)
#define CRS_BASE              (APBPERIPH_BASE + 0x00006C00)
#define PWR_BASE              (APBPERIPH_BASE + 0x00007000)
#define DAC_BASE              (APBPERIPH_BASE + 0x00007400)
#define CEC_BASE              (APBPERIPH_BASE + 0x00007800)

#define SYSCFG_BASE           (APBPERIPH_BASE + 0x00010000)
#define COMP_BASE             (APBPERIPH_BASE + 0x0001001C)
#define EXTI_BASE             (APBPERIPH_BASE + 0x00010400)
#define ADC1_BASE             (APBPERIPH_BASE + 0x00012400)
#define ADC_BASE              (APBPERIPH_BASE + 0x00012708)
#define TIM1_BASE             (APBPERIPH_BASE + 0x00012C00)
#define SPI1_BASE             (APBPERIPH_BASE + 0x00013000)
#define USART1_BASE           (APBPERIPH_BASE + 0x00013800)
#define TIM15_BASE            (APBPERIPH_BASE + 0x00014000)
#define TIM16_BASE            (APBPERIPH_BASE + 0x00014400)
#define TIM17_BASE            (APBPERIPH_BASE + 0x00014800)
#define DBGMCU_BASE           (APBPERIPH_BASE + 0x00015800)

#define DMA1_BASE             (AHBPERIPH_BASE + 0x00000000)
#define DMA1_Channel1_BASE    (DMA1_BASE + 0x00000008)
#define DMA1_Channel2_BASE    (DMA1_BASE + 0x0000001C)
#define DMA1_Channel3_BASE    (DMA1_BASE + 0x00000030)
#define DMA1_Channel4_BASE    (DMA1_BASE + 0x00000044)
#define DMA1_Channel5_BASE    (DMA1_BASE + 0x00000058)
#define DMA1_Channel6_BASE    (DMA1_BASE + 0x0000006C)
#define DMA1_Channel7_BASE    (DMA1_BASE + 0x00000080)

#define RCC_BASE              (AHBPERIPH_BASE + 0x00001000)
#define FLASH_R_BASE          (AHBPERIPH_BASE + 0x00002000) /*!< FLASH registers base address */
#define OB_BASE               (0x1FFFF800)        /*!< FLASH Option Bytes base address */
#define CRC_BASE              (AHBPERIPH_BASE + 0x00003000)
#define TSC_BASE              (AHBPERIPH_BASE + 0x00004000)

#define GPIOA_BASE            (AHB2PERIPH_BASE + 0x00000000)
#define GPIOB_BASE            (AHB2PERIPH_BASE + 0x00000400)
#define GPIOC_BASE            (AHB2PERIPH_BASE + 0x00000800)
#define GPIOD_BASE            (AHB2PERIPH_BASE + 0x00000C00)
#define GPIOE_BASE            (AHB2PERIPH_BASE + 0x00001000)
#define GPIOF_BASE            (AHB2PERIPH_BASE + 0x00001400)

/**
  * @}
  */

/** @addtogroup Peripheral_declaration
  * @{
  */  

#define TIM2                (TIM2_BASE)
#define _TIM2_CR1           (TIM2 + TIM_CR1_OFFSET)           /*!< TIM control register 1,                      Address offset: 0x00 */
#define _TIM2_CR2           (TIM2 + TIM_CR2_OFFSET)           /*!< TIM control register 2,                      Address offset: 0x04 */
#define _TIM2_SMCR          (TIM2 + TIM_SMCR_OFFSET)          /*!< TIM slave Mode Control register,             Address offset: 0x08 */
#define _TIM2_DIER          (TIM2 + TIM_DIER_OFFSET)          /*!< TIM DMA/interrupt enable register,           Address offset: 0x0C */
#define _TIM2_SR            (TIM2 + TIM_SR_OFFSET)            /*!< TIM status register,                         Address offset: 0x10 */
#define _TIM2_EGR           (TIM2 + TIM_EGR_OFFSET)           /*!< TIM event generation register,               Address offset: 0x14 */
#define _TIM2_CCMR1         (TIM2 + TIM_CCMR1_OFFSET)         /*!< TIM  capture/compare mode register 1,        Address offset: 0x18 */
#define _TIM2_CCMR2         (TIM2 + TIM_CCMR2_OFFSET)         /*!< TIM  capture/compare mode register 2,        Address offset: 0x1C */
#define _TIM2_CCER          (TIM2 + TIM_CCER_OFFSET)          /*!< TIM capture/compare enable register,         Address offset: 0x20 */
#define _TIM2_CNT           (TIM2 + TIM_CNT_OFFSET)           /*!< TIM counter register,                        Address offset: 0x24 */
#define _TIM2_PSC           (TIM2 + TIM_PSC_OFFSET)           /*!< TIM prescaler register,                      Address offset: 0x28 */
#define _TIM2_ARR           (TIM2 + TIM_ARR_OFFSET)           /*!< TIM auto-reload register,                    Address offset: 0x2C */
#define _TIM2_RCR           (TIM2 + TIM_RCR_OFFSET)           /*!< TIM  repetition counter register,            Address offset: 0x30 */
#define _TIM2_CCR1          (TIM2 + TIM_CCR1_OFFSET)          /*!< TIM capture/compare register 1,              Address offset: 0x34 */
#define _TIM2_CCR2          (TIM2 + TIM_CCR2_OFFSET)          /*!< TIM capture/compare register 2,              Address offset: 0x38 */
#define _TIM2_CCR3          (TIM2 + TIM_CCR3_OFFSET)          /*!< TIM capture/compare register 3,              Address offset: 0x3C */
#define _TIM2_CCR4          (TIM2 + TIM_CCR4_OFFSET)          /*!< TIM capture/compare register 4,              Address offset: 0x40 */
#define _TIM2_BDTR          (TIM2 + TIM_BDTR_OFFSET)          /*!< TIM break and dead-time register,            Address offset: 0x44 */
#define _TIM2_DCR           (TIM2 + TIM_DCR_OFFSET)           /*!< TIM DMA control register,                    Address offset: 0x48 */
#define _TIM2_DMAR          (TIM2 + TIM_DMAR_OFFSET)          /*!< TIM DMA address for full transfer register,  Address offset: 0x4C */
#define _TIM2_OR            (TIM2 + TIM_OR_OFFSET)            /*!< TIM option register,                         Address offset: 0x50 */

#define TIM3                (TIM3_BASE)
#define _TIM3_CR1           (TIM3 + TIM_CR1_OFFSET)           /*!< TIM control register 1,                      Address offset: 0x00 */
#define _TIM3_CR2           (TIM3 + TIM_CR2_OFFSET)           /*!< TIM control register 2,                      Address offset: 0x04 */
#define _TIM3_SMCR          (TIM3 + TIM_SMCR_OFFSET)          /*!< TIM slave Mode Control register,             Address offset: 0x08 */
#define _TIM3_DIER          (TIM3 + TIM_DIER_OFFSET)          /*!< TIM DMA/interrupt enable register,           Address offset: 0x0C */
#define _TIM3_SR            (TIM3 + TIM_SR_OFFSET)            /*!< TIM status register,                         Address offset: 0x10 */
#define _TIM3_EGR           (TIM3 + TIM_EGR_OFFSET)           /*!< TIM event generation register,               Address offset: 0x14 */
#define _TIM3_CCMR1         (TIM3 + TIM_CCMR1_OFFSET)         /*!< TIM  capture/compare mode register 1,        Address offset: 0x18 */
#define _TIM3_CCMR2         (TIM3 + TIM_CCMR2_OFFSET)         /*!< TIM  capture/compare mode register 2,        Address offset: 0x1C */
#define _TIM3_CCER          (TIM3 + TIM_CCER_OFFSET)          /*!< TIM capture/compare enable register,         Address offset: 0x20 */
#define _TIM3_CNT           (TIM3 + TIM_CNT_OFFSET)           /*!< TIM counter register,                        Address offset: 0x24 */
#define _TIM3_PSC           (TIM3 + TIM_PSC_OFFSET)           /*!< TIM prescaler register,                      Address offset: 0x28 */
#define _TIM3_ARR           (TIM3 + TIM_ARR_OFFSET)           /*!< TIM auto-reload register,                    Address offset: 0x2C */
#define _TIM3_RCR           (TIM3 + TIM_RCR_OFFSET)           /*!< TIM  repetition counter register,            Address offset: 0x30 */
#define _TIM3_CCR1          (TIM3 + TIM_CCR1_OFFSET)          /*!< TIM capture/compare register 1,              Address offset: 0x34 */
#define _TIM3_CCR2          (TIM3 + TIM_CCR2_OFFSET)          /*!< TIM capture/compare register 2,              Address offset: 0x38 */
#define _TIM3_CCR3          (TIM3 + TIM_CCR3_OFFSET)          /*!< TIM capture/compare register 3,              Address offset: 0x3C */
#define _TIM3_CCR4          (TIM3 + TIM_CCR4_OFFSET)          /*!< TIM capture/compare register 4,              Address offset: 0x40 */
#define _TIM3_BDTR          (TIM3 + TIM_BDTR_OFFSET)          /*!< TIM break and dead-time register,            Address offset: 0x44 */
#define _TIM3_DCR           (TIM3 + TIM_DCR_OFFSET)           /*!< TIM DMA control register,                    Address offset: 0x48 */
#define _TIM3_DMAR          (TIM3 + TIM_DMAR_OFFSET)          /*!< TIM DMA address for full transfer register,  Address offset: 0x4C */
#define _TIM3_OR            (TIM3 + TIM_OR_OFFSET)            /*!< TIM option register,                         Address offset: 0x50 */

