the-nw1-group/acb-modules/acb-common/include/stm32f0xx.inc
#define TIM6                (TIM6_BASE)
#define _TIM6_CR1           (TIM6 + TIM_CR1_OFFSET)           /*!< TIM control register 1,                      Address offset: 0x00 */
#define _TIM6_CR2           (TIM6 + TIM_CR2_OFFSET)           /*!< TIM control register 2,                      Address offset: 0x04 */
#define _TIM6_SMCR          (TIM6 + TIM_SMCR_OFFSET)          /*!< TIM slave Mode Control register,             Address offset: 0x08 */
#define _TIM6_DIER          (TIM6 + TIM_DIER_OFFSET)          /*!< TIM DMA/interrupt enable register,           Address offset: 0x0C */
#define _TIM6_SR            (TIM6 + TIM_SR_OFFSET)            /*!< TIM status register,                         Address offset: 0x10 */
#define _TIM6_EGR           (TIM6 + TIM_EGR_OFFSET)           /*!< TIM event generation register,               Address offset: 0x14 */
#define _TIM6_CCMR1         (TIM6 + TIM_CCMR1_OFFSET)         /*!< TIM  capture/compare mode register 1,        Address offset: 0x18 */
#define _TIM6_CCMR2         (TIM6 + TIM_CCMR2_OFFSET)         /*!< TIM  capture/compare mode register 2,        Address offset: 0x1C */
#define _TIM6_CCER          (TIM6 + TIM_CCER_OFFSET)          /*!< TIM capture/compare enable register,         Address offset: 0x20 */
#define _TIM6_CNT           (TIM6 + TIM_CNT_OFFSET)           /*!< TIM counter register,                        Address offset: 0x24 */
#define _TIM6_PSC           (TIM6 + TIM_PSC_OFFSET)           /*!< TIM prescaler register,                      Address offset: 0x28 */
#define _TIM6_ARR           (TIM6 + TIM_ARR_OFFSET)           /*!< TIM auto-reload register,                    Address offset: 0x2C */
#define _TIM6_RCR           (TIM6 + TIM_RCR_OFFSET)           /*!< TIM  repetition counter register,            Address offset: 0x30 */
#define _TIM6_CCR1          (TIM6 + TIM_CCR1_OFFSET)          /*!< TIM capture/compare register 1,              Address offset: 0x34 */
#define _TIM6_CCR2          (TIM6 + TIM_CCR2_OFFSET)          /*!< TIM capture/compare register 2,              Address offset: 0x38 */
#define _TIM6_CCR3          (TIM6 + TIM_CCR3_OFFSET)          /*!< TIM capture/compare register 3,              Address offset: 0x3C */
#define _TIM6_CCR4          (TIM6 + TIM_CCR4_OFFSET)          /*!< TIM capture/compare register 4,              Address offset: 0x40 */
#define _TIM6_BDTR          (TIM6 + TIM_BDTR_OFFSET)          /*!< TIM break and dead-time register,            Address offset: 0x44 */
#define _TIM6_DCR           (TIM6 + TIM_DCR_OFFSET)           /*!< TIM DMA control register,                    Address offset: 0x48 */
#define _TIM6_DMAR          (TIM6 + TIM_DMAR_OFFSET)          /*!< TIM DMA address for full transfer register,  Address offset: 0x4C */
#define _TIM6_OR            (TIM6 + TIM_OR_OFFSET)            /*!< TIM option register,                         Address offset: 0x50 */

#define TIM7                (TIM7_BASE)
#define _TIM7_CR1           (TIM7 + TIM_CR1_OFFSET)           /*!< TIM control register 1,                      Address offset: 0x00 */
#define _TIM7_CR2           (TIM7 + TIM_CR2_OFFSET)           /*!< TIM control register 2,                      Address offset: 0x04 */
#define _TIM7_SMCR          (TIM7 + TIM_SMCR_OFFSET)          /*!< TIM slave Mode Control register,             Address offset: 0x08 */
#define _TIM7_DIER          (TIM7 + TIM_DIER_OFFSET)          /*!< TIM DMA/interrupt enable register,           Address offset: 0x0C */
#define _TIM7_SR            (TIM7 + TIM_SR_OFFSET)            /*!< TIM status register,                         Address offset: 0x10 */
#define _TIM7_EGR           (TIM7 + TIM_EGR_OFFSET)           /*!< TIM event generation register,               Address offset: 0x14 */
#define _TIM7_CCMR1         (TIM7 + TIM_CCMR1_OFFSET)         /*!< TIM  capture/compare mode register 1,        Address offset: 0x18 */
#define _TIM7_CCMR2         (TIM7 + TIM_CCMR2_OFFSET)         /*!< TIM  capture/compare mode register 2,        Address offset: 0x1C */
#define _TIM7_CCER          (TIM7 + TIM_CCER_OFFSET)          /*!< TIM capture/compare enable register,         Address offset: 0x20 */
#define _TIM7_CNT           (TIM7 + TIM_CNT_OFFSET)           /*!< TIM counter register,                        Address offset: 0x24 */
#define _TIM7_PSC           (TIM7 + TIM_PSC_OFFSET)           /*!< TIM prescaler register,                      Address offset: 0x28 */
#define _TIM7_ARR           (TIM7 + TIM_ARR_OFFSET)           /*!< TIM auto-reload register,                    Address offset: 0x2C */
#define _TIM7_RCR           (TIM7 + TIM_RCR_OFFSET)           /*!< TIM  repetition counter register,            Address offset: 0x30 */
#define _TIM7_CCR1          (TIM7 + TIM_CCR1_OFFSET)          /*!< TIM capture/compare register 1,              Address offset: 0x34 */
#define _TIM7_CCR2          (TIM7 + TIM_CCR2_OFFSET)          /*!< TIM capture/compare register 2,              Address offset: 0x38 */
#define _TIM7_CCR3          (TIM7 + TIM_CCR3_OFFSET)          /*!< TIM capture/compare register 3,              Address offset: 0x3C */
#define _TIM7_CCR4          (TIM7 + TIM_CCR4_OFFSET)          /*!< TIM capture/compare register 4,              Address offset: 0x40 */
#define _TIM7_BDTR          (TIM7 + TIM_BDTR_OFFSET)          /*!< TIM break and dead-time register,            Address offset: 0x44 */
#define _TIM7_DCR           (TIM7 + TIM_DCR_OFFSET)           /*!< TIM DMA control register,                    Address offset: 0x48 */
#define _TIM7_DMAR          (TIM7 + TIM_DMAR_OFFSET)          /*!< TIM DMA address for full transfer register,  Address offset: 0x4C */
#define _TIM7_OR            (TIM7 + TIM_OR_OFFSET)            /*!< TIM option register,                         Address offset: 0x50 */

#define TIM14               (TIM14_BASE)
#define _TIM14_CR1           (TIM14 + TIM_CR1_OFFSET)           /*!< TIM control register 1,                      Address offset: 0x00 */
#define _TIM14_CR2           (TIM14 + TIM_CR2_OFFSET)           /*!< TIM control register 2,                      Address offset: 0x04 */
#define _TIM14_SMCR          (TIM14 + TIM_SMCR_OFFSET)          /*!< TIM slave Mode Control register,             Address offset: 0x08 */
#define _TIM14_DIER          (TIM14 + TIM_DIER_OFFSET)          /*!< TIM DMA/interrupt enable register,           Address offset: 0x0C */
#define _TIM14_SR            (TIM14 + TIM_SR_OFFSET)            /*!< TIM status register,                         Address offset: 0x10 */
#define _TIM14_EGR           (TIM14 + TIM_EGR_OFFSET)           /*!< TIM event generation register,               Address offset: 0x14 */
#define _TIM14_CCMR1         (TIM14 + TIM_CCMR1_OFFSET)         /*!< TIM  capture/compare mode register 1,        Address offset: 0x18 */
#define _TIM14_CCMR2         (TIM14 + TIM_CCMR2_OFFSET)         /*!< TIM  capture/compare mode register 2,        Address offset: 0x1C */
#define _TIM14_CCER          (TIM14 + TIM_CCER_OFFSET)          /*!< TIM capture/compare enable register,         Address offset: 0x20 */
#define _TIM14_CNT           (TIM14 + TIM_CNT_OFFSET)           /*!< TIM counter register,                        Address offset: 0x24 */
#define _TIM14_PSC           (TIM14 + TIM_PSC_OFFSET)           /*!< TIM prescaler register,                      Address offset: 0x28 */
#define _TIM14_ARR           (TIM14 + TIM_ARR_OFFSET)           /*!< TIM auto-reload register,                    Address offset: 0x2C */
#define _TIM14_RCR           (TIM14 + TIM_RCR_OFFSET)           /*!< TIM  repetition counter register,            Address offset: 0x30 */
#define _TIM14_CCR1          (TIM14 + TIM_CCR1_OFFSET)          /*!< TIM capture/compare register 1,              Address offset: 0x34 */
#define _TIM14_CCR2          (TIM14 + TIM_CCR2_OFFSET)          /*!< TIM capture/compare register 2,              Address offset: 0x38 */
#define _TIM14_CCR3          (TIM14 + TIM_CCR3_OFFSET)          /*!< TIM capture/compare register 3,              Address offset: 0x3C */
#define _TIM14_CCR4          (TIM14 + TIM_CCR4_OFFSET)          /*!< TIM capture/compare register 4,              Address offset: 0x40 */
#define _TIM14_BDTR          (TIM14 + TIM_BDTR_OFFSET)          /*!< TIM break and dead-time register,            Address offset: 0x44 */
#define _TIM14_DCR           (TIM14 + TIM_DCR_OFFSET)           /*!< TIM DMA control register,                    Address offset: 0x48 */
#define _TIM14_DMAR          (TIM14 + TIM_DMAR_OFFSET)          /*!< TIM DMA address for full transfer register,  Address offset: 0x4C */
#define _TIM14_OR            (TIM14 + TIM_OR_OFFSET)            /*!< TIM option register,                         Address offset: 0x50 */

#define RTC                 (RTC_BASE)
#define _RTC_TR           (RTC + RTC_TR_OFFSET)           /*!< RTC time register,                                        Address offset: 0x00 */
#define _RTC_DR           (RTC + RTC_DR_OFFSET)           /*!< RTC date register,                                        Address offset: 0x04 */
#define _RTC_CR           (RTC + RTC_CR_OFFSET)           /*!< RTC control register,                                     Address offset: 0x08 */
#define _RTC_ISR          (RTC + RTC_ISR_OFFSET)          /*!< RTC initialization and status register,                   Address offset: 0x0C */
#define _RTC_PRER         (RTC + RTC_PRER_OFFSET)         /*!< RTC prescaler register,                                   Address offset: 0x10 */
#define _RTC_WUTR         (RTC + RTC_WUTR_OFFSET)         /*!< RTC wakeup timer register,(only for STM32F072 devices)    Address offset: 0x14 */
#define _RTC_ALRMAR       (RTC + RTC_ALRMAR_OFFSET)       /*!< RTC alarm A register,                                     Address offset: 0x1C */
#define _RTC_WPR          (RTC + RTC_WPR_OFFSET)          /*!< RTC write protection register,                            Address offset: 0x24 */
#define _RTC_SSR          (RTC + RTC_SSR_OFFSET)          /*!< RTC sub second register,                                  Address offset: 0x28 */
#define _RTC_SHIFTR       (RTC + RTC_SHIFTR_OFFSET)       /*!< RTC shift control register,                               Address offset: 0x2C */
#define _RTC_TSTR         (RTC + RTC_TSTR_OFFSET)         /*!< RTC time stamp time register,                             Address offset: 0x30 */
#define _RTC_TSDR         (RTC + RTC_TSDR_OFFSET)         /*!< RTC time stamp date register,                             Address offset: 0x34 */
#define _RTC_TSSSR        (RTC + RTC_TSSSR_OFFSET)        /*!< RTC time-stamp sub second register,                       Address offset: 0x38 */
#define _RTC_CALR         (RTC + RTC_CALR_OFFSET)         /*!< RTC calibration register,                                 Address offset: 0x3C */
#define _RTC_TAFCR        (RTC + RTC_TAFCR_OFFSET)        /*!< RTC tamper and alternate function configuration register, Address offset: 0x40 */
#define _RTC_ALRMASSR     (RTC + RTC_ALRMASSR_OFFSET)     /*!< RTC alarm A sub second register,                          Address offset: 0x44 */
#define _RTC_BKP0R        (RTC + RTC_BKP0R_OFFSET)        /*!< RTC backup register 0,                                    Address offset: 0x50 */
#define _RTC_BKP1R        (RTC + RTC_BKP1R_OFFSET)        /*!< RTC backup register 1,                                    Address offset: 0x54 */
#define _RTC_BKP2R        (RTC + RTC_BKP2R_OFFSET)        /*!< RTC backup register 2,                                    Address offset: 0x58 */
#define _RTC_BKP3R        (RTC + RTC_BKP3R_OFFSET)        /*!< RTC backup register 3,                                    Address offset: 0x5C */
#define _RTC_BKP4R        (RTC + RTC_BKP4R_OFFSET)        /*!< RTC backup register 4,                                    Address offset: 0x60 */

#define WWDG                (WWDG_BASE)
#define _WWDG_CR     (WWDG + WWDG_CR_OFFSET)     /*!< WWDG Control register,       Address offset: 0x00 */
#define _WWDG_CFR    (WWDG + WWDG_CFR_OFFSET)    /*!< WWDG Configuration register, Address offset: 0x04 */
#define _WWDG_SR     (WWDG + WWDG_SR_OFFSET)     /*!< WWDG Status register,        Address offset: 0x08 */

#define IWDG                (IWDG_BASE)
#define _IWDG_KR      (IWDG + IWDG_KR_OFFSET)      /*!< IWDG Key register,       Address offset: 0x00 */
#define _IWDG_PR      (IWDG + IWDG_PR_OFFSET)      /*!< IWDG Prescaler register, Address offset: 0x04 */
#define _IWDG_RLR     (IWDG + IWDG_RLR_OFFSET)     /*!< IWDG Reload register,    Address offset: 0x08 */
#define _IWDG_SR      (IWDG + IWDG_SR_OFFSET)      /*!< IWDG Status register,    Address offset: 0x0C */
#define _IWDG_WINR    (IWDG + IWDG_WINR_OFFSET)    /*!< IWDG Window register,    Address offset: 0x10 */

#define SPI2                (SPI2_BASE)
#define _SPI2_CR1          (SPI2 + SPI_CR1_OFFSET)          /*!< SPI Control register 1 (not used in I2S mode),       Address offset: 0x00 */
#define _SPI2_CR2          (SPI2 + SPI_CR2_OFFSET)          /*!< SPI Control register 2,                              Address offset: 0x04 */
#define _SPI2_SR           (SPI2 + SPI_SR_OFFSET)           /*!< SPI Status register,                                 Address offset: 0x08 */
#define _SPI2_DR           (SPI2 + SPI_DR_OFFSET)           /*!< SPI data register,                                   Address offset: 0x0C */
#define _SPI2_CRCPR        (SPI2 + SPI_CRCPR_OFFSET)        /*!< SPI CRC polynomial register (not used in I2S mode),  Address offset: 0x10 */
#define _SPI2_RXCRCR       (SPI2 + SPI_RXCRCR_OFFSET)       /*!< SPI Rx CRC register (not used in I2S mode),          Address offset: 0x14 */
#define _SPI2_TXCRCR       (SPI2 + SPI_TXCRCR_OFFSET)       /*!< SPI Tx CRC register (not used in I2S mode),          Address offset: 0x18 */
#define _SPI2_I2SCFGR      (SPI2 + SPI_I2SCFGR_OFFSET)      /*!< SPI_I2S configuration register,                      Address offset: 0x1C */
#define _SPI2_I2SPR        (SPI2 + SPI_I2SPR_OFFSET)        /*!< SPI_I2S prescaler register,                          Address offset: 0x20 */

