the-nw1-group/acb-modules/acb-common/include/stm32f0xx.inc
#define USART2              (USART2_BASE)
#define _USART2_CR1          (USART2 + USART_CR1_OFFSET)          /*!< USART Control register 1,                 Address offset: 0x00 */
#define _USART2_CR2          (USART2 + USART_CR2_OFFSET)          /*!< USART Control register 2,                 Address offset: 0x04 */
#define _USART2_CR3          (USART2 + USART_CR3_OFFSET)          /*!< USART Control register 3,                 Address offset: 0x08 */
#define _USART2_BRR          (USART2 + USART_BRR_OFFSET)          /*!< USART Baud rate register,                 Address offset: 0x0C */
#define _USART2_GTPR         (USART2 + USART_GTPR_OFFSET)         /*!< USART Guard time and prescaler register,  Address offset: 0x10 */
#define _USART2_RTOR         (USART2 + USART_RTOR_OFFSET)         /*!< USART Receiver Time Out register,         Address offset: 0x14 */
#define _USART2_RQR          (USART2 + USART_RQR_OFFSET)          /*!< USART Request register,                   Address offset: 0x18 */
#define _USART2_ISR          (USART2 + USART_ISR_OFFSET)          /*!< USART Interrupt and status register,      Address offset: 0x1C */
#define _USART2_ICR          (USART2 + USART_ICR_OFFSET)          /*!< USART Interrupt flag Clear register,      Address offset: 0x20 */
#define _USART2_RDR          (USART2 + USART_RDR_OFFSET)          /*!< USART Receive Data register,              Address offset: 0x24 */
#define _USART2_TDR          (USART2 + USART_TDR_OFFSET)          /*!< USART Transmit Data register,             Address offset: 0x28 */

#define USART3              (USART3_BASE)
#define _USART3_CR1          (USART3 + USART_CR1_OFFSET)          /*!< USART Control register 1,                 Address offset: 0x00 */
#define _USART3_CR2          (USART3 + USART_CR2_OFFSET)          /*!< USART Control register 2,                 Address offset: 0x04 */
#define _USART3_CR3          (USART3 + USART_CR3_OFFSET)          /*!< USART Control register 3,                 Address offset: 0x08 */
#define _USART3_BRR          (USART3 + USART_BRR_OFFSET)          /*!< USART Baud rate register,                 Address offset: 0x0C */
#define _USART3_GTPR         (USART3 + USART_GTPR_OFFSET)         /*!< USART Guard time and prescaler register,  Address offset: 0x10 */
#define _USART3_RTOR         (USART3 + USART_RTOR_OFFSET)         /*!< USART Receiver Time Out register,         Address offset: 0x14 */
#define _USART3_RQR          (USART3 + USART_RQR_OFFSET)          /*!< USART Request register,                   Address offset: 0x18 */
#define _USART3_ISR          (USART3 + USART_ISR_OFFSET)          /*!< USART Interrupt and status register,      Address offset: 0x1C */
#define _USART3_ICR          (USART3 + USART_ICR_OFFSET)          /*!< USART Interrupt flag Clear register,      Address offset: 0x20 */
#define _USART3_RDR          (USART3 + USART_RDR_OFFSET)          /*!< USART Receive Data register,              Address offset: 0x24 */
#define _USART3_TDR          (USART3 + USART_TDR_OFFSET)          /*!< USART Transmit Data register,             Address offset: 0x28 */

#define USART4              (USART4_BASE)
#define _USART4_CR1          (USART4 + USART_CR1_OFFSET)          /*!< USART Control register 1,                 Address offset: 0x00 */
#define _USART4_CR2          (USART4 + USART_CR2_OFFSET)          /*!< USART Control register 2,                 Address offset: 0x04 */
#define _USART4_CR3          (USART4 + USART_CR3_OFFSET)          /*!< USART Control register 3,                 Address offset: 0x08 */
#define _USART4_BRR          (USART4 + USART_BRR_OFFSET)          /*!< USART Baud rate register,                 Address offset: 0x0C */
#define _USART4_GTPR         (USART4 + USART_GTPR_OFFSET)         /*!< USART Guard time and prescaler register,  Address offset: 0x10 */
#define _USART4_RTOR         (USART4 + USART_RTOR_OFFSET)         /*!< USART Receiver Time Out register,         Address offset: 0x14 */
#define _USART4_RQR          (USART4 + USART_RQR_OFFSET)          /*!< USART Request register,                   Address offset: 0x18 */
#define _USART4_ISR          (USART4 + USART_ISR_OFFSET)          /*!< USART Interrupt and status register,      Address offset: 0x1C */
#define _USART4_ICR          (USART4 + USART_ICR_OFFSET)          /*!< USART Interrupt flag Clear register,      Address offset: 0x20 */
#define _USART4_RDR          (USART4 + USART_RDR_OFFSET)          /*!< USART Receive Data register,              Address offset: 0x24 */
#define _USART4_TDR          (USART4 + USART_TDR_OFFSET)          /*!< USART Transmit Data register,             Address offset: 0x28 */

#define I2C1                (I2C1_BASE)
#define _I2C1_CR1         (I2C1 + I2C_CR1_OFFSET)         /*!< I2C Control register 1,            Address offset: 0x00 */
#define _I2C1_CR2         (I2C1 + I2C_CR2_OFFSET)         /*!< I2C Control register 2,            Address offset: 0x04 */
#define _I2C1_OAR1        (I2C1 + I2C_OAR1_OFFSET)        /*!< I2C Own address 1 register,        Address offset: 0x08 */
#define _I2C1_OAR2        (I2C1 + I2C_OAR2_OFFSET)        /*!< I2C Own address 2 register,        Address offset: 0x0C */
#define _I2C1_TIMINGR     (I2C1 + I2C_TIMINGR_OFFSET)     /*!< I2C Timing register,               Address offset: 0x10 */
#define _I2C1_TIMEOUTR    (I2C1 + I2C_TIMEOUTR_OFFSET)    /*!< I2C Timeout register,              Address offset: 0x14 */
#define _I2C1_ISR         (I2C1 + I2C_ISR_OFFSET)         /*!< I2C Interrupt and status register, Address offset: 0x18 */
#define _I2C1_ICR         (I2C1 + I2C_ICR_OFFSET)         /*!< I2C Interrupt clear register,      Address offset: 0x1C */
#define _I2C1_PECR        (I2C1 + I2C_PECR_OFFSET)        /*!< I2C PEC register,                  Address offset: 0x20 */
#define _I2C1_RXDR        (I2C1 + I2C_RXDR_OFFSET)        /*!< I2C Receive data register,         Address offset: 0x24 */
#define _I2C1_TXDR        (I2C1 + I2C_TXDR_OFFSET)        /*!< I2C Transmit data register,        Address offset: 0x28 */

#define I2C2                (I2C2_BASE)
#define _I2C2_CR1         (I2C2 + I2C_CR1_OFFSET)         /*!< I2C Control register 1,            Address offset: 0x00 */
#define _I2C2_CR2         (I2C2 + I2C_CR2_OFFSET)         /*!< I2C Control register 2,            Address offset: 0x04 */
#define _I2C2_OAR1        (I2C2 + I2C_OAR1_OFFSET)        /*!< I2C Own address 1 register,        Address offset: 0x08 */
#define _I2C2_OAR2        (I2C2 + I2C_OAR2_OFFSET)        /*!< I2C Own address 2 register,        Address offset: 0x0C */
#define _I2C2_TIMINGR     (I2C2 + I2C_TIMINGR_OFFSET)     /*!< I2C Timing register,               Address offset: 0x10 */
#define _I2C2_TIMEOUTR    (I2C2 + I2C_TIMEOUTR_OFFSET)    /*!< I2C Timeout register,              Address offset: 0x14 */
#define _I2C2_ISR         (I2C2 + I2C_ISR_OFFSET)         /*!< I2C Interrupt and status register, Address offset: 0x18 */
#define _I2C2_ICR         (I2C2 + I2C_ICR_OFFSET)         /*!< I2C Interrupt clear register,      Address offset: 0x1C */
#define _I2C2_PECR        (I2C2 + I2C_PECR_OFFSET)        /*!< I2C PEC register,                  Address offset: 0x20 */
#define _I2C2_RXDR        (I2C2 + I2C_RXDR_OFFSET)        /*!< I2C Receive data register,         Address offset: 0x24 */
#define _I2C2_TXDR        (I2C2 + I2C_TXDR_OFFSET)        /*!< I2C Transmit data register,        Address offset: 0x28 */

#define CAN                 (CAN_BASE)
#define _CAN_MCR                (CAN + CAN_MCR_OFFSET)                /*!< CAN master control register,         Address offset: 0x00          */
#define _CAN_MSR                (CAN + CAN_MSR_OFFSET)                /*!< CAN master status register,          Address offset: 0x04          */
#define _CAN_TSR                (CAN + CAN_TSR_OFFSET)                /*!< CAN transmit status register,        Address offset: 0x08          */
#define _CAN_RF0R               (CAN + CAN_RF0R_OFFSET)               /*!< CAN receive FIFO 0 register,         Address offset: 0x0C          */
#define _CAN_RF1R               (CAN + CAN_RF1R_OFFSET)               /*!< CAN receive FIFO 1 register,         Address offset: 0x10          */
#define _CAN_IER                (CAN + CAN_IER_OFFSET)                /*!< CAN interrupt enable register,       Address offset: 0x14          */
#define _CAN_ESR                (CAN + CAN_ESR_OFFSET)                /*!< CAN error status register,           Address offset: 0x18          */
#define _CAN_BTR                (CAN + CAN_BTR_OFFSET)                /*!< CAN bit timing register,             Address offset: 0x1C          */
#define _CAN_sTxMailBox         (CAN + CAN_sTxMailBox_OFFSET)         /*!< CAN Tx MailBox,                      Address offset: 0x180 - 0x1AC */
#define _CAN_sFIFOMailBox       (CAN + CAN_sFIFOMailBox_OFFSET)       /*!< CAN FIFO MailBox,                    Address offset: 0x1B0 - 0x1CC */
#define _CAN_FMR                (CAN + CAN_FMR_OFFSET)                /*!< CAN filter master register,          Address offset: 0x200         */
#define _CAN_FM1R               (CAN + CAN_FM1R_OFFSET)               /*!< CAN filter mode register,            Address offset: 0x204         */
#define _CAN_FS1R               (CAN + CAN_FS1R_OFFSET)               /*!< CAN filter scale register,           Address offset: 0x20C         */
#define _CAN_FFA1R              (CAN + CAN_FFA1R_OFFSET)              /*!< CAN filter FIFO assignment register, Address offset: 0x214         */
#define _CAN_FA1R               (CAN + CAN_FA1R_OFFSET)               /*!< CAN filter activation register,      Address offset: 0x21C         */
#define _CAN_sFilterRegister    (CAN + CAN_sFilterRegister_OFFSET)    /*!< CAN Filter Register,                 Address offset: 0x240-0x31C   */

#define CRS                 (CRS_BASE)
#define _CRS_CR      (CRS + CRS_CR_OFFSET)      /*!< CRS ccontrol register,              Address offset: 0x00 */
#define _CRS_CFGR    (CRS + CRS_CFGR_OFFSET)    /*!< CRS configuration register,         Address offset: 0x04 */
#define _CRS_ISR     (CRS + CRS_ISR_OFFSET)     /*!< CRS interrupt and status register,  Address offset: 0x08 */
#define _CRS_ICR     (CRS + CRS_ICR_OFFSET)     /*!< CRS interrupt flag clear register,  Address offset: 0x0C */

#define PWR                 (PWR_BASE)
#define _PWR_CR     (PWR + PWR_CR_OFFSET)     /*!< PWR power control register,        Address offset: 0x00 */
#define _PWR_CSR    (PWR + PWR_CSR_OFFSET)    /*!< PWR power control/status register, Address offset: 0x04 */

#define DAC                 (DAC_BASE)
#define _DAC_CR         (DAC + DAC_CR_OFFSET)         /*!< DAC control register,                                    Address offset: 0x00 */
#define _DAC_SWTRIGR    (DAC + DAC_SWTRIGR_OFFSET)    /*!< DAC software trigger register,                           Address offset: 0x04 */
#define _DAC_DHR12R1    (DAC + DAC_DHR12R1_OFFSET)    /*!< DAC channel1 12-bit right-aligned data holding register, Address offset: 0x08 */
#define _DAC_DHR12L1    (DAC + DAC_DHR12L1_OFFSET)    /*!< DAC channel1 12-bit left aligned data holding register,  Address offset: 0x0C */
#define _DAC_DHR8R1     (DAC + DAC_DHR8R1_OFFSET)     /*!< DAC channel1 8-bit right aligned data holding register,  Address offset: 0x10 */
#define _DAC_DHR12R2    (DAC + DAC_DHR12R2_OFFSET)    /*!< DAC channel2 12-bit right aligned data holding register, Address offset: 0x14 */
#define _DAC_DHR12L2    (DAC + DAC_DHR12L2_OFFSET)    /*!< DAC channel2 12-bit left aligned data holding register,  Address offset: 0x18 */
#define _DAC_DHR8R2     (DAC + DAC_DHR8R2_OFFSET)     /*!< DAC channel2 8-bit right-aligned data holding register,  Address offset: 0x1C */
#define _DAC_DHR12RD    (DAC + DAC_DHR12RD_OFFSET)    /*!< Dual DAC 12-bit right-aligned data holding register,     Address offset: 0x20 */
#define _DAC_DHR12LD    (DAC + DAC_DHR12LD_OFFSET)    /*!< DUAL DAC 12-bit left aligned data holding register,      Address offset: 0x24 */
#define _DAC_DHR8RD     (DAC + DAC_DHR8RD_OFFSET)     /*!< DUAL DAC 8-bit right aligned data holding register,      Address offset: 0x28 */
#define _DAC_DOR1       (DAC + DAC_DOR1_OFFSET)       /*!< DAC channel1 data output register,                       Address offset: 0x2C */
#define _DAC_DOR2       (DAC + DAC_DOR2_OFFSET)       /*!< DAC channel2 data output register,                       Address offset: 0x30 */
#define _DAC_SR         (DAC + DAC_SR_OFFSET)         /*!< DAC status register,                                     Address offset: 0x34 */

#define CEC                 (CEC_BASE)
#define _CEC_CR      (CEC + CEC_CR_OFFSET)      /*!< CEC control register,                                       Address offset:0x00 */
#define _CEC_CFGR    (CEC + CEC_CFGR_OFFSET)    /*!< CEC configuration register,                                 Address offset:0x04 */
#define _CEC_TXDR    (CEC + CEC_TXDR_OFFSET)    /*!< CEC Tx data register ,                                      Address offset:0x08 */
#define _CEC_RXDR    (CEC + CEC_RXDR_OFFSET)    /*!< CEC Rx Data Register,                                       Address offset:0x0C */
#define _CEC_ISR     (CEC + CEC_ISR_OFFSET)     /*!< CEC Interrupt and Status Register,                          Address offset:0x10 */
#define _CEC_IER     (CEC + CEC_IER_OFFSET)     /*!< CEC interrupt enable register,                              Address offset:0x14 */


#define SYSCFG              (SYSCFG_BASE)
#define _SYSCFG_CFGR1       (SYSCFG + SYSCFG_CFGR1_OFFSET)       /*!< SYSCFG configuration register 1,                           Address offset: 0x00 */
#define _SYSCFG_EXTICR      (SYSCFG + SYSCFG_EXTICR_OFFSET)      /*!< SYSCFG external interrupt configuration register,     Address offset: 0x14-0x08 */
#define _SYSCFG_CFGR2       (SYSCFG + SYSCFG_CFGR2_OFFSET)       /*!< SYSCFG configuration register 2,                           Address offset: 0x18 */

#define COMP                (COMP_BASE)
#define _COMP_CSR    (COMP + COMP_CSR_OFFSET)    /*!< COMP comparator control and status register, Address offset: 0x1C */

#define EXTI                (EXTI_BASE)
#define _EXTI_IMR      (EXTI + EXTI_IMR_OFFSET)      /*!<EXTI Interrupt mask register,                             Address offset: 0x00 */
#define _EXTI_EMR      (EXTI + EXTI_EMR_OFFSET)      /*!<EXTI Event mask register,                                 Address offset: 0x04 */
#define _EXTI_RTSR     (EXTI + EXTI_RTSR_OFFSET)     /*!<EXTI Rising trigger selection register ,                  Address offset: 0x08 */
#define _EXTI_FTSR     (EXTI + EXTI_FTSR_OFFSET)     /*!<EXTI Falling trigger selection register,                  Address offset: 0x0C */
#define _EXTI_SWIER    (EXTI + EXTI_SWIER_OFFSET)    /*!<EXTI Software interrupt event register,                   Address offset: 0x10 */
#define _EXTI_PR       (EXTI + EXTI_PR_OFFSET)       /*!<EXTI Pending register,                                    Address offset: 0x14 */

#define ADC1                (ADC1_BASE)
#define _ADC1_ISR          (ADC1 + ADC_ISR_OFFSET)          /*!< ADC Interrupt and Status register,                          Address offset:0x00 */
#define _ADC1_IER          (ADC1 + ADC_IER_OFFSET)          /*!< ADC Interrupt Enable register,                              Address offset:0x04 */
#define _ADC1_CR           (ADC1 + ADC_CR_OFFSET)           /*!< ADC Control register,                                       Address offset:0x08 */
#define _ADC1_CFGR1        (ADC1 + ADC_CFGR1_OFFSET)        /*!< ADC Configuration register 1,                               Address offset:0x0C */
#define _ADC1_CFGR2        (ADC1 + ADC_CFGR2_OFFSET)        /*!< ADC Configuration register 2,                               Address offset:0x10 */
#define _ADC1_SMPR         (ADC1 + ADC_SMPR_OFFSET)         /*!< ADC Sampling time register,                                 Address offset:0x14 */
#define _ADC1_TR           (ADC1 + ADC_TR_OFFSET)           /*!< ADC watchdog threshold register,                            Address offset:0x20 */
#define _ADC1_CHSELR       (ADC1 + ADC_CHSELR_OFFSET)       /*!< ADC channel selection register,                             Address offset:0x28 */
#define _ADC1_DR           (ADC1 + ADC_DR_OFFSET)           /*!< ADC data register,                                          Address offset:0x40 */

#define ADC                 (ADC_BASE)
#define _ADC_CCR    (ADC + ADC_Common_CCR_OFFSET)    

#define TIM1                (TIM1_BASE)
#define _TIM1_CR1           (TIM1 + TIM_CR1_OFFSET)           /*!< TIM control register 1,                      Address offset: 0x00 */
#define _TIM1_CR2           (TIM1 + TIM_CR2_OFFSET)           /*!< TIM control register 2,                      Address offset: 0x04 */
#define _TIM1_SMCR          (TIM1 + TIM_SMCR_OFFSET)          /*!< TIM slave Mode Control register,             Address offset: 0x08 */
#define _TIM1_DIER          (TIM1 + TIM_DIER_OFFSET)          /*!< TIM DMA/interrupt enable register,           Address offset: 0x0C */
#define _TIM1_SR            (TIM1 + TIM_SR_OFFSET)            /*!< TIM status register,                         Address offset: 0x10 */
#define _TIM1_EGR           (TIM1 + TIM_EGR_OFFSET)           /*!< TIM event generation register,               Address offset: 0x14 */
#define _TIM1_CCMR1         (TIM1 + TIM_CCMR1_OFFSET)         /*!< TIM  capture/compare mode register 1,        Address offset: 0x18 */
#define _TIM1_CCMR2         (TIM1 + TIM_CCMR2_OFFSET)         /*!< TIM  capture/compare mode register 2,        Address offset: 0x1C */
#define _TIM1_CCER          (TIM1 + TIM_CCER_OFFSET)          /*!< TIM capture/compare enable register,         Address offset: 0x20 */
#define _TIM1_CNT           (TIM1 + TIM_CNT_OFFSET)           /*!< TIM counter register,                        Address offset: 0x24 */
#define _TIM1_PSC           (TIM1 + TIM_PSC_OFFSET)           /*!< TIM prescaler register,                      Address offset: 0x28 */
#define _TIM1_ARR           (TIM1 + TIM_ARR_OFFSET)           /*!< TIM auto-reload register,                    Address offset: 0x2C */
#define _TIM1_RCR           (TIM1 + TIM_RCR_OFFSET)           /*!< TIM  repetition counter register,            Address offset: 0x30 */
#define _TIM1_CCR1          (TIM1 + TIM_CCR1_OFFSET)          /*!< TIM capture/compare register 1,              Address offset: 0x34 */
#define _TIM1_CCR2          (TIM1 + TIM_CCR2_OFFSET)          /*!< TIM capture/compare register 2,              Address offset: 0x38 */
#define _TIM1_CCR3          (TIM1 + TIM_CCR3_OFFSET)          /*!< TIM capture/compare register 3,              Address offset: 0x3C */
#define _TIM1_CCR4          (TIM1 + TIM_CCR4_OFFSET)          /*!< TIM capture/compare register 4,              Address offset: 0x40 */
#define _TIM1_BDTR          (TIM1 + TIM_BDTR_OFFSET)          /*!< TIM break and dead-time register,            Address offset: 0x44 */
#define _TIM1_DCR           (TIM1 + TIM_DCR_OFFSET)           /*!< TIM DMA control register,                    Address offset: 0x48 */
#define _TIM1_DMAR          (TIM1 + TIM_DMAR_OFFSET)          /*!< TIM DMA address for full transfer register,  Address offset: 0x4C */
#define _TIM1_OR            (TIM1 + TIM_OR_OFFSET)            /*!< TIM option register,                         Address offset: 0x50 */

#define SPI1                (SPI1_BASE)
#define _SPI1_CR1          (SPI1 + SPI_CR1_OFFSET)          /*!< SPI Control register 1 (not used in I2S mode),       Address offset: 0x00 */
#define _SPI1_CR2          (SPI1 + SPI_CR2_OFFSET)          /*!< SPI Control register 2,                              Address offset: 0x04 */
#define _SPI1_SR           (SPI1 + SPI_SR_OFFSET)           /*!< SPI Status register,                                 Address offset: 0x08 */
#define _SPI1_DR           (SPI1 + SPI_DR_OFFSET)           /*!< SPI data register,                                   Address offset: 0x0C */
#define _SPI1_CRCPR        (SPI1 + SPI_CRCPR_OFFSET)        /*!< SPI CRC polynomial register (not used in I2S mode),  Address offset: 0x10 */
#define _SPI1_RXCRCR       (SPI1 + SPI_RXCRCR_OFFSET)       /*!< SPI Rx CRC register (not used in I2S mode),          Address offset: 0x14 */
#define _SPI1_TXCRCR       (SPI1 + SPI_TXCRCR_OFFSET)       /*!< SPI Tx CRC register (not used in I2S mode),          Address offset: 0x18 */
#define _SPI1_I2SCFGR      (SPI1 + SPI_I2SCFGR_OFFSET)      /*!< SPI_I2S configuration register,                      Address offset: 0x1C */
#define _SPI1_I2SPR        (SPI1 + SPI_I2SPR_OFFSET)        /*!< SPI_I2S prescaler register,                          Address offset: 0x20 */

#define USART1              (USART1_BASE)
#define _USART1_CR1          (USART1 + USART_CR1_OFFSET)          /*!< USART Control register 1,                 Address offset: 0x00 */
#define _USART1_CR2          (USART1 + USART_CR2_OFFSET)          /*!< USART Control register 2,                 Address offset: 0x04 */
#define _USART1_CR3          (USART1 + USART_CR3_OFFSET)          /*!< USART Control register 3,                 Address offset: 0x08 */
#define _USART1_BRR          (USART1 + USART_BRR_OFFSET)          /*!< USART Baud rate register,                 Address offset: 0x0C */
#define _USART1_GTPR         (USART1 + USART_GTPR_OFFSET)         /*!< USART Guard time and prescaler register,  Address offset: 0x10 */
#define _USART1_RTOR         (USART1 + USART_RTOR_OFFSET)         /*!< USART Receiver Time Out register,         Address offset: 0x14 */
#define _USART1_RQR          (USART1 + USART_RQR_OFFSET)          /*!< USART Request register,                   Address offset: 0x18 */
#define _USART1_ISR          (USART1 + USART_ISR_OFFSET)          /*!< USART Interrupt and status register,      Address offset: 0x1C */
#define _USART1_ICR          (USART1 + USART_ICR_OFFSET)          /*!< USART Interrupt flag Clear register,      Address offset: 0x20 */
#define _USART1_RDR          (USART1 + USART_RDR_OFFSET)          /*!< USART Receive Data register,              Address offset: 0x24 */
#define _USART1_TDR          (USART1 + USART_TDR_OFFSET)          /*!< USART Transmit Data register,             Address offset: 0x28 */

