the-nw1-group/acb-modules/acb-common/include/stm32f0xx.inc
#define TIM15               (TIM15_BASE)
#define _TIM15_CR1           (TIM15 + TIM_CR1_OFFSET)           /*!< TIM control register 1,                      Address offset: 0x00 */
#define _TIM15_CR2           (TIM15 + TIM_CR2_OFFSET)           /*!< TIM control register 2,                      Address offset: 0x04 */
#define _TIM15_SMCR          (TIM15 + TIM_SMCR_OFFSET)          /*!< TIM slave Mode Control register,             Address offset: 0x08 */
#define _TIM15_DIER          (TIM15 + TIM_DIER_OFFSET)          /*!< TIM DMA/interrupt enable register,           Address offset: 0x0C */
#define _TIM15_SR            (TIM15 + TIM_SR_OFFSET)            /*!< TIM status register,                         Address offset: 0x10 */
#define _TIM15_EGR           (TIM15 + TIM_EGR_OFFSET)           /*!< TIM event generation register,               Address offset: 0x14 */
#define _TIM15_CCMR1         (TIM15 + TIM_CCMR1_OFFSET)         /*!< TIM  capture/compare mode register 1,        Address offset: 0x18 */
#define _TIM15_CCMR2         (TIM15 + TIM_CCMR2_OFFSET)         /*!< TIM  capture/compare mode register 2,        Address offset: 0x1C */
#define _TIM15_CCER          (TIM15 + TIM_CCER_OFFSET)          /*!< TIM capture/compare enable register,         Address offset: 0x20 */
#define _TIM15_CNT           (TIM15 + TIM_CNT_OFFSET)           /*!< TIM counter register,                        Address offset: 0x24 */
#define _TIM15_PSC           (TIM15 + TIM_PSC_OFFSET)           /*!< TIM prescaler register,                      Address offset: 0x28 */
#define _TIM15_ARR           (TIM15 + TIM_ARR_OFFSET)           /*!< TIM auto-reload register,                    Address offset: 0x2C */
#define _TIM15_RCR           (TIM15 + TIM_RCR_OFFSET)           /*!< TIM  repetition counter register,            Address offset: 0x30 */
#define _TIM15_CCR1          (TIM15 + TIM_CCR1_OFFSET)          /*!< TIM capture/compare register 1,              Address offset: 0x34 */
#define _TIM15_CCR2          (TIM15 + TIM_CCR2_OFFSET)          /*!< TIM capture/compare register 2,              Address offset: 0x38 */
#define _TIM15_CCR3          (TIM15 + TIM_CCR3_OFFSET)          /*!< TIM capture/compare register 3,              Address offset: 0x3C */
#define _TIM15_CCR4          (TIM15 + TIM_CCR4_OFFSET)          /*!< TIM capture/compare register 4,              Address offset: 0x40 */
#define _TIM15_BDTR          (TIM15 + TIM_BDTR_OFFSET)          /*!< TIM break and dead-time register,            Address offset: 0x44 */
#define _TIM15_DCR           (TIM15 + TIM_DCR_OFFSET)           /*!< TIM DMA control register,                    Address offset: 0x48 */
#define _TIM15_DMAR          (TIM15 + TIM_DMAR_OFFSET)          /*!< TIM DMA address for full transfer register,  Address offset: 0x4C */
#define _TIM15_OR            (TIM15 + TIM_OR_OFFSET)            /*!< TIM option register,                         Address offset: 0x50 */

#define TIM16               (TIM16_BASE)
#define _TIM16_CR1           (TIM16 + TIM_CR1_OFFSET)           /*!< TIM control register 1,                      Address offset: 0x00 */
#define _TIM16_CR2           (TIM16 + TIM_CR2_OFFSET)           /*!< TIM control register 2,                      Address offset: 0x04 */
#define _TIM16_SMCR          (TIM16 + TIM_SMCR_OFFSET)          /*!< TIM slave Mode Control register,             Address offset: 0x08 */
#define _TIM16_DIER          (TIM16 + TIM_DIER_OFFSET)          /*!< TIM DMA/interrupt enable register,           Address offset: 0x0C */
#define _TIM16_SR            (TIM16 + TIM_SR_OFFSET)            /*!< TIM status register,                         Address offset: 0x10 */
#define _TIM16_EGR           (TIM16 + TIM_EGR_OFFSET)           /*!< TIM event generation register,               Address offset: 0x14 */
#define _TIM16_CCMR1         (TIM16 + TIM_CCMR1_OFFSET)         /*!< TIM  capture/compare mode register 1,        Address offset: 0x18 */
#define _TIM16_CCMR2         (TIM16 + TIM_CCMR2_OFFSET)         /*!< TIM  capture/compare mode register 2,        Address offset: 0x1C */
#define _TIM16_CCER          (TIM16 + TIM_CCER_OFFSET)          /*!< TIM capture/compare enable register,         Address offset: 0x20 */
#define _TIM16_CNT           (TIM16 + TIM_CNT_OFFSET)           /*!< TIM counter register,                        Address offset: 0x24 */
#define _TIM16_PSC           (TIM16 + TIM_PSC_OFFSET)           /*!< TIM prescaler register,                      Address offset: 0x28 */
#define _TIM16_ARR           (TIM16 + TIM_ARR_OFFSET)           /*!< TIM auto-reload register,                    Address offset: 0x2C */
#define _TIM16_RCR           (TIM16 + TIM_RCR_OFFSET)           /*!< TIM  repetition counter register,            Address offset: 0x30 */
#define _TIM16_CCR1          (TIM16 + TIM_CCR1_OFFSET)          /*!< TIM capture/compare register 1,              Address offset: 0x34 */
#define _TIM16_CCR2          (TIM16 + TIM_CCR2_OFFSET)          /*!< TIM capture/compare register 2,              Address offset: 0x38 */
#define _TIM16_CCR3          (TIM16 + TIM_CCR3_OFFSET)          /*!< TIM capture/compare register 3,              Address offset: 0x3C */
#define _TIM16_CCR4          (TIM16 + TIM_CCR4_OFFSET)          /*!< TIM capture/compare register 4,              Address offset: 0x40 */
#define _TIM16_BDTR          (TIM16 + TIM_BDTR_OFFSET)          /*!< TIM break and dead-time register,            Address offset: 0x44 */
#define _TIM16_DCR           (TIM16 + TIM_DCR_OFFSET)           /*!< TIM DMA control register,                    Address offset: 0x48 */
#define _TIM16_DMAR          (TIM16 + TIM_DMAR_OFFSET)          /*!< TIM DMA address for full transfer register,  Address offset: 0x4C */
#define _TIM16_OR            (TIM16 + TIM_OR_OFFSET)            /*!< TIM option register,                         Address offset: 0x50 */

#define TIM17               (TIM17_BASE)
#define _TIM17_CR1           (TIM17 + TIM_CR1_OFFSET)           /*!< TIM control register 1,                      Address offset: 0x00 */
#define _TIM17_CR2           (TIM17 + TIM_CR2_OFFSET)           /*!< TIM control register 2,                      Address offset: 0x04 */
#define _TIM17_SMCR          (TIM17 + TIM_SMCR_OFFSET)          /*!< TIM slave Mode Control register,             Address offset: 0x08 */
#define _TIM17_DIER          (TIM17 + TIM_DIER_OFFSET)          /*!< TIM DMA/interrupt enable register,           Address offset: 0x0C */
#define _TIM17_SR            (TIM17 + TIM_SR_OFFSET)            /*!< TIM status register,                         Address offset: 0x10 */
#define _TIM17_EGR           (TIM17 + TIM_EGR_OFFSET)           /*!< TIM event generation register,               Address offset: 0x14 */
#define _TIM17_CCMR1         (TIM17 + TIM_CCMR1_OFFSET)         /*!< TIM  capture/compare mode register 1,        Address offset: 0x18 */
#define _TIM17_CCMR2         (TIM17 + TIM_CCMR2_OFFSET)         /*!< TIM  capture/compare mode register 2,        Address offset: 0x1C */
#define _TIM17_CCER          (TIM17 + TIM_CCER_OFFSET)          /*!< TIM capture/compare enable register,         Address offset: 0x20 */
#define _TIM17_CNT           (TIM17 + TIM_CNT_OFFSET)           /*!< TIM counter register,                        Address offset: 0x24 */
#define _TIM17_PSC           (TIM17 + TIM_PSC_OFFSET)           /*!< TIM prescaler register,                      Address offset: 0x28 */
#define _TIM17_ARR           (TIM17 + TIM_ARR_OFFSET)           /*!< TIM auto-reload register,                    Address offset: 0x2C */
#define _TIM17_RCR           (TIM17 + TIM_RCR_OFFSET)           /*!< TIM  repetition counter register,            Address offset: 0x30 */
#define _TIM17_CCR1          (TIM17 + TIM_CCR1_OFFSET)          /*!< TIM capture/compare register 1,              Address offset: 0x34 */
#define _TIM17_CCR2          (TIM17 + TIM_CCR2_OFFSET)          /*!< TIM capture/compare register 2,              Address offset: 0x38 */
#define _TIM17_CCR3          (TIM17 + TIM_CCR3_OFFSET)          /*!< TIM capture/compare register 3,              Address offset: 0x3C */
#define _TIM17_CCR4          (TIM17 + TIM_CCR4_OFFSET)          /*!< TIM capture/compare register 4,              Address offset: 0x40 */
#define _TIM17_BDTR          (TIM17 + TIM_BDTR_OFFSET)          /*!< TIM break and dead-time register,            Address offset: 0x44 */
#define _TIM17_DCR           (TIM17 + TIM_DCR_OFFSET)           /*!< TIM DMA control register,                    Address offset: 0x48 */
#define _TIM17_DMAR          (TIM17 + TIM_DMAR_OFFSET)          /*!< TIM DMA address for full transfer register,  Address offset: 0x4C */
#define _TIM17_OR            (TIM17 + TIM_OR_OFFSET)            /*!< TIM option register,                         Address offset: 0x50 */

#define DBGMCU              (DBGMCU_BASE)
#define _DBGMCU_IDCODE    (DBGMCU + DBGMCU_IDCODE_OFFSET)    /*!< MCU device ID code,                          Address offset: 0x00 */
#define _DBGMCU_CR        (DBGMCU + DBGMCU_CR_OFFSET)        /*!< Debug MCU configuration register,            Address offset: 0x04 */
#define _DBGMCU_APB1FZ    (DBGMCU + DBGMCU_APB1FZ_OFFSET)    /*!< Debug MCU APB1 freeze register,              Address offset: 0x08 */
#define _DBGMCU_APB2FZ    (DBGMCU + DBGMCU_APB2FZ_OFFSET)    /*!< Debug MCU APB2 freeze register,              Address offset: 0x0C */


#define DMA1                (DMA1_BASE)
#define _DMA1_ISR     (DMA1 + DMA_ISR_OFFSET)     /*!< DMA interrupt status register,                            Address offset: 0x00 */
#define _DMA1_IFCR    (DMA1 + DMA_IFCR_OFFSET)    /*!< DMA interrupt flag clear register,                        Address offset: 0x04 */

#define DMA1_Channel1       (DMA1_Channel1_BASE)
#define _DMA1_Channel1_CCR      (DMA1_Channel1 + DMA_Channel_CCR_OFFSET)      /*!< DMA channel x configuration register                                           */
#define _DMA1_Channel1_CNDTR    (DMA1_Channel1 + DMA_Channel_CNDTR_OFFSET)    /*!< DMA channel x number of data register                                          */
#define _DMA1_Channel1_CPAR     (DMA1_Channel1 + DMA_Channel_CPAR_OFFSET)     /*!< DMA channel x peripheral address register                                      */
#define _DMA1_Channel1_CMAR     (DMA1_Channel1 + DMA_Channel_CMAR_OFFSET)     /*!< DMA channel x memory address register                                          */

#define DMA1_Channel2       (DMA1_Channel2_BASE)
#define _DMA1_Channel2_CCR      (DMA1_Channel2 + DMA_Channel_CCR_OFFSET)      /*!< DMA channel x configuration register                                           */
#define _DMA1_Channel2_CNDTR    (DMA1_Channel2 + DMA_Channel_CNDTR_OFFSET)    /*!< DMA channel x number of data register                                          */
#define _DMA1_Channel2_CPAR     (DMA1_Channel2 + DMA_Channel_CPAR_OFFSET)     /*!< DMA channel x peripheral address register                                      */
#define _DMA1_Channel2_CMAR     (DMA1_Channel2 + DMA_Channel_CMAR_OFFSET)     /*!< DMA channel x memory address register                                          */

