the-nw1-group/acb-modules/acb-common/include/stm32f0xx.inc
#define ADC_ISR_AWD                          (0x00000080)        /*!< Analog watchdog flag */
#define ADC_ISR_OVR                          (0x00000010)        /*!< Overrun flag */
#define ADC_ISR_EOSEQ                        (0x00000008)        /*!< End of Sequence flag */
#define ADC_ISR_EOC                          (0x00000004)        /*!< End of Conversion */
#define ADC_ISR_EOSMP                        (0x00000002)        /*!< End of sampling flag */
#define ADC_ISR_ADRDY                        (0x00000001)        /*!< ADC Ready */

#define ADC_ISR_EOS                          ADC_ISR_EOSEQ

#define ADC_IER_AWDIE                        (0x00000080)        /*!< Analog Watchdog interrupt enable */
#define ADC_IER_OVRIE                        (0x00000010)        /*!< Overrun interrupt enable */
#define ADC_IER_EOSEQIE                      (0x00000008)        /*!< End of Sequence of conversion interrupt enable */
#define ADC_IER_EOCIE                        (0x00000004)        /*!< End of Conversion interrupt enable */
#define ADC_IER_EOSMPIE                      (0x00000002)        /*!< End of sampling interrupt enable */
#define ADC_IER_ADRDYIE                      (0x00000001)        /*!< ADC Ready interrupt enable */

#define ADC_IER_EOSIE                        ADC_IER_EOSEQIE

#define ADC_CR_ADCAL                         (0x80000000)        /*!< ADC calibration */
#define ADC_CR_ADSTP                         (0x00000010)        /*!< ADC stop of conversion command */
#define ADC_CR_ADSTART                       (0x00000004)        /*!< ADC start of conversion */
#define ADC_CR_ADDIS                         (0x00000002)        /*!< ADC disable command */
#define ADC_CR_ADEN                          (0x00000001)        /*!< ADC enable control */

#define  ADC_CFGR1_AWDCH                      (0x7C000000)       /*!< AWDCH[4:0] bits (Analog watchdog channel select bits) */
#define  ADC_CFGR1_AWDCH_0                    (0x04000000)       /*!< Bit 0 */
#define  ADC_CFGR1_AWDCH_1                    (0x08000000)       /*!< Bit 1 */
#define  ADC_CFGR1_AWDCH_2                    (0x10000000)       /*!< Bit 2 */
#define  ADC_CFGR1_AWDCH_3                    (0x20000000)       /*!< Bit 3 */
#define  ADC_CFGR1_AWDCH_4                    (0x40000000)       /*!< Bit 4 */
#define  ADC_CFGR1_AWDEN                      (0x00800000)       /*!< Analog watchdog enable on regular channels */
#define  ADC_CFGR1_AWDSGL                     (0x00400000)       /*!< Enable the watchdog on a single channel or on all channels  */
#define  ADC_CFGR1_DISCEN                     (0x00010000)       /*!< Discontinuous mode on regular channels */
#define  ADC_CFGR1_AUTOFF                     (0x00008000)       /*!< ADC auto power off */
#define  ADC_CFGR1_WAIT                       (0x00004000)       /*!< ADC wait conversion mode */
#define  ADC_CFGR1_CONT                       (0x00002000)       /*!< Continuous Conversion */
#define  ADC_CFGR1_OVRMOD                     (0x00001000)       /*!< Overrun mode */
#define  ADC_CFGR1_EXTEN                      (0x00000C00)       /*!< EXTEN[1:0] bits (External Trigger Conversion mode for regular channels) */
#define  ADC_CFGR1_EXTEN_0                    (0x00000400)       /*!< Bit 0 */
#define  ADC_CFGR1_EXTEN_1                    (0x00000800)       /*!< Bit 1 */
#define  ADC_CFGR1_EXTSEL                     (0x000001C0)       /*!< EXTSEL[2:0] bits (External Event Select for regular group) */
#define  ADC_CFGR1_EXTSEL_0                   (0x00000040)       /*!< Bit 0 */
#define  ADC_CFGR1_EXTSEL_1                   (0x00000080)       /*!< Bit 1 */
#define  ADC_CFGR1_EXTSEL_2                   (0x00000100)       /*!< Bit 2 */
#define  ADC_CFGR1_ALIGN                      (0x00000020)       /*!< Data Alignment */
#define  ADC_CFGR1_RES                        (0x00000018)       /*!< RES[1:0] bits (Resolution) */
#define  ADC_CFGR1_RES_0                      (0x00000008)       /*!< Bit 0 */
#define  ADC_CFGR1_RES_1                      (0x00000010)       /*!< Bit 1 */
#define  ADC_CFGR1_SCANDIR                    (0x00000004)       /*!< Sequence scan direction */
#define  ADC_CFGR1_DMACFG                     (0x00000002)       /*!< Direct memory access configuration */
#define  ADC_CFGR1_DMAEN                      (0x00000001)       /*!< Direct memory access enable */

#define  ADC_CFGR1_AUTDLY                     ADC_CFGR1_WAIT

#define  ADC_CFGR2_CKMODE                     (0xC0000000)       /*!< ADC clock mode */
#define  ADC_CFGR2_CKMODE_1                   (0x80000000)       /*!< ADC clocked by PCLK div4 */
#define  ADC_CFGR2_CKMODE_0                   (0x40000000)       /*!< ADC clocked by PCLK div2 */

#define  ADC_CFGR2_JITOFFDIV4                 ADC_CFGR2_CKMODE_1           /*!< ADC clocked by PCLK div4 */
#define  ADC_CFGR2_JITOFFDIV2                 ADC_CFGR2_CKMODE_0           /*!< ADC clocked by PCLK div2 */

#define  ADC_SMPR_SMP                      (0x00000007)        /*!< SMP[2:0] bits (Sampling time selection) */
#define  ADC_SMPR_SMP_0                    (0x00000001)        /*!< Bit 0 */
#define  ADC_SMPR_SMP_1                    (0x00000002)        /*!< Bit 1 */
#define  ADC_SMPR_SMP_2                    (0x00000004)        /*!< Bit 2 */

#define  ADC_SMPR1_SMPR                      ADC_SMPR_SMP        /*!< SMP[2:0] bits (Sampling time selection) */
#define  ADC_SMPR1_SMPR_0                    ADC_SMPR_SMP_0        /*!< Bit 0 */
#define  ADC_SMPR1_SMPR_1                    ADC_SMPR_SMP_1        /*!< Bit 1 */
#define  ADC_SMPR1_SMPR_2                    ADC_SMPR_SMP_2        /*!< Bit 2 */

#define  ADC_TR_HT                          (0x0FFF0000)        /*!< Analog watchdog high threshold */
#define  ADC_TR_LT                          (0x00000FFF)        /*!< Analog watchdog low threshold */

#define  ADC_HTR_HT                          ADC_TR_HT                    /*!< Analog watchdog high threshold */
#define  ADC_LTR_LT                          ADC_TR_LT                    /*!< Analog watchdog low threshold */

#define  ADC_CHSELR_CHSEL18                   (0x00040000)        /*!< Channel 18 selection */
#define  ADC_CHSELR_CHSEL17                   (0x00020000)        /*!< Channel 17 selection */
#define  ADC_CHSELR_CHSEL16                   (0x00010000)        /*!< Channel 16 selection */
#define  ADC_CHSELR_CHSEL15                   (0x00008000)        /*!< Channel 15 selection */
#define  ADC_CHSELR_CHSEL14                   (0x00004000)        /*!< Channel 14 selection */
#define  ADC_CHSELR_CHSEL13                   (0x00002000)        /*!< Channel 13 selection */
#define  ADC_CHSELR_CHSEL12                   (0x00001000)        /*!< Channel 12 selection */
#define  ADC_CHSELR_CHSEL11                   (0x00000800)        /*!< Channel 11 selection */
#define  ADC_CHSELR_CHSEL10                   (0x00000400)        /*!< Channel 10 selection */
#define  ADC_CHSELR_CHSEL9                    (0x00000200)        /*!< Channel 9 selection */
#define  ADC_CHSELR_CHSEL8                    (0x00000100)        /*!< Channel 8 selection */
#define  ADC_CHSELR_CHSEL7                    (0x00000080)        /*!< Channel 7 selection */
#define  ADC_CHSELR_CHSEL6                    (0x00000040)        /*!< Channel 6 selection */
#define  ADC_CHSELR_CHSEL5                    (0x00000020)        /*!< Channel 5 selection */
#define  ADC_CHSELR_CHSEL4                    (0x00000010)        /*!< Channel 4 selection */
#define  ADC_CHSELR_CHSEL3                    (0x00000008)        /*!< Channel 3 selection */
#define  ADC_CHSELR_CHSEL2                    (0x00000004)        /*!< Channel 2 selection */
#define  ADC_CHSELR_CHSEL1                    (0x00000002)        /*!< Channel 1 selection */
#define  ADC_CHSELR_CHSEL0                    (0x00000001)        /*!< Channel 0 selection */

#define  ADC_DR_DATA                         (0x0000FFFF)        /*!< Regular data */

#define  ADC_CCR_VBATEN                       (0x01000000)       /*!< Voltage battery enable */
#define  ADC_CCR_TSEN                         (0x00800000)       /*!< Tempurature sensore enable */
#define  ADC_CCR_VREFEN                       (0x00400000)       /*!< Vrefint enable */

#define  CAN_MCR_INRQ                        (0x0001)            /*!<Initialization Request */
#define  CAN_MCR_SLEEP                       (0x0002)            /*!<Sleep Mode Request */
#define  CAN_MCR_TXFP                        (0x0004)            /*!<Transmit FIFO Priority */
#define  CAN_MCR_RFLM                        (0x0008)            /*!<Receive FIFO Locked Mode */
#define  CAN_MCR_NART                        (0x0010)            /*!<No Automatic Retransmission */
#define  CAN_MCR_AWUM                        (0x0020)            /*!<Automatic Wakeup Mode */
#define  CAN_MCR_ABOM                        (0x0040)            /*!<Automatic Bus-Off Management */
#define  CAN_MCR_TTCM                        (0x0080)            /*!<Time Triggered Communication Mode */
#define  CAN_MCR_RESET                       (0x8000)            /*!<bxCAN software master reset */

#define  CAN_MSR_INAK                        (0x0001)            /*!<Initialization Acknowledge */
#define  CAN_MSR_SLAK                        (0x0002)            /*!<Sleep Acknowledge */
#define  CAN_MSR_ERRI                        (0x0004)            /*!<Error Interrupt */
#define  CAN_MSR_WKUI                        (0x0008)            /*!<Wakeup Interrupt */
#define  CAN_MSR_SLAKI                       (0x0010)            /*!<Sleep Acknowledge Interrupt */
#define  CAN_MSR_TXM                         (0x0100)            /*!<Transmit Mode */
#define  CAN_MSR_RXM                         (0x0200)            /*!<Receive Mode */
#define  CAN_MSR_SAMP                        (0x0400)            /*!<Last Sample Point */
#define  CAN_MSR_RX                          (0x0800)            /*!<CAN Rx Signal */

#define  CAN_TSR_RQCP0                       (0x00000001)        /*!<Request Completed Mailbox0 */
#define  CAN_TSR_TXOK0                       (0x00000002)        /*!<Transmission OK of Mailbox0 */
#define  CAN_TSR_ALST0                       (0x00000004)        /*!<Arbitration Lost for Mailbox0 */
#define  CAN_TSR_TERR0                       (0x00000008)        /*!<Transmission Error of Mailbox0 */
#define  CAN_TSR_ABRQ0                       (0x00000080)        /*!<Abort Request for Mailbox0 */
#define  CAN_TSR_RQCP1                       (0x00000100)        /*!<Request Completed Mailbox1 */
#define  CAN_TSR_TXOK1                       (0x00000200)        /*!<Transmission OK of Mailbox1 */
#define  CAN_TSR_ALST1                       (0x00000400)        /*!<Arbitration Lost for Mailbox1 */
#define  CAN_TSR_TERR1                       (0x00000800)        /*!<Transmission Error of Mailbox1 */
#define  CAN_TSR_ABRQ1                       (0x00008000)        /*!<Abort Request for Mailbox 1 */
#define  CAN_TSR_RQCP2                       (0x00010000)        /*!<Request Completed Mailbox2 */
#define  CAN_TSR_TXOK2                       (0x00020000)        /*!<Transmission OK of Mailbox 2 */
#define  CAN_TSR_ALST2                       (0x00040000)        /*!<Arbitration Lost for mailbox 2 */
#define  CAN_TSR_TERR2                       (0x00080000)        /*!<Transmission Error of Mailbox 2 */
#define  CAN_TSR_ABRQ2                       (0x00800000)        /*!<Abort Request for Mailbox 2 */
#define  CAN_TSR_CODE                        (0x03000000)        /*!<Mailbox Code */

#define  CAN_TSR_TME                         (0x1C000000)        /*!<TME[2:0] bits */
#define  CAN_TSR_TME0                        (0x04000000)        /*!<Transmit Mailbox 0 Empty */
#define  CAN_TSR_TME1                        (0x08000000)        /*!<Transmit Mailbox 1 Empty */
#define  CAN_TSR_TME2                        (0x10000000)        /*!<Transmit Mailbox 2 Empty */

