the-nw1-group/acb-modules/acb-common/include/stm32f0xx.inc
#define  CEC_CR_CECEN                        (0x00000001)       /*!< CEC Enable                         */
#define  CEC_CR_TXSOM                        (0x00000002)       /*!< CEC Tx Start Of Message            */
#define  CEC_CR_TXEOM                        (0x00000004)       /*!< CEC Tx End Of Message              */

#define  CEC_CFGR_SFT                        (0x00000007)       /*!< CEC Signal Free Time               */
#define  CEC_CFGR_RXTOL                      (0x00000008)       /*!< CEC Tolerance                      */
#define  CEC_CFGR_BRESTP                     (0x00000010)       /*!< CEC Rx Stop                        */
#define  CEC_CFGR_BREGEN                     (0x00000020)       /*!< CEC Bit Rising Error generation    */
#define  CEC_CFGR_LREGEN                     (0x00000040)       /*!< CEC Long Period Error generation   */
#define  CEC_CFGR_BRDNOGEN                   (0x00000080)       /*!< CEC Broadcast no Error generation  */
#define  CEC_CFGR_SFTOPT                     (0x00000100)       /*!< CEC Signal Free Time optional      */
#define  CEC_CFGR_OAR                        (0x7FFF0000)       /*!< CEC Own Address                    */
#define  CEC_CFGR_LSTN                       (0x80000000)       /*!< CEC Listen mode                    */

#define  CEC_TXDR_TXD                        (0x000000FF)       /*!< CEC Tx Data                        */

#define  CEC_TXDR_RXD                        (0x000000FF)       /*!< CEC Rx Data                        */

#define  CEC_ISR_RXBR                        (0x00000001)       /*!< CEC Rx-Byte Received                   */
#define  CEC_ISR_RXEND                       (0x00000002)       /*!< CEC End Of Reception                   */
#define  CEC_ISR_RXOVR                       (0x00000004)       /*!< CEC Rx-Overrun                         */
#define  CEC_ISR_BRE                         (0x00000008)       /*!< CEC Rx Bit Rising Error                */
#define  CEC_ISR_SBPE                        (0x00000010)       /*!< CEC Rx Short Bit period Error          */
#define  CEC_ISR_LBPE                        (0x00000020)       /*!< CEC Rx Long Bit period Error           */
#define  CEC_ISR_RXACKE                      (0x00000040)       /*!< CEC Rx Missing Acknowledge             */
#define  CEC_ISR_ARBLST                      (0x00000080)       /*!< CEC Arbitration Lost                   */
#define  CEC_ISR_TXBR                        (0x00000100)       /*!< CEC Tx Byte Request                    */
#define  CEC_ISR_TXEND                       (0x00000200)       /*!< CEC End of Transmission                */
#define  CEC_ISR_TXUDR                       (0x00000400)       /*!< CEC Tx-Buffer Underrun                 */
#define  CEC_ISR_TXERR                       (0x00000800)       /*!< CEC Tx-Error                           */
#define  CEC_ISR_TXACKE                      (0x00001000)       /*!< CEC Tx Missing Acknowledge             */

#define  CEC_IER_RXBRIE                      (0x00000001)       /*!< CEC Rx-Byte Received IT Enable         */
#define  CEC_IER_RXENDIE                     (0x00000002)       /*!< CEC End Of Reception IT Enable         */
#define  CEC_IER_RXOVRIE                     (0x00000004)       /*!< CEC Rx-Overrun IT Enable               */
#define  CEC_IER_BREIEIE                     (0x00000008)       /*!< CEC Rx Bit Rising Error IT Enable      */
#define  CEC_IER_SBPEIE                      (0x00000010)       /*!< CEC Rx Short Bit period Error IT Enable*/
#define  CEC_IER_LBPEIE                      (0x00000020)       /*!< CEC Rx Long Bit period Error IT Enable */
#define  CEC_IER_RXACKEIE                    (0x00000040)       /*!< CEC Rx Missing Acknowledge IT Enable   */
#define  CEC_IER_ARBLSTIE                    (0x00000080)       /*!< CEC Arbitration Lost IT Enable         */
#define  CEC_IER_TXBRIE                      (0x00000100)       /*!< CEC Tx Byte Request  IT Enable         */
#define  CEC_IER_TXENDIE                     (0x00000200)       /*!< CEC End of Transmission IT Enable      */
#define  CEC_IER_TXUDRIE                     (0x00000400)       /*!< CEC Tx-Buffer Underrun IT Enable       */
#define  CEC_IER_TXERRIE                     (0x00000800)       /*!< CEC Tx-Error IT Enable                 */
#define  CEC_IER_TXACKEIE                    (0x00001000)       /*!< CEC Tx Missing Acknowledge IT Enable   */

#define COMP_CSR_COMP1EN               (0x00000001) /*!< COMP1 enable */
#define COMP_CSR_COMP1SW1              (0x00000002) /*!< SW1 switch control */
#define COMP_CSR_COMP1MODE             (0x0000000C) /*!< COMP1 power mode */
#define COMP_CSR_COMP1MODE_0           (0x00000004) /*!< COMP1 power mode bit 0 */
#define COMP_CSR_COMP1MODE_1           (0x00000008) /*!< COMP1 power mode bit 1 */
#define COMP_CSR_COMP1INSEL            (0x00000070) /*!< COMP1 inverting input select */
#define COMP_CSR_COMP1INSEL_0          (0x00000010) /*!< COMP1 inverting input select bit 0 */
#define COMP_CSR_COMP1INSEL_1          (0x00000020) /*!< COMP1 inverting input select bit 1 */
#define COMP_CSR_COMP1INSEL_2          (0x00000040) /*!< COMP1 inverting input select bit 2 */
#define COMP_CSR_COMP1OUTSEL           (0x00000700) /*!< COMP1 output select */
#define COMP_CSR_COMP1OUTSEL_0         (0x00000100) /*!< COMP1 output select bit 0 */
#define COMP_CSR_COMP1OUTSEL_1         (0x00000200) /*!< COMP1 output select bit 1 */
#define COMP_CSR_COMP1OUTSEL_2         (0x00000400) /*!< COMP1 output select bit 2 */
#define COMP_CSR_COMP1POL              (0x00000800) /*!< COMP1 output polarity */
#define COMP_CSR_COMP1HYST             (0x00003000) /*!< COMP1 hysteresis */
#define COMP_CSR_COMP1HYST_0           (0x00001000) /*!< COMP1 hysteresis bit 0 */
#define COMP_CSR_COMP1HYST_1           (0x00002000) /*!< COMP1 hysteresis bit 1 */
#define COMP_CSR_COMP1OUT              (0x00004000) /*!< COMP1 output level */
#define COMP_CSR_COMP1LOCK             (0x00008000) /*!< COMP1 lock */
#define COMP_CSR_COMP2EN               (0x00010000) /*!< COMP2 enable */
#define COMP_CSR_COMP2MODE             (0x000C0000) /*!< COMP2 power mode */
#define COMP_CSR_COMP2MODE_0           (0x00040000) /*!< COMP2 power mode bit 0 */
#define COMP_CSR_COMP2MODE_1           (0x00080000) /*!< COMP2 power mode bit 1 */
#define COMP_CSR_COMP2INSEL            (0x00700000) /*!< COMP2 inverting input select */
#define COMP_CSR_COMP2INSEL_0          (0x00100000) /*!< COMP2 inverting input select bit 0 */
#define COMP_CSR_COMP2INSEL_1          (0x00200000) /*!< COMP2 inverting input select bit 1 */
#define COMP_CSR_COMP2INSEL_2          (0x00400000) /*!< COMP2 inverting input select bit 2 */
#define COMP_CSR_WNDWEN                (0x00800000) /*!< Comparators window mode enable */
#define COMP_CSR_COMP2OUTSEL           (0x07000000) /*!< COMP2 output select */
#define COMP_CSR_COMP2OUTSEL_0         (0x01000000) /*!< COMP2 output select bit 0 */
#define COMP_CSR_COMP2OUTSEL_1         (0x02000000) /*!< COMP2 output select bit 1 */
#define COMP_CSR_COMP2OUTSEL_2         (0x04000000) /*!< COMP2 output select bit 2 */
#define COMP_CSR_COMP2POL              (0x08000000) /*!< COMP2 output polarity */
#define COMP_CSR_COMP2HYST             (0x30000000) /*!< COMP2 hysteresis */
#define COMP_CSR_COMP2HYST_0           (0x10000000) /*!< COMP2 hysteresis bit 0 */
#define COMP_CSR_COMP2HYST_1           (0x20000000) /*!< COMP2 hysteresis bit 1 */
#define COMP_CSR_COMP2OUT              (0x40000000) /*!< COMP2 output level */
#define COMP_CSR_COMP2LOCK             (0x80000000) /*!< COMP2 lock */

#define  CRC_DR_DR                           (0xFFFFFFFF) /*!< Data register bits */

