the-nw1-group/acb-modules/acb-common/include/stm32f0xx.inc
#define  CRC_IDR_IDR                         (0xFF)        /*!< General-purpose 8-bit data register bits */

#define  CRC_CR_RESET                        (0x00000001) /*!< RESET the CRC computation unit bit */
#define  CRC_CR_POLSIZE                      (0x00000018) /*!< Polynomial size bits (only for STM32F072 devices)*/
#define  CRC_CR_POLSIZE_0                    (0x00000008) /*!< Polynomial size bit 0 (only for STM32F072 devices) */
#define  CRC_CR_POLSIZE_1                    (0x00000010) /*!< Polynomial size bit 1 (only for STM32F072 devices) */
#define  CRC_CR_REV_IN                       (0x00000060) /*!< REV_IN Reverse Input Data bits */
#define  CRC_CR_REV_IN_0                     (0x00000020) /*!< REV_IN Bit 0 */
#define  CRC_CR_REV_IN_1                     (0x00000040) /*!< REV_IN Bit 1 */
#define  CRC_CR_REV_OUT                      (0x00000080) /*!< REV_OUT Reverse Output Data bits */

#define  CRC_INIT_INIT                       (0xFFFFFFFF) /*!< Initial CRC value bits */

#define  CRC_POL_POL                         (0xFFFFFFFF) /*!< Coefficients of the polynomial (only for STM32F072 devices) */


#define  CRS_CR_SYNCOKIE                     (0x00000001) /* SYNC event OK interrupt enable        */
#define  CRS_CR_SYNCWARNIE                   (0x00000002) /* SYNC warning interrupt enable         */
#define  CRS_CR_ERRIE                        (0x00000004) /* SYNC error interrupt enable           */
#define  CRS_CR_ESYNCIE                      (0x00000008) /* Expected SYNC(ESYNCF) interrupt Enable*/
#define  CRS_CR_CEN                          (0x00000020) /* Frequency error counter enable        */
#define  CRS_CR_AUTOTRIMEN                   (0x00000040) /* Automatic trimming enable             */
#define  CRS_CR_SWSYNC                       (0x00000080) /* A Software SYNC event is generated    */
#define  CRS_CR_TRIM                         (0x00003F00) /* HSI48 oscillator smooth trimming      */

#define  CRS_CFGR_RELOAD                     (0x0000FFFF) /* Counter reload value               */
#define  CRS_CFGR_FELIM                      (0x00FF0000) /* Frequency error limit              */
#define  CRS_CFGR_SYNCDIV                    (0x07000000) /* SYNC divider                       */
#define  CRS_CFGR_SYNCDIV_0                  (0x01000000) /* Bit 0                              */
#define  CRS_CFGR_SYNCDIV_1                  (0x02000000) /* Bit 1                              */
#define  CRS_CFGR_SYNCDIV_2                  (0x04000000) /* Bit 2                              */
#define  CRS_CFGR_SYNCSRC                    (0x30000000) /* SYNC signal source selection       */
#define  CRS_CFGR_SYNCSRC_0                  (0x10000000) /* Bit 0                              */
#define  CRS_CFGR_SYNCSRC_1                  (0x20000000) /* Bit 1                              */
#define  CRS_CFGR_SYNCPOL                    (0x80000000) /* SYNC polarity selection            */

#define  CRS_ISR_SYNCOKF                     (0x00000001) /* SYNC event OK flag             */
#define  CRS_ISR_SYNCWARNF                   (0x00000002) /* SYNC warning                   */
#define  CRS_ISR_ERRF                        (0x00000004) /* SYNC error flag                */
#define  CRS_ISR_ESYNCF                      (0x00000008) /* Expected SYNC flag             */
#define  CRS_ISR_SYNCERR                     (0x00000100) /* SYNC error                     */
#define  CRS_ISR_SYNCMISS                    (0x00000200) /* SYNC missed                    */
#define  CRS_ISR_TRIMOVF                     (0x00000400) /* Trimming overflow or underflow */
#define  CRS_ISR_FEDIR                       (0x00008000) /* Frequency error direction      */
#define  CRS_ISR_FECAP                       (0xFFFF0000) /* Frequency error capture        */

#define  CRS_ICR_SYNCOKC                     (0x00000001) /* SYNC event OK clear flag     */
#define  CRS_ICR_SYNCWARNC                   (0x00000002) /* SYNC warning clear flag      */
#define  CRS_ICR_ERRC                        (0x00000004) /* Error clear flag        */
#define  CRS_ICR_ESYNCC                      (0x00000008) /* Expected SYNC clear flag     */

#define  DAC_CR_EN1                          (0x00000001)        /*!< DAC channel1 enable */
#define  DAC_CR_BOFF1                        (0x00000002)        /*!< DAC channel1 output buffer disable */
#define  DAC_CR_TEN1                         (0x00000004)        /*!< DAC channel1 Trigger enable */

#define  DAC_CR_TSEL1                        (0x00000038)        /*!< TSEL1[2:0] (DAC channel1 Trigger selection) */
#define  DAC_CR_TSEL1_0                      (0x00000008)        /*!< Bit 0 */
#define  DAC_CR_TSEL1_1                      (0x00000010)        /*!< Bit 1 */
#define  DAC_CR_TSEL1_2                      (0x00000020)        /*!< Bit 2 */

#define  DAC_CR_WAVE1                        (0x000000C0)        /*!< WAVE1[1:0] (DAC channel1 noise/triangle wave generation enable)(only for STM32F072 devices) */
#define  DAC_CR_WAVE1_0                      (0x00000040)        /*!< Bit 0 */
#define  DAC_CR_WAVE1_1                      (0x00000080)        /*!< Bit 1 */

#define  DAC_CR_MAMP1                        (0x00000F00)        /*!< MAMP1[3:0] (DAC channel1 Mask/Amplitude selector) (only for STM32F072 devices) */
#define  DAC_CR_MAMP1_0                      (0x00000100)        /*!< Bit 0 */
#define  DAC_CR_MAMP1_1                      (0x00000200)        /*!< Bit 1 */
#define  DAC_CR_MAMP1_2                      (0x00000400)        /*!< Bit 2 */
#define  DAC_CR_MAMP1_3                      (0x00000800)        /*!< Bit 3 */

#define  DAC_CR_DMAEN1                       (0x00001000)        /*!< DAC channel1 DMA enable */
#define  DAC_CR_DMAUDRIE1                    (0x00002000)        /*!<DAC channel1 DMA Underrun Interrupt enable */
#define  DAC_CR_EN2                          (0x00010000)        /*!< DAC channel2 enable */
#define  DAC_CR_BOFF2                        (0x00020000)        /*!< DAC channel2 output buffer disable */
#define  DAC_CR_TEN2                         (0x00040000)        /*!< DAC channel2 Trigger enable */

#define  DAC_CR_TSEL2                        (0x00380000)        /*!< TSEL2[2:0] (DAC channel2 Trigger selection) */
#define  DAC_CR_TSEL2_0                      (0x00080000)        /*!< Bit 0 */
#define  DAC_CR_TSEL2_1                      (0x00100000)        /*!< Bit 1 */
#define  DAC_CR_TSEL2_2                      (0x00200000)        /*!< Bit 2 */

