the-nw1-group/acb-modules/acb-common/include/stm32f0xx.inc
#define  DAC_CR_WAVE2                        (0x00C00000)        /*!< WAVE2[1:0] (DAC channel2 noise/triangle wave generation enable) */
#define  DAC_CR_WAVE2_0                      (0x00400000)        /*!< Bit 0 */
#define  DAC_CR_WAVE2_1                      (0x00800000)        /*!< Bit 1 */

#define  DAC_CR_MAMP2                        (0x0F000000)        /*!< MAMP2[3:0] (DAC channel2 Mask/Amplitude selector) */
#define  DAC_CR_MAMP2_0                      (0x01000000)        /*!< Bit 0 */
#define  DAC_CR_MAMP2_1                      (0x02000000)        /*!< Bit 1 */
#define  DAC_CR_MAMP2_2                      (0x04000000)        /*!< Bit 2 */
#define  DAC_CR_MAMP2_3                      (0x08000000)        /*!< Bit 3 */

#define  DAC_CR_DMAEN2                       (0x10000000)        /*!< DAC channel2 DMA enabled */
#define  DAC_CR_DMAUDRIE2                    (0x20000000)        /*!<DAC channel2 DMA Underrun Interrupt enable */

#define  DAC_SWTRIGR_SWTRIG1                 (0x00000001)        /*!<DAC channel1 software trigger */
#define  DAC_SWTRIGR_SWTRIG2                 (0x00000002)        /*!<DAC channel2 software trigger */

#define  DAC_DHR12R1_DACC1DHR                (0x00000FFF)        /*!<DAC channel1 12-bit Right aligned data */

#define  DAC_DHR12L1_DACC1DHR                (0x0000FFF0)        /*!<DAC channel1 12-bit Left aligned data */

#define  DAC_DHR8R1_DACC1DHR                 (0x000000FF)         /*!<DAC channel1 8-bit Right aligned data */

#define  DAC_DOR1_DACC1DOR                   (0x00000FFF)        /*!<DAC channel1 data output */

#define  DAC_SR_DMAUDR1                      (0x00002000)        /*!< DAC channel1 DMA underrun flag */
#define  DAC_SR_DMAUDR2                      (0x20000000)        /*!< DAC channel2 DMA underrun flag (only for STM32F072 and STM32F042 devices) */


#define  DBGMCU_IDCODE_DEV_ID                (0x00000FFF)        /*!< Device Identifier */

#define  DBGMCU_IDCODE_REV_ID                (0xFFFF0000)        /*!< REV_ID[15:0] bits (Revision Identifier) */
#define  DBGMCU_IDCODE_REV_ID_0              (0x00010000)        /*!< Bit 0 */
#define  DBGMCU_IDCODE_REV_ID_1              (0x00020000)        /*!< Bit 1 */
#define  DBGMCU_IDCODE_REV_ID_2              (0x00040000)        /*!< Bit 2 */
#define  DBGMCU_IDCODE_REV_ID_3              (0x00080000)        /*!< Bit 3 */
#define  DBGMCU_IDCODE_REV_ID_4              (0x00100000)        /*!< Bit 4 */
#define  DBGMCU_IDCODE_REV_ID_5              (0x00200000)        /*!< Bit 5 */
#define  DBGMCU_IDCODE_REV_ID_6              (0x00400000)        /*!< Bit 6 */
#define  DBGMCU_IDCODE_REV_ID_7              (0x00800000)        /*!< Bit 7 */
#define  DBGMCU_IDCODE_REV_ID_8              (0x01000000)        /*!< Bit 8 */
#define  DBGMCU_IDCODE_REV_ID_9              (0x02000000)        /*!< Bit 9 */
#define  DBGMCU_IDCODE_REV_ID_10             (0x04000000)        /*!< Bit 10 */
#define  DBGMCU_IDCODE_REV_ID_11             (0x08000000)        /*!< Bit 11 */
#define  DBGMCU_IDCODE_REV_ID_12             (0x10000000)        /*!< Bit 12 */
#define  DBGMCU_IDCODE_REV_ID_13             (0x20000000)        /*!< Bit 13 */
#define  DBGMCU_IDCODE_REV_ID_14             (0x40000000)        /*!< Bit 14 */
#define  DBGMCU_IDCODE_REV_ID_15             (0x80000000)        /*!< Bit 15 */

#define  DBGMCU_CR_DBG_STOP                  (0x00000002)        /*!< Debug Stop Mode */
#define  DBGMCU_CR_DBG_STANDBY               (0x00000004)        /*!< Debug Standby mode */

#define  DBGMCU_APB1_FZ_DBG_TIM2_STOP        (0x00000001)        /*!< TIM2 counter stopped when core is halted */
#define  DBGMCU_APB1_FZ_DBG_TIM3_STOP        (0x00000002)        /*!< TIM3 counter stopped when core is halted */
#define  DBGMCU_APB1_FZ_DBG_TIM6_STOP        (0x00000010)        /*!< TIM6 counter stopped when core is halted (not available on STM32F042 devices)*/
#define  DBGMCU_APB1_FZ_DBG_TIM7_STOP        (0x00000020)        /*!< TIM7 counter stopped when core is halted (only for STM32F072 devices) */
#define  DBGMCU_APB1_FZ_DBG_TIM14_STOP       (0x00000100)        /*!< TIM14 counter stopped when core is halted */
#define  DBGMCU_APB1_FZ_DBG_RTC_STOP         (0x00000400)        /*!< RTC Calendar frozen when core is halted */
#define  DBGMCU_APB1_FZ_DBG_WWDG_STOP        (0x00000800)        /*!< Debug Window Watchdog stopped when Core is halted */
#define  DBGMCU_APB1_FZ_DBG_IWDG_STOP        (0x00001000)        /*!< Debug Independent Watchdog stopped when Core is halted */
#define  DBGMCU_APB1_FZ_DBG_I2C1_SMBUS_TIMEOUT    (0x00200000)   /*!< I2C1 SMBUS timeout mode stopped when Core is halted */
#define  DBGMCU_APB1_FZ_DBG_CAN_STOP         (0x02000000)        /*!< CAN debug stopped when Core is halted (only for STM32F072 devices) */

#define  DBGMCU_APB2_FZ_DBG_TIM1_STOP        (0x00000800)        /*!< TIM1 counter stopped when core is halted */
#define  DBGMCU_APB2_FZ_DBG_TIM15_STOP       (0x00010000)        /*!< TIM15 counter stopped when core is halted (not available on STM32F042 devices) */
#define  DBGMCU_APB2_FZ_DBG_TIM16_STOP       (0x00020000)        /*!< TIM16 counter stopped when core is halted */
#define  DBGMCU_APB2_FZ_DBG_TIM17_STOP       (0x00040000)        /*!< TIM17 counter stopped when core is halted */


#define  DMA_ISR_GIF1                        (0x00000001)        /*!< Channel 1 Global interrupt flag    */
#define  DMA_ISR_TCIF1                       (0x00000002)        /*!< Channel 1 Transfer Complete flag   */
#define  DMA_ISR_HTIF1                       (0x00000004)        /*!< Channel 1 Half Transfer flag       */
#define  DMA_ISR_TEIF1                       (0x00000008)        /*!< Channel 1 Transfer Error flag      */
#define  DMA_ISR_GIF2                        (0x00000010)        /*!< Channel 2 Global interrupt flag    */
#define  DMA_ISR_TCIF2                       (0x00000020)        /*!< Channel 2 Transfer Complete flag   */
#define  DMA_ISR_HTIF2                       (0x00000040)        /*!< Channel 2 Half Transfer flag       */
#define  DMA_ISR_TEIF2                       (0x00000080)        /*!< Channel 2 Transfer Error flag      */
#define  DMA_ISR_GIF3                        (0x00000100)        /*!< Channel 3 Global interrupt flag    */
#define  DMA_ISR_TCIF3                       (0x00000200)        /*!< Channel 3 Transfer Complete flag   */
#define  DMA_ISR_HTIF3                       (0x00000400)        /*!< Channel 3 Half Transfer flag       */
#define  DMA_ISR_TEIF3                       (0x00000800)        /*!< Channel 3 Transfer Error flag      */
#define  DMA_ISR_GIF4                        (0x00001000)        /*!< Channel 4 Global interrupt flag    */
#define  DMA_ISR_TCIF4                       (0x00002000)        /*!< Channel 4 Transfer Complete flag   */
#define  DMA_ISR_HTIF4                       (0x00004000)        /*!< Channel 4 Half Transfer flag       */
#define  DMA_ISR_TEIF4                       (0x00008000)        /*!< Channel 4 Transfer Error flag      */
#define  DMA_ISR_GIF5                        (0x00010000)        /*!< Channel 5 Global interrupt flag    */
#define  DMA_ISR_TCIF5                       (0x00020000)        /*!< Channel 5 Transfer Complete flag   */
#define  DMA_ISR_HTIF5                       (0x00040000)        /*!< Channel 5 Half Transfer flag       */
#define  DMA_ISR_TEIF5                       (0x00080000)        /*!< Channel 5 Transfer Error flag      */
#define  DMA_ISR_GIF6                        (0x00100000)        /*!< Channel 6 Global interrupt flag (only for STM32F072 devices) */
#define  DMA_ISR_TCIF6                       (0x00200000)        /*!< Channel 6 Transfer Complete flag (only for STM32F072 devices) */
#define  DMA_ISR_HTIF6                       (0x00400000)        /*!< Channel 6 Half Transfer flag (only for STM32F072 devices) */
#define  DMA_ISR_TEIF6                       (0x00800000)        /*!< Channel 6 Transfer Error flag (only for STM32F072 devices) */
#define  DMA_ISR_GIF7                        (0x01000000)        /*!< Channel 7 Global interrupt flag (only for STM32F072 devices) */
#define  DMA_ISR_TCIF7                       (0x02000000)        /*!< Channel 7 Transfer Complete flag (only for STM32F072 devices) */
#define  DMA_ISR_HTIF7                       (0x04000000)        /*!< Channel 7 Half Transfer flag (only for STM32F072 devices) */
#define  DMA_ISR_TEIF7                       (0x08000000)        /*!< Channel 7 Transfer Error flag (only for STM32F072 devices) */

#define  DMA_IFCR_CGIF1                      (0x00000001)        /*!< Channel 1 Global interrupt clear    */
#define  DMA_IFCR_CTCIF1                     (0x00000002)        /*!< Channel 1 Transfer Complete clear   */
#define  DMA_IFCR_CHTIF1                     (0x00000004)        /*!< Channel 1 Half Transfer clear       */
#define  DMA_IFCR_CTEIF1                     (0x00000008)        /*!< Channel 1 Transfer Error clear      */
#define  DMA_IFCR_CGIF2                      (0x00000010)        /*!< Channel 2 Global interrupt clear    */
#define  DMA_IFCR_CTCIF2                     (0x00000020)        /*!< Channel 2 Transfer Complete clear   */
#define  DMA_IFCR_CHTIF2                     (0x00000040)        /*!< Channel 2 Half Transfer clear       */
#define  DMA_IFCR_CTEIF2                     (0x00000080)        /*!< Channel 2 Transfer Error clear      */
#define  DMA_IFCR_CGIF3                      (0x00000100)        /*!< Channel 3 Global interrupt clear    */
#define  DMA_IFCR_CTCIF3                     (0x00000200)        /*!< Channel 3 Transfer Complete clear   */
#define  DMA_IFCR_CHTIF3                     (0x00000400)        /*!< Channel 3 Half Transfer clear       */
#define  DMA_IFCR_CTEIF3                     (0x00000800)        /*!< Channel 3 Transfer Error clear      */
#define  DMA_IFCR_CGIF4                      (0x00001000)        /*!< Channel 4 Global interrupt clear    */
#define  DMA_IFCR_CTCIF4                     (0x00002000)        /*!< Channel 4 Transfer Complete clear   */
#define  DMA_IFCR_CHTIF4                     (0x00004000)        /*!< Channel 4 Half Transfer clear       */
#define  DMA_IFCR_CTEIF4                     (0x00008000)        /*!< Channel 4 Transfer Error clear      */
#define  DMA_IFCR_CGIF5                      (0x00010000)        /*!< Channel 5 Global interrupt clear    */
#define  DMA_IFCR_CTCIF5                     (0x00020000)        /*!< Channel 5 Transfer Complete clear   */
#define  DMA_IFCR_CHTIF5                     (0x00040000)        /*!< Channel 5 Half Transfer clear       */
#define  DMA_IFCR_CTEIF5                     (0x00080000)        /*!< Channel 5 Transfer Error clear      */
#define  DMA_IFCR_CGIF6                      (0x00100000)        /*!< Channel 6 Global interrupt clear (only for STM32F072 devices) */
#define  DMA_IFCR_CTCIF6                     (0x00200000)        /*!< Channel 6 Transfer Complete clear (only for STM32F072 devices) */
#define  DMA_IFCR_CHTIF6                     (0x00400000)        /*!< Channel 6 Half Transfer clear (only for STM32F072 devices) */
#define  DMA_IFCR_CTEIF6                     (0x00800000)        /*!< Channel 6 Transfer Error clear (only for STM32F072 devices) */
#define  DMA_IFCR_CGIF7                      (0x01000000)        /*!< Channel 7 Global interrupt clear (only for STM32F072 devices) */
#define  DMA_IFCR_CTCIF7                     (0x02000000)        /*!< Channel 7 Transfer Complete clear (only for STM32F072 devices) */
#define  DMA_IFCR_CHTIF7                     (0x04000000)        /*!< Channel 7 Half Transfer clear (only for STM32F072 devices) */
#define  DMA_IFCR_CTEIF7                     (0x08000000)        /*!< Channel 7 Transfer Error clear (only for STM32F072 devices) */

#define  DMA_CCR_EN                          (0x00000001)        /*!< Channel enable                      */
#define  DMA_CCR_TCIE                        (0x00000002)        /*!< Transfer complete interrupt enable  */
#define  DMA_CCR_HTIE                        (0x00000004)        /*!< Half Transfer interrupt enable      */
#define  DMA_CCR_TEIE                        (0x00000008)        /*!< Transfer error interrupt enable     */
#define  DMA_CCR_DIR                         (0x00000010)        /*!< Data transfer direction             */
#define  DMA_CCR_CIRC                        (0x00000020)        /*!< Circular mode                       */
#define  DMA_CCR_PINC                        (0x00000040)        /*!< Peripheral increment mode           */
#define  DMA_CCR_MINC                        (0x00000080)        /*!< Memory increment mode               */

#define  DMA_CCR_PSIZE                       (0x00000300)        /*!< PSIZE[1:0] bits (Peripheral size)   */
#define  DMA_CCR_PSIZE_0                     (0x00000100)        /*!< Bit 0                               */
#define  DMA_CCR_PSIZE_1                     (0x00000200)        /*!< Bit 1                               */

#define  DMA_CCR_MSIZE                       (0x00000C00)        /*!< MSIZE[1:0] bits (Memory size)       */
#define  DMA_CCR_MSIZE_0                     (0x00000400)        /*!< Bit 0                               */
#define  DMA_CCR_MSIZE_1                     (0x00000800)        /*!< Bit 1                               */

#define  DMA_CCR_PL                          (0x00003000)        /*!< PL[1:0] bits(Channel Priority level)*/
#define  DMA_CCR_PL_0                        (0x00001000)        /*!< Bit 0                               */
#define  DMA_CCR_PL_1                        (0x00002000)        /*!< Bit 1                               */

