the-nw1-group/acb-modules/acb-common/include/stm32f0xx.inc
#define  EXTI_FTSR_TR0                       (0x00000001)        /*!< Falling trigger event configuration bit of line 0 */
#define  EXTI_FTSR_TR1                       (0x00000002)        /*!< Falling trigger event configuration bit of line 1 */
#define  EXTI_FTSR_TR2                       (0x00000004)        /*!< Falling trigger event configuration bit of line 2 */
#define  EXTI_FTSR_TR3                       (0x00000008)        /*!< Falling trigger event configuration bit of line 3 */
#define  EXTI_FTSR_TR4                       (0x00000010)        /*!< Falling trigger event configuration bit of line 4 */
#define  EXTI_FTSR_TR5                       (0x00000020)        /*!< Falling trigger event configuration bit of line 5 */
#define  EXTI_FTSR_TR6                       (0x00000040)        /*!< Falling trigger event configuration bit of line 6 */
#define  EXTI_FTSR_TR7                       (0x00000080)        /*!< Falling trigger event configuration bit of line 7 */
#define  EXTI_FTSR_TR8                       (0x00000100)        /*!< Falling trigger event configuration bit of line 8 */
#define  EXTI_FTSR_TR9                       (0x00000200)        /*!< Falling trigger event configuration bit of line 9 */
#define  EXTI_FTSR_TR10                      (0x00000400)        /*!< Falling trigger event configuration bit of line 10 */
#define  EXTI_FTSR_TR11                      (0x00000800)        /*!< Falling trigger event configuration bit of line 11 */
#define  EXTI_FTSR_TR12                      (0x00001000)        /*!< Falling trigger event configuration bit of line 12 */
#define  EXTI_FTSR_TR13                      (0x00002000)        /*!< Falling trigger event configuration bit of line 13 */
#define  EXTI_FTSR_TR14                      (0x00004000)        /*!< Falling trigger event configuration bit of line 14 */
#define  EXTI_FTSR_TR15                      (0x00008000)        /*!< Falling trigger event configuration bit of line 15 */
#define  EXTI_FTSR_TR16                      (0x00010000)        /*!< Falling trigger event configuration bit of line 16 */
#define  EXTI_FTSR_TR17                      (0x00020000)        /*!< Falling trigger event configuration bit of line 17 */
#define  EXTI_FTSR_TR19                      (0x00080000)        /*!< Falling trigger event configuration bit of line 19 */
#define  EXTI_FTSR_TR20                      (0x00100000)        /*!< Falling trigger event configuration bit of line 20 */
#define  EXTI_FTSR_TR21                      (0x00200000)        /*!< Falling trigger event configuration bit of line 21 */
#define  EXTI_FTSR_TR22                      (0x00400000)        /*!< Falling trigger event configuration bit of line 22 */

#define  EXTI_SWIER_SWIER0                   (0x00000001)        /*!< Software Interrupt on line 0  */
#define  EXTI_SWIER_SWIER1                   (0x00000002)        /*!< Software Interrupt on line 1  */
#define  EXTI_SWIER_SWIER2                   (0x00000004)        /*!< Software Interrupt on line 2  */
#define  EXTI_SWIER_SWIER3                   (0x00000008)        /*!< Software Interrupt on line 3  */
#define  EXTI_SWIER_SWIER4                   (0x00000010)        /*!< Software Interrupt on line 4  */
#define  EXTI_SWIER_SWIER5                   (0x00000020)        /*!< Software Interrupt on line 5  */
#define  EXTI_SWIER_SWIER6                   (0x00000040)        /*!< Software Interrupt on line 6  */
#define  EXTI_SWIER_SWIER7                   (0x00000080)        /*!< Software Interrupt on line 7  */
#define  EXTI_SWIER_SWIER8                   (0x00000100)        /*!< Software Interrupt on line 8  */
#define  EXTI_SWIER_SWIER9                   (0x00000200)        /*!< Software Interrupt on line 9  */
#define  EXTI_SWIER_SWIER10                  (0x00000400)        /*!< Software Interrupt on line 10 */
#define  EXTI_SWIER_SWIER11                  (0x00000800)        /*!< Software Interrupt on line 11 */
#define  EXTI_SWIER_SWIER12                  (0x00001000)        /*!< Software Interrupt on line 12 */
#define  EXTI_SWIER_SWIER13                  (0x00002000)        /*!< Software Interrupt on line 13 */
#define  EXTI_SWIER_SWIER14                  (0x00004000)        /*!< Software Interrupt on line 14 */
#define  EXTI_SWIER_SWIER15                  (0x00008000)        /*!< Software Interrupt on line 15 */
#define  EXTI_SWIER_SWIER16                  (0x00010000)        /*!< Software Interrupt on line 16 */
#define  EXTI_SWIER_SWIER17                  (0x00020000)        /*!< Software Interrupt on line 17 */
#define  EXTI_SWIER_SWIER19                  (0x00080000)        /*!< Software Interrupt on line 19 */
#define  EXTI_SWIER_SWIER20                  (0x00100000)        /*!< Software Interrupt on line 20 */
#define  EXTI_SWIER_SWIER21                  (0x00200000)        /*!< Software Interrupt on line 21 */
#define  EXTI_SWIER_SWIER22                  (0x00400000)        /*!< Software Interrupt on line 22 */

#define  EXTI_PR_PR0                         (0x00000001)        /*!< Pending bit 0  */
#define  EXTI_PR_PR1                         (0x00000002)        /*!< Pending bit 1  */
#define  EXTI_PR_PR2                         (0x00000004)        /*!< Pending bit 2  */
#define  EXTI_PR_PR3                         (0x00000008)        /*!< Pending bit 3  */
#define  EXTI_PR_PR4                         (0x00000010)        /*!< Pending bit 4  */
#define  EXTI_PR_PR5                         (0x00000020)        /*!< Pending bit 5  */
#define  EXTI_PR_PR6                         (0x00000040)        /*!< Pending bit 6  */
#define  EXTI_PR_PR7                         (0x00000080)        /*!< Pending bit 7  */
#define  EXTI_PR_PR8                         (0x00000100)        /*!< Pending bit 8  */
#define  EXTI_PR_PR9                         (0x00000200)        /*!< Pending bit 9  */
#define  EXTI_PR_PR10                        (0x00000400)        /*!< Pending bit 10 */
#define  EXTI_PR_PR11                        (0x00000800)        /*!< Pending bit 11 */
#define  EXTI_PR_PR12                        (0x00001000)        /*!< Pending bit 12 */
#define  EXTI_PR_PR13                        (0x00002000)        /*!< Pending bit 13 */
#define  EXTI_PR_PR14                        (0x00004000)        /*!< Pending bit 14 */
#define  EXTI_PR_PR15                        (0x00008000)        /*!< Pending bit 15 */
#define  EXTI_PR_PR16                        (0x00010000)        /*!< Pending bit 16 */
#define  EXTI_PR_PR17                        (0x00020000)        /*!< Pending bit 17 */
#define  EXTI_PR_PR19                        (0x00080000)        /*!< Pending bit 19 */
#define  EXTI_PR_PR20                        (0x00100000)        /*!< Pending bit 20 */
#define  EXTI_PR_PR21                        (0x00200000)        /*!< Pending bit 21 */
#define  EXTI_PR_PR22                        (0x00400000)        /*!< Pending bit 22 */


#define  FLASH_ACR_LATENCY                   (0x00000001)        /*!< LATENCY bit (Latency) */

#define  FLASH_ACR_PRFTBE                    (0x00000010)        /*!< Prefetch Buffer Enable */
#define  FLASH_ACR_PRFTBS                    (0x00000020)        /*!< Prefetch Buffer Status */

#define  FLASH_KEYR_FKEYR                    (0xFFFFFFFF)        /*!< FPEC Key */

#define  FLASH_OPTKEYR_OPTKEYR               (0xFFFFFFFF)        /*!< Option Byte Key */

