the-nw1-group/acb-modules/acb-common/include/stm32f0xx.inc
#define FLASH_FKEY1                          (0x45670123)        /*!< Flash program erase key1 */
#define FLASH_FKEY2                          (0xCDEF89AB)        /*!< Flash program erase key2: used with FLASH_PEKEY1
                                                                                to unlock the write access to the FPEC. */

#define FLASH_OPTKEY1                        (0x45670123)        /*!< Flash option key1 */
#define FLASH_OPTKEY2                        (0xCDEF89AB)        /*!< Flash option key2: used with FLASH_OPTKEY1 to
                                                                                unlock the write access to the option byte block */

#define  FLASH_SR_BSY                        (0x00000001)        /*!< Busy */
#define  FLASH_SR_PGERR                      (0x00000004)        /*!< Programming Error */
#define  FLASH_SR_WRPRTERR                   (0x00000010)        /*!< Write Protection Error */
#define  FLASH_SR_EOP                        (0x00000020)        /*!< End of operation */
#define  FLASH_SR_WRPERR                     FLASH_SR_WRPRTERR             /*!< Legacy of Write Protection Error */

#define  FLASH_CR_PG                         (0x00000001)        /*!< Programming */
#define  FLASH_CR_PER                        (0x00000002)        /*!< Page Erase */
#define  FLASH_CR_MER                        (0x00000004)        /*!< Mass Erase */
#define  FLASH_CR_OPTPG                      (0x00000010)        /*!< Option Byte Programming */
#define  FLASH_CR_OPTER                      (0x00000020)        /*!< Option Byte Erase */
#define  FLASH_CR_STRT                       (0x00000040)        /*!< Start */
#define  FLASH_CR_LOCK                       (0x00000080)        /*!< Lock */
#define  FLASH_CR_OPTWRE                     (0x00000200)        /*!< Option Bytes Write Enable */
#define  FLASH_CR_ERRIE                      (0x00000400)        /*!< Error Interrupt Enable */
#define  FLASH_CR_EOPIE                      (0x00001000)        /*!< End of operation interrupt enable */
#define  FLASH_CR_OBL_LAUNCH                 (0x00002000)        /*!< Option Bytes Loader Launch */

#define  FLASH_AR_FAR                        (0xFFFFFFFF)        /*!< Flash Address */

#define  FLASH_OBR_OPTERR                    (0x00000001)        /*!< Option Byte Error */
#define  FLASH_OBR_RDPRT1                    (0x00000002)        /*!< Read protection Level bit 1 */
#define  FLASH_OBR_RDPRT2                    (0x00000004)        /*!< Read protection Level bit 2 */

#define  FLASH_OBR_USER                      (0x00003700)        /*!< User Option Bytes */
#define  FLASH_OBR_IWDG_SW                   (0x00000100)        /*!< IWDG SW */
#define  FLASH_OBR_nRST_STOP                 (0x00000200)        /*!< nRST_STOP */
#define  FLASH_OBR_nRST_STDBY                (0x00000400)        /*!< nRST_STDBY */
#define  FLASH_OBR_nBOOT0                    (0x00000800)        /*!< nBOOT0 */
#define  FLASH_OBR_nBOOT1                    (0x00001000)        /*!< nBOOT1 */
#define  FLASH_OBR_VDDA_MONITOR              (0x00002000)        /*!< VDDA power supply supervisor */
#define  FLASH_OBR_RAM_PARITY_CHECK          (0x00004000)        /*!< RAM Parity Check */
#define  FLASH_OBR_nBOOT0_SW                 (0x00008000)        /*!< nBOOT0 SW  (available only in the STM32F042 devices)*/
#define  FLASH_OBR_DATA0                     (0x00FF0000)        /*!< DATA0 */
#define  FLASH_OBR_DATA1                     (0xFF000000)        /*!< DATA0 */

#define FLASH_OBR_BOOT1                      FLASH_OBR_nBOOT1

#define FLASH_OBR_VDDA_ANALOG                FLASH_OBR_VDDA_MONITOR

#define  FLASH_WRPR_WRP                      (0xFFFFFFFF)        /*!< Write Protect */


#define  OB_RDP_RDP                          (0x000000FF)        /*!< Read protection option byte */
#define  OB_RDP_nRDP                         (0x0000FF00)        /*!< Read protection complemented option byte */

#define  OB_USER_USER                        (0x00FF0000)        /*!< User option byte */
#define  OB_USER_nUSER                       (0xFF000000)        /*!< User complemented option byte */

#define  OB_WRP0_WRP0                        (0x000000FF)        /*!< Flash memory write protection option bytes */
#define  OB_WRP0_nWRP0                       (0x0000FF00)        /*!< Flash memory write protection complemented option bytes */

#define  OB_WRP1_WRP1                        (0x00FF0000)        /*!< Flash memory write protection option bytes */
#define  OB_WRP1_nWRP1                       (0xFF000000)        /*!< Flash memory write protection complemented option bytes */

#define  OB_WRP2_WRP2                        (0x000000FF)        /*!< Flash memory write protection option bytes (only for STM32F072 devices) */
#define  OB_WRP2_nWRP2                       (0x0000FF00)        /*!< Flash memory write protection complemented option bytes (only for STM32F072 devices) */

#define  OB_WRP3_WRP3                        (0x00FF0000)        /*!< Flash memory write protection option bytes (only for STM32F072 devices) */
#define  OB_WRP3_nWRP3                       (0xFF000000)        /*!< Flash memory write protection complemented option bytes (only for STM32F072 devices) */

#define GPIO_MODER_MODER0          (0x00000003)
#define GPIO_MODER_MODER0_0        (0x00000001)
#define GPIO_MODER_MODER0_1        (0x00000002)
#define GPIO_MODER_MODER1          (0x0000000C)
#define GPIO_MODER_MODER1_0        (0x00000004)
#define GPIO_MODER_MODER1_1        (0x00000008)
#define GPIO_MODER_MODER2          (0x00000030)
#define GPIO_MODER_MODER2_0        (0x00000010)
#define GPIO_MODER_MODER2_1        (0x00000020)
#define GPIO_MODER_MODER3          (0x000000C0)
#define GPIO_MODER_MODER3_0        (0x00000040)
#define GPIO_MODER_MODER3_1        (0x00000080)
#define GPIO_MODER_MODER4          (0x00000300)
#define GPIO_MODER_MODER4_0        (0x00000100)
#define GPIO_MODER_MODER4_1        (0x00000200)
#define GPIO_MODER_MODER5          (0x00000C00)
#define GPIO_MODER_MODER5_0        (0x00000400)
#define GPIO_MODER_MODER5_1        (0x00000800)
#define GPIO_MODER_MODER6          (0x00003000)
#define GPIO_MODER_MODER6_0        (0x00001000)
#define GPIO_MODER_MODER6_1        (0x00002000)
#define GPIO_MODER_MODER7          (0x0000C000)
#define GPIO_MODER_MODER7_0        (0x00004000)
#define GPIO_MODER_MODER7_1        (0x00008000)
#define GPIO_MODER_MODER8          (0x00030000)
#define GPIO_MODER_MODER8_0        (0x00010000)
#define GPIO_MODER_MODER8_1        (0x00020000)
#define GPIO_MODER_MODER9          (0x000C0000)
#define GPIO_MODER_MODER9_0        (0x00040000)
#define GPIO_MODER_MODER9_1        (0x00080000)
#define GPIO_MODER_MODER10         (0x00300000)
#define GPIO_MODER_MODER10_0       (0x00100000)
#define GPIO_MODER_MODER10_1       (0x00200000)
#define GPIO_MODER_MODER11         (0x00C00000)
#define GPIO_MODER_MODER11_0       (0x00400000)
#define GPIO_MODER_MODER11_1       (0x00800000)
#define GPIO_MODER_MODER12         (0x03000000)
#define GPIO_MODER_MODER12_0       (0x01000000)
#define GPIO_MODER_MODER12_1       (0x02000000)
#define GPIO_MODER_MODER13         (0x0C000000)
#define GPIO_MODER_MODER13_0       (0x04000000)
#define GPIO_MODER_MODER13_1       (0x08000000)
#define GPIO_MODER_MODER14         (0x30000000)
#define GPIO_MODER_MODER14_0       (0x10000000)
#define GPIO_MODER_MODER14_1       (0x20000000)
#define GPIO_MODER_MODER15         (0xC0000000)
#define GPIO_MODER_MODER15_0       (0x40000000)
#define GPIO_MODER_MODER15_1       (0x80000000)

#define GPIO_OTYPER_OT_0           (0x00000001)
#define GPIO_OTYPER_OT_1           (0x00000002)
#define GPIO_OTYPER_OT_2           (0x00000004)
#define GPIO_OTYPER_OT_3           (0x00000008)
#define GPIO_OTYPER_OT_4           (0x00000010)
#define GPIO_OTYPER_OT_5           (0x00000020)
#define GPIO_OTYPER_OT_6           (0x00000040)
#define GPIO_OTYPER_OT_7           (0x00000080)
#define GPIO_OTYPER_OT_8           (0x00000100)
#define GPIO_OTYPER_OT_9           (0x00000200)
#define GPIO_OTYPER_OT_10          (0x00000400)
#define GPIO_OTYPER_OT_11          (0x00000800)
#define GPIO_OTYPER_OT_12          (0x00001000)
#define GPIO_OTYPER_OT_13          (0x00002000)
#define GPIO_OTYPER_OT_14          (0x00004000)
#define GPIO_OTYPER_OT_15          (0x00008000)

#define GPIO_OSPEEDR_OSPEEDR0     (0x00000003)
#define GPIO_OSPEEDR_OSPEEDR0_0   (0x00000001)
#define GPIO_OSPEEDR_OSPEEDR0_1   (0x00000002)
#define GPIO_OSPEEDR_OSPEEDR1     (0x0000000C)
#define GPIO_OSPEEDR_OSPEEDR1_0   (0x00000004)
#define GPIO_OSPEEDR_OSPEEDR1_1   (0x00000008)
#define GPIO_OSPEEDR_OSPEEDR2     (0x00000030)
#define GPIO_OSPEEDR_OSPEEDR2_0   (0x00000010)
#define GPIO_OSPEEDR_OSPEEDR2_1   (0x00000020)
#define GPIO_OSPEEDR_OSPEEDR3     (0x000000C0)
#define GPIO_OSPEEDR_OSPEEDR3_0   (0x00000040)
#define GPIO_OSPEEDR_OSPEEDR3_1   (0x00000080)
#define GPIO_OSPEEDR_OSPEEDR4     (0x00000300)
#define GPIO_OSPEEDR_OSPEEDR4_0   (0x00000100)
#define GPIO_OSPEEDR_OSPEEDR4_1   (0x00000200)
#define GPIO_OSPEEDR_OSPEEDR5     (0x00000C00)
#define GPIO_OSPEEDR_OSPEEDR5_0   (0x00000400)
#define GPIO_OSPEEDR_OSPEEDR5_1   (0x00000800)
#define GPIO_OSPEEDR_OSPEEDR6     (0x00003000)
#define GPIO_OSPEEDR_OSPEEDR6_0   (0x00001000)
#define GPIO_OSPEEDR_OSPEEDR6_1   (0x00002000)
#define GPIO_OSPEEDR_OSPEEDR7     (0x0000C000)
#define GPIO_OSPEEDR_OSPEEDR7_0   (0x00004000)
#define GPIO_OSPEEDR_OSPEEDR7_1   (0x00008000)
#define GPIO_OSPEEDR_OSPEEDR8     (0x00030000)
#define GPIO_OSPEEDR_OSPEEDR8_0   (0x00010000)
#define GPIO_OSPEEDR_OSPEEDR8_1   (0x00020000)
#define GPIO_OSPEEDR_OSPEEDR9     (0x000C0000)
#define GPIO_OSPEEDR_OSPEEDR9_0   (0x00040000)
#define GPIO_OSPEEDR_OSPEEDR9_1   (0x00080000)
#define GPIO_OSPEEDR_OSPEEDR10    (0x00300000)
#define GPIO_OSPEEDR_OSPEEDR10_0  (0x00100000)
#define GPIO_OSPEEDR_OSPEEDR10_1  (0x00200000)
#define GPIO_OSPEEDR_OSPEEDR11    (0x00C00000)
#define GPIO_OSPEEDR_OSPEEDR11_0  (0x00400000)
#define GPIO_OSPEEDR_OSPEEDR11_1  (0x00800000)
#define GPIO_OSPEEDR_OSPEEDR12    (0x03000000)
#define GPIO_OSPEEDR_OSPEEDR12_0  (0x01000000)
#define GPIO_OSPEEDR_OSPEEDR12_1  (0x02000000)
#define GPIO_OSPEEDR_OSPEEDR13    (0x0C000000)
#define GPIO_OSPEEDR_OSPEEDR13_0  (0x04000000)
#define GPIO_OSPEEDR_OSPEEDR13_1  (0x08000000)
#define GPIO_OSPEEDR_OSPEEDR14    (0x30000000)
#define GPIO_OSPEEDR_OSPEEDR14_0  (0x10000000)
#define GPIO_OSPEEDR_OSPEEDR14_1  (0x20000000)
#define GPIO_OSPEEDR_OSPEEDR15    (0xC0000000)
#define GPIO_OSPEEDR_OSPEEDR15_0  (0x40000000)
#define GPIO_OSPEEDR_OSPEEDR15_1  (0x80000000)

#define GPIO_OSPEEDER_OSPEEDR0     GPIO_OSPEEDR_OSPEEDR0
#define GPIO_OSPEEDER_OSPEEDR0_0   GPIO_OSPEEDR_OSPEEDR0_0
#define GPIO_OSPEEDER_OSPEEDR0_1   GPIO_OSPEEDR_OSPEEDR0_1
#define GPIO_OSPEEDER_OSPEEDR1     GPIO_OSPEEDR_OSPEEDR1
#define GPIO_OSPEEDER_OSPEEDR1_0   GPIO_OSPEEDR_OSPEEDR1_0
#define GPIO_OSPEEDER_OSPEEDR1_1   GPIO_OSPEEDR_OSPEEDR1_1
#define GPIO_OSPEEDER_OSPEEDR2     GPIO_OSPEEDR_OSPEEDR2
#define GPIO_OSPEEDER_OSPEEDR2_0   GPIO_OSPEEDR_OSPEEDR2_0
#define GPIO_OSPEEDER_OSPEEDR2_1   GPIO_OSPEEDR_OSPEEDR2_1
#define GPIO_OSPEEDER_OSPEEDR3     GPIO_OSPEEDR_OSPEEDR3
#define GPIO_OSPEEDER_OSPEEDR3_0   GPIO_OSPEEDR_OSPEEDR3_0
#define GPIO_OSPEEDER_OSPEEDR3_1   GPIO_OSPEEDR_OSPEEDR3_1
#define GPIO_OSPEEDER_OSPEEDR4     GPIO_OSPEEDR_OSPEEDR4
#define GPIO_OSPEEDER_OSPEEDR4_0   GPIO_OSPEEDR_OSPEEDR4_0
#define GPIO_OSPEEDER_OSPEEDR4_1   GPIO_OSPEEDR_OSPEEDR4_1
#define GPIO_OSPEEDER_OSPEEDR5     GPIO_OSPEEDR_OSPEEDR5
#define GPIO_OSPEEDER_OSPEEDR5_0   GPIO_OSPEEDR_OSPEEDR5_0
#define GPIO_OSPEEDER_OSPEEDR5_1   GPIO_OSPEEDR_OSPEEDR5_1
#define GPIO_OSPEEDER_OSPEEDR6     GPIO_OSPEEDR_OSPEEDR6
#define GPIO_OSPEEDER_OSPEEDR6_0   GPIO_OSPEEDR_OSPEEDR6_0
#define GPIO_OSPEEDER_OSPEEDR6_1   GPIO_OSPEEDR_OSPEEDR6_1
#define GPIO_OSPEEDER_OSPEEDR7     GPIO_OSPEEDR_OSPEEDR7
#define GPIO_OSPEEDER_OSPEEDR7_0   GPIO_OSPEEDR_OSPEEDR7_0
#define GPIO_OSPEEDER_OSPEEDR7_1   GPIO_OSPEEDR_OSPEEDR7_1
#define GPIO_OSPEEDER_OSPEEDR8     GPIO_OSPEEDR_OSPEEDR8
#define GPIO_OSPEEDER_OSPEEDR8_0   GPIO_OSPEEDR_OSPEEDR8_0
#define GPIO_OSPEEDER_OSPEEDR8_1   GPIO_OSPEEDR_OSPEEDR8_1
#define GPIO_OSPEEDER_OSPEEDR9     GPIO_OSPEEDR_OSPEEDR9
#define GPIO_OSPEEDER_OSPEEDR9_0   GPIO_OSPEEDR_OSPEEDR9_0
#define GPIO_OSPEEDER_OSPEEDR9_1   GPIO_OSPEEDR_OSPEEDR9_1
#define GPIO_OSPEEDER_OSPEEDR10    GPIO_OSPEEDR_OSPEEDR10
#define GPIO_OSPEEDER_OSPEEDR10_0  GPIO_OSPEEDR_OSPEEDR10_0
#define GPIO_OSPEEDER_OSPEEDR10_1  GPIO_OSPEEDR_OSPEEDR10_1
#define GPIO_OSPEEDER_OSPEEDR11    GPIO_OSPEEDR_OSPEEDR11
#define GPIO_OSPEEDER_OSPEEDR11_0  GPIO_OSPEEDR_OSPEEDR11_0
#define GPIO_OSPEEDER_OSPEEDR11_1  GPIO_OSPEEDR_OSPEEDR11_1
#define GPIO_OSPEEDER_OSPEEDR12    GPIO_OSPEEDR_OSPEEDR12
#define GPIO_OSPEEDER_OSPEEDR12_0  GPIO_OSPEEDR_OSPEEDR12_0
#define GPIO_OSPEEDER_OSPEEDR12_1  GPIO_OSPEEDR_OSPEEDR12_1
#define GPIO_OSPEEDER_OSPEEDR13    GPIO_OSPEEDR_OSPEEDR13
#define GPIO_OSPEEDER_OSPEEDR13_0  GPIO_OSPEEDR_OSPEEDR13_0
#define GPIO_OSPEEDER_OSPEEDR13_1  GPIO_OSPEEDR_OSPEEDR13_1
#define GPIO_OSPEEDER_OSPEEDR14    GPIO_OSPEEDR_OSPEEDR14
#define GPIO_OSPEEDER_OSPEEDR14_0  GPIO_OSPEEDR_OSPEEDR14_0
#define GPIO_OSPEEDER_OSPEEDR14_1  GPIO_OSPEEDR_OSPEEDR14_1
#define GPIO_OSPEEDER_OSPEEDR15    GPIO_OSPEEDR_OSPEEDR15
#define GPIO_OSPEEDER_OSPEEDR15_0  GPIO_OSPEEDR_OSPEEDR15_0
#define GPIO_OSPEEDER_OSPEEDR15_1  GPIO_OSPEEDR_OSPEEDR15_1

#define GPIO_PUPDR_PUPDR0          (0x00000003)
#define GPIO_PUPDR_PUPDR0_0        (0x00000001)
#define GPIO_PUPDR_PUPDR0_1        (0x00000002)
#define GPIO_PUPDR_PUPDR1          (0x0000000C)
#define GPIO_PUPDR_PUPDR1_0        (0x00000004)
#define GPIO_PUPDR_PUPDR1_1        (0x00000008)
#define GPIO_PUPDR_PUPDR2          (0x00000030)
#define GPIO_PUPDR_PUPDR2_0        (0x00000010)
#define GPIO_PUPDR_PUPDR2_1        (0x00000020)
#define GPIO_PUPDR_PUPDR3          (0x000000C0)
#define GPIO_PUPDR_PUPDR3_0        (0x00000040)
#define GPIO_PUPDR_PUPDR3_1        (0x00000080)
#define GPIO_PUPDR_PUPDR4          (0x00000300)
#define GPIO_PUPDR_PUPDR4_0        (0x00000100)
#define GPIO_PUPDR_PUPDR4_1        (0x00000200)
#define GPIO_PUPDR_PUPDR5          (0x00000C00)
#define GPIO_PUPDR_PUPDR5_0        (0x00000400)
#define GPIO_PUPDR_PUPDR5_1        (0x00000800)
#define GPIO_PUPDR_PUPDR6          (0x00003000)
#define GPIO_PUPDR_PUPDR6_0        (0x00001000)
#define GPIO_PUPDR_PUPDR6_1        (0x00002000)
#define GPIO_PUPDR_PUPDR7          (0x0000C000)
#define GPIO_PUPDR_PUPDR7_0        (0x00004000)
#define GPIO_PUPDR_PUPDR7_1        (0x00008000)
#define GPIO_PUPDR_PUPDR8          (0x00030000)
#define GPIO_PUPDR_PUPDR8_0        (0x00010000)
#define GPIO_PUPDR_PUPDR8_1        (0x00020000)
#define GPIO_PUPDR_PUPDR9          (0x000C0000)
#define GPIO_PUPDR_PUPDR9_0        (0x00040000)
#define GPIO_PUPDR_PUPDR9_1        (0x00080000)
#define GPIO_PUPDR_PUPDR10         (0x00300000)
#define GPIO_PUPDR_PUPDR10_0       (0x00100000)
#define GPIO_PUPDR_PUPDR10_1       (0x00200000)
#define GPIO_PUPDR_PUPDR11         (0x00C00000)
#define GPIO_PUPDR_PUPDR11_0       (0x00400000)
#define GPIO_PUPDR_PUPDR11_1       (0x00800000)
#define GPIO_PUPDR_PUPDR12         (0x03000000)
#define GPIO_PUPDR_PUPDR12_0       (0x01000000)
#define GPIO_PUPDR_PUPDR12_1       (0x02000000)
#define GPIO_PUPDR_PUPDR13         (0x0C000000)
#define GPIO_PUPDR_PUPDR13_0       (0x04000000)
#define GPIO_PUPDR_PUPDR13_1       (0x08000000)
#define GPIO_PUPDR_PUPDR14         (0x30000000)
#define GPIO_PUPDR_PUPDR14_0       (0x10000000)
#define GPIO_PUPDR_PUPDR14_1       (0x20000000)
#define GPIO_PUPDR_PUPDR15         (0xC0000000)
#define GPIO_PUPDR_PUPDR15_0       (0x40000000)
#define GPIO_PUPDR_PUPDR15_1       (0x80000000)

#define GPIO_IDR_0                 (0x00000001)
#define GPIO_IDR_1                 (0x00000002)
#define GPIO_IDR_2                 (0x00000004)
#define GPIO_IDR_3                 (0x00000008)
#define GPIO_IDR_4                 (0x00000010)
#define GPIO_IDR_5                 (0x00000020)
#define GPIO_IDR_6                 (0x00000040)
#define GPIO_IDR_7                 (0x00000080)
#define GPIO_IDR_8                 (0x00000100)
#define GPIO_IDR_9                 (0x00000200)
#define GPIO_IDR_10                (0x00000400)
#define GPIO_IDR_11                (0x00000800)
#define GPIO_IDR_12                (0x00001000)
#define GPIO_IDR_13                (0x00002000)
#define GPIO_IDR_14                (0x00004000)
#define GPIO_IDR_15                (0x00008000)

#define GPIO_ODR_0                 (0x00000001)
#define GPIO_ODR_1                 (0x00000002)
#define GPIO_ODR_2                 (0x00000004)
#define GPIO_ODR_3                 (0x00000008)
#define GPIO_ODR_4                 (0x00000010)
#define GPIO_ODR_5                 (0x00000020)
#define GPIO_ODR_6                 (0x00000040)
#define GPIO_ODR_7                 (0x00000080)
#define GPIO_ODR_8                 (0x00000100)
#define GPIO_ODR_9                 (0x00000200)
#define GPIO_ODR_10                (0x00000400)
#define GPIO_ODR_11                (0x00000800)
#define GPIO_ODR_12                (0x00001000)
#define GPIO_ODR_13                (0x00002000)
#define GPIO_ODR_14                (0x00004000)
#define GPIO_ODR_15                (0x00008000)

#define GPIO_BSRR_BS_0             (0x00000001)
#define GPIO_BSRR_BS_1             (0x00000002)
#define GPIO_BSRR_BS_2             (0x00000004)
#define GPIO_BSRR_BS_3             (0x00000008)
#define GPIO_BSRR_BS_4             (0x00000010)
#define GPIO_BSRR_BS_5             (0x00000020)
#define GPIO_BSRR_BS_6             (0x00000040)
#define GPIO_BSRR_BS_7             (0x00000080)
#define GPIO_BSRR_BS_8             (0x00000100)
#define GPIO_BSRR_BS_9             (0x00000200)
#define GPIO_BSRR_BS_10            (0x00000400)
#define GPIO_BSRR_BS_11            (0x00000800)
#define GPIO_BSRR_BS_12            (0x00001000)
#define GPIO_BSRR_BS_13            (0x00002000)
#define GPIO_BSRR_BS_14            (0x00004000)
#define GPIO_BSRR_BS_15            (0x00008000)
#define GPIO_BSRR_BR_0             (0x00010000)
#define GPIO_BSRR_BR_1             (0x00020000)
#define GPIO_BSRR_BR_2             (0x00040000)
#define GPIO_BSRR_BR_3             (0x00080000)
#define GPIO_BSRR_BR_4             (0x00100000)
#define GPIO_BSRR_BR_5             (0x00200000)
#define GPIO_BSRR_BR_6             (0x00400000)
#define GPIO_BSRR_BR_7             (0x00800000)
#define GPIO_BSRR_BR_8             (0x01000000)
#define GPIO_BSRR_BR_9             (0x02000000)
#define GPIO_BSRR_BR_10            (0x04000000)
#define GPIO_BSRR_BR_11            (0x08000000)
#define GPIO_BSRR_BR_12            (0x10000000)
#define GPIO_BSRR_BR_13            (0x20000000)
#define GPIO_BSRR_BR_14            (0x40000000)
#define GPIO_BSRR_BR_15            (0x80000000)

