the-nw1-group/acb-modules/acb-common/include/stm32f0xx.inc
#define  I2C_PECR_PEC                        (0x000000FF)       /*!< PEC register */

#define  I2C_RXDR_RXDATA                     (0x000000FF)        /*!< 8-bit receive data */

#define  I2C_TXDR_TXDATA                     (0x000000FF)        /*!< 8-bit transmit data */

#define  IWDG_KR_KEY                         (0xFFFF)            /*!< Key value (write only, read 0000h) */

#define  IWDG_PR_PR                          (0x07)               /*!< PR[2:0] (Prescaler divider) */
#define  IWDG_PR_PR_0                        (0x01)               /*!< Bit 0 */
#define  IWDG_PR_PR_1                        (0x02)               /*!< Bit 1 */
#define  IWDG_PR_PR_2                        (0x04)               /*!< Bit 2 */

#define  IWDG_RLR_RL                         (0x0FFF)            /*!< Watchdog counter reload value */

#define  IWDG_SR_PVU                         (0x01)               /*!< Watchdog prescaler value update */
#define  IWDG_SR_RVU                         (0x02)               /*!< Watchdog counter reload value update */
#define  IWDG_SR_WVU                         (0x04)               /*!< Watchdog counter window value update */

#define  IWDG_WINR_WIN                         (0x0FFF)            /*!< Watchdog counter window value */


#define  PWR_CR_LPDS                         (0x0001)     /*!< Low-power deepsleep/sleep */
#define  PWR_CR_PDDS                         (0x0002)     /*!< Power Down Deepsleep */
#define  PWR_CR_CWUF                         (0x0004)     /*!< Clear Wakeup Flag */
#define  PWR_CR_CSBF                         (0x0008)     /*!< Clear Standby Flag */
#define  PWR_CR_PVDE                         (0x0010)     /*!< Power Voltage Detector Enable */

#define  PWR_CR_PLS                          (0x00E0)     /*!< PLS[2:0] bits (PVD Level Selection) */
#define  PWR_CR_PLS_0                        (0x0020)     /*!< Bit 0 */
#define  PWR_CR_PLS_1                        (0x0040)     /*!< Bit 1 */
#define  PWR_CR_PLS_2                        (0x0080)     /*!< Bit 2 */
#define  PWR_CR_PLS_LEV0                     (0x0000)     /*!< PVD level 0 */
#define  PWR_CR_PLS_LEV1                     (0x0020)     /*!< PVD level 1 */
#define  PWR_CR_PLS_LEV2                     (0x0040)     /*!< PVD level 2 */
#define  PWR_CR_PLS_LEV3                     (0x0060)     /*!< PVD level 3 */
#define  PWR_CR_PLS_LEV4                     (0x0080)     /*!< PVD level 4 */
#define  PWR_CR_PLS_LEV5                     (0x00A0)     /*!< PVD level 5 */
#define  PWR_CR_PLS_LEV6                     (0x00C0)     /*!< PVD level 6 */
#define  PWR_CR_PLS_LEV7                     (0x00E0)     /*!< PVD level 7 */

#define  PWR_CR_DBP                          (0x0100)     /*!< Disable Backup Domain write protection */

#define  PWR_CR_LPSDSR                       PWR_CR_LPDS     /*!< Low-power deepsleep */

#define  PWR_CSR_WUF                         (0x0001)     /*!< Wakeup Flag */
#define  PWR_CSR_SBF                         (0x0002)     /*!< Standby Flag */
#define  PWR_CSR_PVDO                        (0x0004)     /*!< PVD Output */
#define  PWR_CSR_VREFINTRDY                  (0x0008)     /*!< Internal voltage reference (VREFINT) ready */

#define  PWR_CSR_EWUP1                       (0x0100)     /*!< Enable WKUP pin 1 */
#define  PWR_CSR_EWUP2                       (0x0200)     /*!< Enable WKUP pin 2 */
#define  PWR_CSR_EWUP3                       (0x0400)     /*!< Enable WKUP pin 3 */
#define  PWR_CSR_EWUP4                       (0x0800)     /*!< Enable WKUP pin 4 */
#define  PWR_CSR_EWUP5                       (0x1000)     /*!< Enable WKUP pin 5 */
#define  PWR_CSR_EWUP6                       (0x2000)     /*!< Enable WKUP pin 6 */
#define  PWR_CSR_EWUP7                       (0x4000)     /*!< Enable WKUP pin 7 */
#define  PWR_CSR_EWUP8                       (0x8000)     /*!< Enable WKUP pin 8 */

#define  PWR_CSR_VREFINTRDYF                 PWR_CSR_VREFINTRDY     /*!< Internal voltage reference (VREFINT) ready flag */

#define  RCC_CR_HSION                        (0x00000001)        /*!< Internal High Speed clock enable */
#define  RCC_CR_HSIRDY                       (0x00000002)        /*!< Internal High Speed clock ready flag */
#define  RCC_CR_HSITRIM                      (0x000000F8)        /*!< Internal High Speed clock trimming */
#define  RCC_CR_HSICAL                       (0x0000FF00)        /*!< Internal High Speed clock Calibration */
#define  RCC_CR_HSEON                        (0x00010000)        /*!< External High Speed clock enable */
#define  RCC_CR_HSERDY                       (0x00020000)        /*!< External High Speed clock ready flag */
#define  RCC_CR_HSEBYP                       (0x00040000)        /*!< External High Speed clock Bypass */
#define  RCC_CR_CSSON                        (0x00080000)        /*!< Clock Security System enable */
#define  RCC_CR_PLLON                        (0x01000000)        /*!< PLL enable */
#define  RCC_CR_PLLRDY                       (0x02000000)        /*!< PLL clock ready flag */

#define  RCC_CFGR_SW                         (0x00000003)        /*!< SW[1:0] bits (System clock Switch) */
#define  RCC_CFGR_SW_0                       (0x00000001)        /*!< Bit 0 */
#define  RCC_CFGR_SW_1                       (0x00000002)        /*!< Bit 1 */
#define  RCC_CFGR_SW_HSI                     (0x00000000)        /*!< HSI selected as system clock */
#define  RCC_CFGR_SW_HSE                     (0x00000001)        /*!< HSE selected as system clock */
#define  RCC_CFGR_SW_PLL                     (0x00000002)        /*!< PLL selected as system clock */
#define  RCC_CFGR_SW_HSI48                   (0x00000003)        /*!< HSI48 selected as system clock */

#define  RCC_CFGR_SWS                        (0x0000000C)        /*!< SWS[1:0] bits (System Clock Switch Status) */
#define  RCC_CFGR_SWS_0                      (0x00000004)        /*!< Bit 0 */
#define  RCC_CFGR_SWS_1                      (0x00000008)        /*!< Bit 1 */
#define  RCC_CFGR_SWS_HSI                    (0x00000000)        /*!< HSI oscillator used as system clock */
#define  RCC_CFGR_SWS_HSE                    (0x00000004)        /*!< HSE oscillator used as system clock */
#define  RCC_CFGR_SWS_PLL                    (0x00000008)        /*!< PLL used as system clock */
#define  RCC_CFGR_SWS_HSI48                  (0x0000000C)        /*!< HSI48 used as system clock */

#define  RCC_CFGR_HPRE                       (0x000000F0)        /*!< HPRE[3:0] bits (AHB prescaler) */
#define  RCC_CFGR_HPRE_0                     (0x00000010)        /*!< Bit 0 */
#define  RCC_CFGR_HPRE_1                     (0x00000020)        /*!< Bit 1 */
#define  RCC_CFGR_HPRE_2                     (0x00000040)        /*!< Bit 2 */
#define  RCC_CFGR_HPRE_3                     (0x00000080)        /*!< Bit 3 */
#define  RCC_CFGR_HPRE_DIV1                  (0x00000000)        /*!< SYSCLK not divided */
#define  RCC_CFGR_HPRE_DIV2                  (0x00000080)        /*!< SYSCLK divided by 2 */
#define  RCC_CFGR_HPRE_DIV4                  (0x00000090)        /*!< SYSCLK divided by 4 */
#define  RCC_CFGR_HPRE_DIV8                  (0x000000A0)        /*!< SYSCLK divided by 8 */
#define  RCC_CFGR_HPRE_DIV16                 (0x000000B0)        /*!< SYSCLK divided by 16 */
#define  RCC_CFGR_HPRE_DIV64                 (0x000000C0)        /*!< SYSCLK divided by 64 */
#define  RCC_CFGR_HPRE_DIV128                (0x000000D0)        /*!< SYSCLK divided by 128 */
#define  RCC_CFGR_HPRE_DIV256                (0x000000E0)        /*!< SYSCLK divided by 256 */
#define  RCC_CFGR_HPRE_DIV512                (0x000000F0)        /*!< SYSCLK divided by 512 */

#define  RCC_CFGR_PPRE                       (0x00000700)        /*!< PRE[2:0] bits (APB prescaler) */
#define  RCC_CFGR_PPRE_0                     (0x00000100)        /*!< Bit 0 */
#define  RCC_CFGR_PPRE_1                     (0x00000200)        /*!< Bit 1 */
#define  RCC_CFGR_PPRE_2                     (0x00000400)        /*!< Bit 2 */
#define  RCC_CFGR_PPRE_DIV1                  (0x00000000)        /*!< HCLK not divided */
#define  RCC_CFGR_PPRE_DIV2                  (0x00000400)        /*!< HCLK divided by 2 */
#define  RCC_CFGR_PPRE_DIV4                  (0x00000500)        /*!< HCLK divided by 4 */
#define  RCC_CFGR_PPRE_DIV8                  (0x00000600)        /*!< HCLK divided by 8 */
#define  RCC_CFGR_PPRE_DIV16                 (0x00000700)        /*!< HCLK divided by 16 */

#define  RCC_CFGR_ADCPRE                     (0x00004000)        /*!< ADC prescaler: Obsolete. Proper ADC clock selection is 
                                                                                done inside the ADC_CFGR2 */

#define  RCC_CFGR_PLLSRC                     (0x00018000)        /*!< PLL entry clock source */
#define  RCC_CFGR_PLLSRC_0                   (0x00008000)        /*!< Bit 0 (available only in the STM32F072 devices) */
#define  RCC_CFGR_PLLSRC_1                   (0x00010000)        /*!< Bit 1 */

#define  RCC_CFGR_PLLSRC_PREDIV1             (0x00010000)        /*!< PREDIV1 clock selected as PLL entry clock source; 
                                                                                Old PREDIV1 bit definition, maintained for legacy purpose */
#define  RCC_CFGR_PLLSRC_HSI_DIV2            (0x00000000)        /*!< HSI clock divided by 2 selected as PLL entry clock source */
#define  RCC_CFGR_PLLSRC_HSI_PREDIV          (0x00008000)        /*!< HSI PREDIV clock selected as PLL entry clock source 
                                                                                (This bit and configuration is only available for STM32F072 devices)*/
#define  RCC_CFGR_PLLSRC_HSE_PREDIV          (0x00010000)        /*!< HSE PREDIV clock selected as PLL entry clock source */
#define  RCC_CFGR_PLLSRC_HSI48_PREDIV        (0x00018000)        /*!< HSI48 PREDIV clock selected as PLL entry clock source */

#define  RCC_CFGR_PLLXTPRE                   (0x00020000)        /*!< HSE divider for PLL entry */
#define  RCC_CFGR_PLLXTPRE_PREDIV1           (0x00000000)        /*!< PREDIV1 clock not divided for PLL entry */
#define  RCC_CFGR_PLLXTPRE_PREDIV1_Div2      (0x00020000)        /*!< PREDIV1 clock divided by 2 for PLL entry */

#define  RCC_CFGR_PLLSRC_HSI_Div2            RCC_CFGR_PLLSRC_HSI_DIV2

#define  RCC_CFGR_PLLMUL                    (0x003C0000)        /*!< PLLMUL[3:0] bits (PLL multiplication factor) */
#define  RCC_CFGR_PLLMUL_0                  (0x00040000)        /*!< Bit 0 */
#define  RCC_CFGR_PLLMUL_1                  (0x00080000)        /*!< Bit 1 */
#define  RCC_CFGR_PLLMUL_2                  (0x00100000)        /*!< Bit 2 */
#define  RCC_CFGR_PLLMUL_3                  (0x00200000)        /*!< Bit 3 */

#define  RCC_CFGR_PLLMUL2                   (0x00000000)        /*!< PLL input clock*2 */
#define  RCC_CFGR_PLLMUL3                   (0x00040000)        /*!< PLL input clock*3 */
#define  RCC_CFGR_PLLMUL4                   (0x00080000)        /*!< PLL input clock*4 */
#define  RCC_CFGR_PLLMUL5                   (0x000C0000)        /*!< PLL input clock*5 */
#define  RCC_CFGR_PLLMUL6                   (0x00100000)        /*!< PLL input clock*6 */
#define  RCC_CFGR_PLLMUL7                   (0x00140000)        /*!< PLL input clock*7 */
#define  RCC_CFGR_PLLMUL8                   (0x00180000)        /*!< PLL input clock*8 */
#define  RCC_CFGR_PLLMUL9                   (0x001C0000)        /*!< PLL input clock*9 */
#define  RCC_CFGR_PLLMUL10                  (0x00200000)        /*!< PLL input clock10 */
#define  RCC_CFGR_PLLMUL11                  (0x00240000)        /*!< PLL input clock*11 */
#define  RCC_CFGR_PLLMUL12                  (0x00280000)        /*!< PLL input clock*12 */
#define  RCC_CFGR_PLLMUL13                  (0x002C0000)        /*!< PLL input clock*13 */
#define  RCC_CFGR_PLLMUL14                  (0x00300000)        /*!< PLL input clock*14 */
#define  RCC_CFGR_PLLMUL15                  (0x00340000)        /*!< PLL input clock*15 */
#define  RCC_CFGR_PLLMUL16                  (0x00380000)        /*!< PLL input clock*16 */

#define  RCC_CFGR_PLLMULL                    RCC_CFGR_PLLMUL        /*!< PLLMUL[3:0] bits (PLL multiplication factor) */
#define  RCC_CFGR_PLLMULL_0                  RCC_CFGR_PLLMUL_0        /*!< Bit 0 */
#define  RCC_CFGR_PLLMULL_1                  RCC_CFGR_PLLMUL_1        /*!< Bit 1 */
#define  RCC_CFGR_PLLMULL_2                  RCC_CFGR_PLLMUL_2        /*!< Bit 2 */
#define  RCC_CFGR_PLLMULL_3                  RCC_CFGR_PLLMUL_3       /*!< Bit 3 */

#define  RCC_CFGR_PLLMULL2                   RCC_CFGR_PLLMUL2       /*!< PLL input clock*2 */
#define  RCC_CFGR_PLLMULL3                   RCC_CFGR_PLLMUL3        /*!< PLL input clock*3 */
#define  RCC_CFGR_PLLMULL4                   RCC_CFGR_PLLMUL4        /*!< PLL input clock*4 */
#define  RCC_CFGR_PLLMULL5                   RCC_CFGR_PLLMUL5        /*!< PLL input clock*5 */
#define  RCC_CFGR_PLLMULL6                   RCC_CFGR_PLLMUL6        /*!< PLL input clock*6 */
#define  RCC_CFGR_PLLMULL7                   RCC_CFGR_PLLMUL7        /*!< PLL input clock*7 */
#define  RCC_CFGR_PLLMULL8                   RCC_CFGR_PLLMUL8        /*!< PLL input clock*8 */
#define  RCC_CFGR_PLLMULL9                   RCC_CFGR_PLLMUL9        /*!< PLL input clock*9 */
#define  RCC_CFGR_PLLMULL10                  RCC_CFGR_PLLMUL10        /*!< PLL input clock10 */
#define  RCC_CFGR_PLLMULL11                  RCC_CFGR_PLLMUL11        /*!< PLL input clock*11 */
#define  RCC_CFGR_PLLMULL12                  RCC_CFGR_PLLMUL12        /*!< PLL input clock*12 */
#define  RCC_CFGR_PLLMULL13                  RCC_CFGR_PLLMUL13        /*!< PLL input clock*13 */
#define  RCC_CFGR_PLLMULL14                  RCC_CFGR_PLLMUL14        /*!< PLL input clock*14 */
#define  RCC_CFGR_PLLMULL15                  RCC_CFGR_PLLMUL15        /*!< PLL input clock*15 */
#define  RCC_CFGR_PLLMULL16                  RCC_CFGR_PLLMUL16        /*!< PLL input clock*16 */

#define  RCC_CFGR_MCO                        (0x0F000000)        /*!< MCO[2:0] bits (Microcontroller Clock Output) */
#define  RCC_CFGR_MCO_0                      (0x01000000)        /*!< Bit 0 */
#define  RCC_CFGR_MCO_1                      (0x02000000)        /*!< Bit 1 */
#define  RCC_CFGR_MCO_2                      (0x04000000)        /*!< Bit 2 */
#define  RCC_CFGR_MCO_3                      (0x08000000)        /*!< Bit 3 */
#define  RCC_CFGR_MCO_NOCLOCK                (0x00000000)        /*!< No clock */
#define  RCC_CFGR_MCO_HSI14                  (0x01000000)        /*!< HSI14 clock selected as MCO source */
#define  RCC_CFGR_MCO_LSI                    (0x02000000)        /*!< LSI clock selected as MCO source */
#define  RCC_CFGR_MCO_LSE                    (0x03000000)        /*!< LSE clock selected as MCO source */
#define  RCC_CFGR_MCO_SYSCLK                 (0x04000000)        /*!< System clock selected as MCO source */
#define  RCC_CFGR_MCO_HSI                    (0x05000000)        /*!< HSI clock selected as MCO source */
#define  RCC_CFGR_MCO_HSE                    (0x06000000)        /*!< HSE clock selected as MCO source  */
#define  RCC_CFGR_MCO_PLL                    (0x07000000)        /*!< PLL clock selected as MCO source */
#define  RCC_CFGR_MCO_HSI48                  (0x08000000)        /*!< HSI48 clock selected as MCO source */

#define  RCC_CFGR_MCO_PRE                    (0x70000000)        /*!< MCO prescaler (these bits are not available in the STM32F051 devices)*/
#define  RCC_CFGR_MCO_PRE_1                  (0x00000000)        /*!< MCO is divided by 1 (this bit are not available in the STM32F051 devices)*/
#define  RCC_CFGR_MCO_PRE_2                  (0x10000000)        /*!< MCO is divided by 2 (this bit are not available in the STM32F051 devices)*/
#define  RCC_CFGR_MCO_PRE_4                  (0x20000000)        /*!< MCO is divided by 4 (this bit are not available in the STM32F051 devices)*/
#define  RCC_CFGR_MCO_PRE_8                  (0x30000000)        /*!< MCO is divided by 8 (this bit are not available in the STM32F051 devices)*/
#define  RCC_CFGR_MCO_PRE_16                 (0x40000000)        /*!< MCO is divided by 16 (this bit are not available in the STM32F051 devices)*/
#define  RCC_CFGR_MCO_PRE_32                 (0x50000000)        /*!< MCO is divided by 32 (this bit are not available in the STM32F051 devices)*/
#define  RCC_CFGR_MCO_PRE_64                 (0x60000000)        /*!< MCO is divided by 64 (this bit are not available in the STM32F051 devices)*/
#define  RCC_CFGR_MCO_PRE_128                (0x70000000)        /*!< MCO is divided by 128 (this bit are not available in the STM32F051 devices)*/

#define  RCC_CFGR_PLLNODIV                   (0x80000000)        /*!< PLL is not divided to MCO (this bit are not available in the STM32F051 devices) */

#define  RCC_CIR_LSIRDYF                     (0x00000001)        /*!< LSI Ready Interrupt flag */
#define  RCC_CIR_LSERDYF                     (0x00000002)        /*!< LSE Ready Interrupt flag */
#define  RCC_CIR_HSIRDYF                     (0x00000004)        /*!< HSI Ready Interrupt flag */
#define  RCC_CIR_HSERDYF                     (0x00000008)        /*!< HSE Ready Interrupt flag */
#define  RCC_CIR_PLLRDYF                     (0x00000010)        /*!< PLL Ready Interrupt flag */
#define  RCC_CIR_HSI14RDYF                   (0x00000020)        /*!< HSI14 Ready Interrupt flag */
#define  RCC_CIR_HSI48RDYF                   (0x00000040)        /*!< HSI48 Ready Interrupt flag */
#define  RCC_CIR_CSSF                        (0x00000080)        /*!< Clock Security System Interrupt flag */
#define  RCC_CIR_LSIRDYIE                    (0x00000100)        /*!< LSI Ready Interrupt Enable */
#define  RCC_CIR_LSERDYIE                    (0x00000200)        /*!< LSE Ready Interrupt Enable */
#define  RCC_CIR_HSIRDYIE                    (0x00000400)        /*!< HSI Ready Interrupt Enable */
#define  RCC_CIR_HSERDYIE                    (0x00000800)        /*!< HSE Ready Interrupt Enable */
#define  RCC_CIR_PLLRDYIE                    (0x00001000)        /*!< PLL Ready Interrupt Enable */
#define  RCC_CIR_HSI14RDYIE                  (0x00002000)        /*!< HSI14 Ready Interrupt Enable */
#define  RCC_CIR_HSI48RDYIE                  (0x00004000)        /*!< HSI48 Ready Interrupt Enable */
#define  RCC_CIR_LSIRDYC                     (0x00010000)        /*!< LSI Ready Interrupt Clear */
#define  RCC_CIR_LSERDYC                     (0x00020000)        /*!< LSE Ready Interrupt Clear */
#define  RCC_CIR_HSIRDYC                     (0x00040000)        /*!< HSI Ready Interrupt Clear */
#define  RCC_CIR_HSERDYC                     (0x00080000)        /*!< HSE Ready Interrupt Clear */
#define  RCC_CIR_PLLRDYC                     (0x00100000)        /*!< PLL Ready Interrupt Clear */
#define  RCC_CIR_HSI14RDYC                   (0x00200000)        /*!< HSI14 Ready Interrupt Clear */
#define  RCC_CIR_HSI48RDYC                   (0x00400000)        /*!< HSI48 Ready Interrupt Clear */
#define  RCC_CIR_CSSC                        (0x00800000)        /*!< Clock Security System Interrupt Clear */

