the-nw1-group/acb-modules/acb-common/include/stm32f0xx.inc
#define  RCC_APB2RSTR_SYSCFGRST              (0x00000001)        /*!< SYSCFG clock reset */
#define  RCC_APB2RSTR_ADCRST                 (0x00000200)        /*!< ADC clock reset */
#define  RCC_APB2RSTR_TIM1RST                (0x00000800)        /*!< TIM1 clock reset */
#define  RCC_APB2RSTR_SPI1RST                (0x00001000)        /*!< SPI1 clock reset */
#define  RCC_APB2RSTR_USART1RST              (0x00004000)        /*!< USART1 clock reset */
#define  RCC_APB2RSTR_TIM15RST               (0x00010000)        /*!< TIM15 clock reset */
#define  RCC_APB2RSTR_TIM16RST               (0x00020000)        /*!< TIM16 clock reset */
#define  RCC_APB2RSTR_TIM17RST               (0x00040000)        /*!< TIM17 clock reset */
#define  RCC_APB2RSTR_DBGMCURST              (0x00400000)        /*!< DBGMCU clock reset */

#define  RCC_APB2RSTR_ADC1RST                RCC_APB2RSTR_ADCRST          

#define  RCC_APB1RSTR_TIM2RST                (0x00000001)        /*!< Timer 2 clock reset */
#define  RCC_APB1RSTR_TIM3RST                (0x00000002)        /*!< Timer 3 clock reset */
#define  RCC_APB1RSTR_TIM6RST                (0x00000010)        /*!< Timer 6 clock reset */
#define  RCC_APB1RSTR_TIM7RST                (0x00000020)        /*!< Timer 7 clock reset */
#define  RCC_APB1RSTR_TIM14RST               (0x00000100)        /*!< Timer 14 clock reset */
#define  RCC_APB1RSTR_WWDGRST                (0x00000800)        /*!< Window Watchdog clock reset */
#define  RCC_APB1RSTR_SPI2RST                (0x00004000)        /*!< SPI2 clock reset */
#define  RCC_APB1RSTR_USART2RST              (0x00020000)        /*!< USART 2 clock reset */
#define  RCC_APB1RSTR_USART3RST              (0x00040000)        /*!< USART 3 clock reset */
#define  RCC_APB1RSTR_USART4RST              (0x00080000)        /*!< USART 4 clock reset */
#define  RCC_APB1RSTR_I2C1RST                (0x00200000)        /*!< I2C 1 clock reset */
#define  RCC_APB1RSTR_I2C2RST                (0x00400000)        /*!< I2C 2 clock reset */
#define  RCC_APB1RSTR_USBRST                 (0x00800000)        /*!< USB clock reset */
#define  RCC_APB1RSTR_CANRST                 (0x02000000)        /*!< CAN clock reset */
#define  RCC_APB1RSTR_CRSRST                 (0x08000000)        /*!< CRS clock reset */
#define  RCC_APB1RSTR_PWRRST                 (0x10000000)        /*!< PWR clock reset */
#define  RCC_APB1RSTR_DACRST                 (0x20000000)        /*!< DAC clock reset */
#define  RCC_APB1RSTR_CECRST                 (0x40000000)        /*!< CEC clock reset */

#define  RCC_AHBENR_DMAEN                    (0x00000001)        /*!< DMA clock enable */
#define  RCC_AHBENR_SRAMEN                   (0x00000004)        /*!< SRAM interface clock enable */
#define  RCC_AHBENR_FLITFEN                  (0x00000010)        /*!< FLITF clock enable */
#define  RCC_AHBENR_CRCEN                    (0x00000040)        /*!< CRC clock enable */
#define  RCC_AHBENR_GPIOAEN                  (0x00020000)        /*!< GPIOA clock enable */
#define  RCC_AHBENR_GPIOBEN                  (0x00040000)        /*!< GPIOB clock enable */
#define  RCC_AHBENR_GPIOCEN                  (0x00080000)        /*!< GPIOC clock enable */
#define  RCC_AHBENR_GPIODEN                  (0x00100000)        /*!< GPIOD clock enable */
#define  RCC_AHBENR_GPIOEEN                  (0x00200000)        /*!< GPIOE clock enable */
#define  RCC_AHBENR_GPIOFEN                  (0x00400000)        /*!< GPIOF clock enable */
#define  RCC_AHBENR_TSCEN                    (0x01000000)        /*!< TS controller clock enable */

#define  RCC_AHBENR_DMA1EN                   RCC_AHBENR_DMAEN        /*!< DMA1 clock enable */
#define  RCC_AHBENR_TSEN                     RCC_AHBENR_TSCEN        /*!< TS clock enable */

#define  RCC_APB2ENR_SYSCFGCOMPEN            (0x00000001)        /*!< SYSCFG and comparator clock enable */
#define  RCC_APB2ENR_ADCEN                   (0x00000200)        /*!< ADC1 clock enable */
#define  RCC_APB2ENR_TIM1EN                  (0x00000800)        /*!< TIM1 clock enable */
#define  RCC_APB2ENR_SPI1EN                  (0x00001000)        /*!< SPI1 clock enable */
#define  RCC_APB2ENR_USART1EN                (0x00004000)        /*!< USART1 clock enable */
#define  RCC_APB2ENR_TIM15EN                 (0x00010000)        /*!< TIM15 clock enable */
#define  RCC_APB2ENR_TIM16EN                 (0x00020000)        /*!< TIM16 clock enable */
#define  RCC_APB2ENR_TIM17EN                 (0x00040000)        /*!< TIM17 clock enable */
#define  RCC_APB2ENR_DBGMCUEN                (0x00400000)        /*!< DBGMCU clock enable */

#define  RCC_APB2ENR_SYSCFGEN                RCC_APB2ENR_SYSCFGCOMPEN        /*!< SYSCFG clock enable */
#define  RCC_APB2ENR_ADC1EN                  RCC_APB2ENR_ADCEN               /*!< ADC1 clock enable */

#define  RCC_APB1ENR_TIM2EN                  (0x00000001)        /*!< Timer 2 clock enable */
#define  RCC_APB1ENR_TIM3EN                  (0x00000002)        /*!< Timer 3 clock enable */
#define  RCC_APB1ENR_TIM6EN                  (0x00000010)        /*!< Timer 6 clock enable */
#define  RCC_APB1ENR_TIM7EN                  (0x00000020)        /*!< Timer 7 clock enable */
#define  RCC_APB1ENR_TIM14EN                 (0x00000100)        /*!< Timer 14 clock enable */
#define  RCC_APB1ENR_WWDGEN                  (0x00000800)        /*!< Window Watchdog clock enable */
#define  RCC_APB1ENR_SPI2EN                  (0x00004000)        /*!< SPI2 clock enable */
#define  RCC_APB1ENR_USART2EN                (0x00020000)        /*!< USART2 clock enable */
#define  RCC_APB1ENR_USART3EN                (0x00040000)        /*!< USART3 clock enable */
#define  RCC_APB1ENR_USART4EN                (0x00080000)        /*!< USART4 clock enable */
#define  RCC_APB1ENR_I2C1EN                  (0x00200000)        /*!< I2C1 clock enable */
#define  RCC_APB1ENR_I2C2EN                  (0x00400000)        /*!< I2C2 clock enable */
#define  RCC_APB1ENR_USBEN                   (0x00800000)        /*!< USB clock enable */
#define  RCC_APB1ENR_CANEN                   (0x02000000)         /*!< CAN clock enable */
#define  RCC_APB1ENR_CRSEN                   (0x08000000)        /*!< CRS clock enable */
#define  RCC_APB1ENR_PWREN                   (0x10000000)        /*!< PWR clock enable */
#define  RCC_APB1ENR_DACEN                   (0x20000000)        /*!< DAC clock enable */
#define  RCC_APB1ENR_CECEN                   (0x40000000)        /*!< CEC clock enable */

#define  RCC_BDCR_LSEON                      (0x00000001)        /*!< External Low Speed oscillator enable */
#define  RCC_BDCR_LSERDY                     (0x00000002)        /*!< External Low Speed oscillator Ready */
#define  RCC_BDCR_LSEBYP                     (0x00000004)        /*!< External Low Speed oscillator Bypass */

#define  RCC_BDCR_LSEDRV                     (0x00000018)        /*!< LSEDRV[1:0] bits (LSE Osc. drive capability) */
#define  RCC_BDCR_LSEDRV_0                   (0x00000008)        /*!< Bit 0 */
#define  RCC_BDCR_LSEDRV_1                   (0x00000010)        /*!< Bit 1 */

