the-nw1-group/acb-modules/acb-common/include/stm32f0xx.inc
#define  RCC_BDCR_RTCSEL                     (0x00000300)        /*!< RTCSEL[1:0] bits (RTC clock source selection) */
#define  RCC_BDCR_RTCSEL_0                   (0x00000100)        /*!< Bit 0 */
#define  RCC_BDCR_RTCSEL_1                   (0x00000200)        /*!< Bit 1 */

#define  RCC_BDCR_RTCSEL_NOCLOCK             (0x00000000)        /*!< No clock */
#define  RCC_BDCR_RTCSEL_LSE                 (0x00000100)        /*!< LSE oscillator clock used as RTC clock */
#define  RCC_BDCR_RTCSEL_LSI                 (0x00000200)        /*!< LSI oscillator clock used as RTC clock */
#define  RCC_BDCR_RTCSEL_HSE                 (0x00000300)        /*!< HSE oscillator clock divided by 32 used as RTC clock */

#define  RCC_BDCR_RTCEN                      (0x00008000)        /*!< RTC clock enable */
#define  RCC_BDCR_BDRST                      (0x00010000)        /*!< Backup domain software reset  */

#define  RCC_CSR_LSION                       (0x00000001)        /*!< Internal Low Speed oscillator enable */
#define  RCC_CSR_LSIRDY                      (0x00000002)        /*!< Internal Low Speed oscillator Ready */
#define  RCC_CSR_V18PWRRSTF                  (0x00800000)        /*!< V1.8 power domain reset flag */
#define  RCC_CSR_RMVF                        (0x01000000)        /*!< Remove reset flag */
#define  RCC_CSR_OBLRSTF                     (0x02000000)        /*!< OBL reset flag */
#define  RCC_CSR_PINRSTF                     (0x04000000)        /*!< PIN reset flag */
#define  RCC_CSR_PORRSTF                     (0x08000000)        /*!< POR/PDR reset flag */
#define  RCC_CSR_SFTRSTF                     (0x10000000)        /*!< Software Reset flag */
#define  RCC_CSR_IWDGRSTF                    (0x20000000)        /*!< Independent Watchdog reset flag */
#define  RCC_CSR_WWDGRSTF                    (0x40000000)        /*!< Window watchdog reset flag */
#define  RCC_CSR_LPWRRSTF                    (0x80000000)        /*!< Low-Power reset flag */

#define  RCC_CSR_OBL                         RCC_CSR_OBLRSTF        /*!< OBL reset flag */
#define  RCC_AHBRSTR_GPIOARST                (0x00020000)         /*!< GPIOA clock reset */
#define  RCC_AHBRSTR_GPIOBRST                (0x00040000)         /*!< GPIOB clock reset */
#define  RCC_AHBRSTR_GPIOCRST                (0x00080000)         /*!< GPIOC clock reset */
#define  RCC_AHBRSTR_GPIODRST                (0x00010000)         /*!< GPIOD clock reset */
#define  RCC_AHBRSTR_GPIOERST                (0x00020000)         /*!< GPIOE clock reset */
#define  RCC_AHBRSTR_GPIOFRST                (0x00040000)         /*!< GPIOF clock reset */
#define  RCC_AHBRSTR_TSCRST                   (0x00100000)         /*!< TS clock reset */

#define  RCC_AHBRSTR_TSRST                   RCC_AHBRSTR_TSCRST         /*!< TS clock reset */

#define  RCC_CFGR2_PREDIV1                   (0x0000000F)        /*!< PREDIV1[3:0] bits */
#define  RCC_CFGR2_PREDIV1_0                 (0x00000001)        /*!< Bit 0 */
#define  RCC_CFGR2_PREDIV1_1                 (0x00000002)        /*!< Bit 1 */
#define  RCC_CFGR2_PREDIV1_2                 (0x00000004)        /*!< Bit 2 */
#define  RCC_CFGR2_PREDIV1_3                 (0x00000008)        /*!< Bit 3 */

#define  RCC_CFGR2_PREDIV1_DIV1              (0x00000000)        /*!< PREDIV1 input clock not divided */
#define  RCC_CFGR2_PREDIV1_DIV2              (0x00000001)        /*!< PREDIV1 input clock divided by 2 */
#define  RCC_CFGR2_PREDIV1_DIV3              (0x00000002)        /*!< PREDIV1 input clock divided by 3 */
#define  RCC_CFGR2_PREDIV1_DIV4              (0x00000003)        /*!< PREDIV1 input clock divided by 4 */
#define  RCC_CFGR2_PREDIV1_DIV5              (0x00000004)        /*!< PREDIV1 input clock divided by 5 */
#define  RCC_CFGR2_PREDIV1_DIV6              (0x00000005)        /*!< PREDIV1 input clock divided by 6 */
#define  RCC_CFGR2_PREDIV1_DIV7              (0x00000006)        /*!< PREDIV1 input clock divided by 7 */
#define  RCC_CFGR2_PREDIV1_DIV8              (0x00000007)        /*!< PREDIV1 input clock divided by 8 */
#define  RCC_CFGR2_PREDIV1_DIV9              (0x00000008)        /*!< PREDIV1 input clock divided by 9 */
#define  RCC_CFGR2_PREDIV1_DIV10             (0x00000009)        /*!< PREDIV1 input clock divided by 10 */
#define  RCC_CFGR2_PREDIV1_DIV11             (0x0000000A)        /*!< PREDIV1 input clock divided by 11 */
#define  RCC_CFGR2_PREDIV1_DIV12             (0x0000000B)        /*!< PREDIV1 input clock divided by 12 */
#define  RCC_CFGR2_PREDIV1_DIV13             (0x0000000C)        /*!< PREDIV1 input clock divided by 13 */
#define  RCC_CFGR2_PREDIV1_DIV14             (0x0000000D)        /*!< PREDIV1 input clock divided by 14 */
#define  RCC_CFGR2_PREDIV1_DIV15             (0x0000000E)        /*!< PREDIV1 input clock divided by 15 */
#define  RCC_CFGR2_PREDIV1_DIV16             (0x0000000F)        /*!< PREDIV1 input clock divided by 16 */

#define  RCC_CFGR3_USART1SW                  (0x00000003)        /*!< USART1SW[1:0] bits */
#define  RCC_CFGR3_USART1SW_0                (0x00000001)        /*!< Bit 0 */
#define  RCC_CFGR3_USART1SW_1                (0x00000002)        /*!< Bit 1 */
#define  RCC_CFGR3_I2C1SW                    (0x00000010)        /*!< I2C1SW bits */
#define  RCC_CFGR3_CECSW                     (0x00000040)        /*!< CECSW bits */
#define  RCC_CFGR3_USBSW                     (0x00000080)        /*!< USBSW bits */
#define  RCC_CFGR3_ADCSW                     (0x00000100)        /*!< ADCSW bits */
#define  RCC_CFGR3_USART2SW                  (0x00030000)        /*!< USART2SW[1:0] bits */
#define  RCC_CFGR3_USART2SW_0                (0x00010000)        /*!< Bit 0 */
#define  RCC_CFGR3_USART2SW_1                (0x00020000)        /*!< Bit 1 */

#define  RCC_CR2_HSI14ON                     (0x00000001)        /*!< Internal High Speed 14MHz clock enable */
#define  RCC_CR2_HSI14RDY                    (0x00000002)        /*!< Internal High Speed 14MHz clock ready flag */
#define  RCC_CR2_HSI14DIS                    (0x00000004)        /*!< Internal High Speed 14MHz clock disable */
#define  RCC_CR2_HSI14TRIM                   (0x000000F8)        /*!< Internal High Speed 14MHz clock trimming */
#define  RCC_CR2_HSI14CAL                    (0x0000FF00)        /*!< Internal High Speed 14MHz clock Calibration */
#define  RCC_CR2_HSI48ON                     (0x00010000)        /*!< Internal High Speed 48MHz clock enable */
#define  RCC_CR2_HSI48RDY                    (0x00020000)        /*!< Internal High Speed 48MHz clock ready flag */
#define  RCC_CR2_HSI48CAL                    (0xFF000000)        /*!< Internal High Speed 48MHz clock Calibration */

#define RTC_TR_PM                            (0x00400000)
#define RTC_TR_HT                            (0x00300000)        
#define RTC_TR_HT_0                          (0x00100000)        
#define RTC_TR_HT_1                          (0x00200000)        
#define RTC_TR_HU                            (0x000F0000)        
#define RTC_TR_HU_0                          (0x00010000)        
#define RTC_TR_HU_1                          (0x00020000)        
#define RTC_TR_HU_2                          (0x00040000)        
#define RTC_TR_HU_3                          (0x00080000)        
#define RTC_TR_MNT                           (0x00007000)        
#define RTC_TR_MNT_0                         (0x00001000)        
#define RTC_TR_MNT_1                         (0x00002000)        
#define RTC_TR_MNT_2                         (0x00004000)        
#define RTC_TR_MNU                           (0x00000F00)        
#define RTC_TR_MNU_0                         (0x00000100)        
#define RTC_TR_MNU_1                         (0x00000200)        
#define RTC_TR_MNU_2                         (0x00000400)        
#define RTC_TR_MNU_3                         (0x00000800)        
#define RTC_TR_ST                            (0x00000070)        
#define RTC_TR_ST_0                          (0x00000010)        
#define RTC_TR_ST_1                          (0x00000020)        
#define RTC_TR_ST_2                          (0x00000040)        
#define RTC_TR_SU                            (0x0000000F)        
#define RTC_TR_SU_0                          (0x00000001)        
#define RTC_TR_SU_1                          (0x00000002)        
#define RTC_TR_SU_2                          (0x00000004)        
#define RTC_TR_SU_3                          (0x00000008)        

#define RTC_DR_YT                            (0x00F00000)        
#define RTC_DR_YT_0                          (0x00100000)        
#define RTC_DR_YT_1                          (0x00200000)        
#define RTC_DR_YT_2                          (0x00400000)        
#define RTC_DR_YT_3                          (0x00800000)        
#define RTC_DR_YU                            (0x000F0000)        
#define RTC_DR_YU_0                          (0x00010000)        
#define RTC_DR_YU_1                          (0x00020000)        
#define RTC_DR_YU_2                          (0x00040000)        
#define RTC_DR_YU_3                          (0x00080000)        
#define RTC_DR_WDU                           (0x0000E000)        
#define RTC_DR_WDU_0                         (0x00002000)        
#define RTC_DR_WDU_1                         (0x00004000)        
#define RTC_DR_WDU_2                         (0x00008000)        
#define RTC_DR_MT                            (0x00001000)        
#define RTC_DR_MU                            (0x00000F00)        
#define RTC_DR_MU_0                          (0x00000100)        
#define RTC_DR_MU_1                          (0x00000200)        
#define RTC_DR_MU_2                          (0x00000400)        
#define RTC_DR_MU_3                          (0x00000800)        
#define RTC_DR_DT                            (0x00000030)        
#define RTC_DR_DT_0                          (0x00000010)        
#define RTC_DR_DT_1                          (0x00000020)        
#define RTC_DR_DU                            (0x0000000F)        
#define RTC_DR_DU_0                          (0x00000001)        
#define RTC_DR_DU_1                          (0x00000002)        
#define RTC_DR_DU_2                          (0x00000004)        
#define RTC_DR_DU_3                          (0x00000008)        

#define RTC_CR_COE                           (0x00800000)        
#define RTC_CR_OSEL                          (0x00600000)        
#define RTC_CR_OSEL_0                        (0x00200000)        
#define RTC_CR_OSEL_1                        (0x00400000)        
#define RTC_CR_POL                           (0x00100000)        
#define RTC_CR_COSEL                         (0x00080000)        
#define RTC_CR_BKP                           (0x00040000)        
#define RTC_CR_SUB1H                         (0x00020000)        
#define RTC_CR_ADD1H                         (0x00010000)        
#define RTC_CR_TSIE                          (0x00008000)        
#define RTC_CR_WUTIE                         (0x00004000)
#define RTC_CR_ALRAIE                        (0x00001000)        
#define RTC_CR_TSE                           (0x00000800)        
#define RTC_CR_WUTE                          (0x00000400)        
#define RTC_CR_ALRAE                         (0x00000100)        
#define RTC_CR_FMT                           (0x00000040)        
#define RTC_CR_BYPSHAD                       (0x00000020)        
#define RTC_CR_REFCKON                       (0x00000010)        
#define RTC_CR_TSEDGE                        (0x00000008)        
#define RTC_CR_WUCKSEL                       (0x00000007)        
#define RTC_CR_WUCKSEL_0                     (0x00000001)        
#define RTC_CR_WUCKSEL_1                     (0x00000002)        
#define RTC_CR_WUCKSEL_2                     (0x00000004)        

