the-nw1-group/acb-modules/acb-common/include/stm32f0xx.inc
#define RTC_CR_BCK                           RTC_CR_BKP
#define RTC_CR_CALSEL                        RTC_CR_COSEL

#define RTC_ISR_RECALPF                      (0x00010000)        
#define RTC_ISR_TAMP3F                       (0x00008000)        
#define RTC_ISR_TAMP2F                       (0x00004000)        
#define RTC_ISR_TAMP1F                       (0x00002000)        
#define RTC_ISR_TSOVF                        (0x00001000)        
#define RTC_ISR_TSF                          (0x00000800)        
#define RTC_ISR_WUTF                         (0x00000400)        
#define RTC_ISR_ALRAF                        (0x00000100)        
#define RTC_ISR_INIT                         (0x00000080)        
#define RTC_ISR_INITF                        (0x00000040)        
#define RTC_ISR_RSF                          (0x00000020)        
#define RTC_ISR_INITS                        (0x00000010)        
#define RTC_ISR_SHPF                         (0x00000008)        
#define RTC_ISR_WUTWF                        (0x00000004)        
#define RTC_ISR_ALRAWF                       (0x00000001)        

#define RTC_PRER_PREDIV_A                    (0x007F0000)        
#define RTC_PRER_PREDIV_S                    (0x00007FFF)        

#define RTC_WUTR_WUT                         (0x0000FFFF)

#define RTC_ALRMAR_MSK4                      (0x80000000)        
#define RTC_ALRMAR_WDSEL                     (0x40000000)        
#define RTC_ALRMAR_DT                        (0x30000000)        
#define RTC_ALRMAR_DT_0                      (0x10000000)        
#define RTC_ALRMAR_DT_1                      (0x20000000)        
#define RTC_ALRMAR_DU                        (0x0F000000)        
#define RTC_ALRMAR_DU_0                      (0x01000000)        
#define RTC_ALRMAR_DU_1                      (0x02000000)        
#define RTC_ALRMAR_DU_2                      (0x04000000)        
#define RTC_ALRMAR_DU_3                      (0x08000000)        
#define RTC_ALRMAR_MSK3                      (0x00800000)        
#define RTC_ALRMAR_PM                        (0x00400000)        
#define RTC_ALRMAR_HT                        (0x00300000)        
#define RTC_ALRMAR_HT_0                      (0x00100000)        
#define RTC_ALRMAR_HT_1                      (0x00200000)        
#define RTC_ALRMAR_HU                        (0x000F0000)        
#define RTC_ALRMAR_HU_0                      (0x00010000)        
#define RTC_ALRMAR_HU_1                      (0x00020000)        
#define RTC_ALRMAR_HU_2                      (0x00040000)        
#define RTC_ALRMAR_HU_3                      (0x00080000)        
#define RTC_ALRMAR_MSK2                      (0x00008000)        
#define RTC_ALRMAR_MNT                       (0x00007000)        
#define RTC_ALRMAR_MNT_0                     (0x00001000)        
#define RTC_ALRMAR_MNT_1                     (0x00002000)        
#define RTC_ALRMAR_MNT_2                     (0x00004000)        
#define RTC_ALRMAR_MNU                       (0x00000F00)        
#define RTC_ALRMAR_MNU_0                     (0x00000100)        
#define RTC_ALRMAR_MNU_1                     (0x00000200)        
#define RTC_ALRMAR_MNU_2                     (0x00000400)        
#define RTC_ALRMAR_MNU_3                     (0x00000800)        
#define RTC_ALRMAR_MSK1                      (0x00000080)        
#define RTC_ALRMAR_ST                        (0x00000070)        
#define RTC_ALRMAR_ST_0                      (0x00000010)        
#define RTC_ALRMAR_ST_1                      (0x00000020)        
#define RTC_ALRMAR_ST_2                      (0x00000040)        
#define RTC_ALRMAR_SU                        (0x0000000F)        
#define RTC_ALRMAR_SU_0                      (0x00000001)        
#define RTC_ALRMAR_SU_1                      (0x00000002)        
#define RTC_ALRMAR_SU_2                      (0x00000004)        
#define RTC_ALRMAR_SU_3                      (0x00000008)        

#define RTC_WPR_KEY                          (0x000000FF)        

#define RTC_SSR_SS                           (0x0003FFFF)        

#define RTC_SHIFTR_SUBFS                     (0x00007FFF)        
#define RTC_SHIFTR_ADD1S                     (0x80000000)        

#define RTC_TSTR_PM                          (0x00400000)        
#define RTC_TSTR_HT                          (0x00300000)        
#define RTC_TSTR_HT_0                        (0x00100000)        
#define RTC_TSTR_HT_1                        (0x00200000)        
#define RTC_TSTR_HU                          (0x000F0000)        
#define RTC_TSTR_HU_0                        (0x00010000)        
#define RTC_TSTR_HU_1                        (0x00020000)        
#define RTC_TSTR_HU_2                        (0x00040000)        
#define RTC_TSTR_HU_3                        (0x00080000)        
#define RTC_TSTR_MNT                         (0x00007000)        
#define RTC_TSTR_MNT_0                       (0x00001000)        
#define RTC_TSTR_MNT_1                       (0x00002000)        
#define RTC_TSTR_MNT_2                       (0x00004000)        
#define RTC_TSTR_MNU                         (0x00000F00)        
#define RTC_TSTR_MNU_0                       (0x00000100)        
#define RTC_TSTR_MNU_1                       (0x00000200)        
#define RTC_TSTR_MNU_2                       (0x00000400)        
#define RTC_TSTR_MNU_3                       (0x00000800)        
#define RTC_TSTR_ST                          (0x00000070)        
#define RTC_TSTR_ST_0                        (0x00000010)        
#define RTC_TSTR_ST_1                        (0x00000020)        
#define RTC_TSTR_ST_2                        (0x00000040)        
#define RTC_TSTR_SU                          (0x0000000F)        
#define RTC_TSTR_SU_0                        (0x00000001)        
#define RTC_TSTR_SU_1                        (0x00000002)        
#define RTC_TSTR_SU_2                        (0x00000004)        
#define RTC_TSTR_SU_3                        (0x00000008)        

#define RTC_TSDR_WDU                         (0x0000E000)        
#define RTC_TSDR_WDU_0                       (0x00002000)        
#define RTC_TSDR_WDU_1                       (0x00004000)        
#define RTC_TSDR_WDU_2                       (0x00008000)        
#define RTC_TSDR_MT                          (0x00001000)        
#define RTC_TSDR_MU                          (0x00000F00)        
#define RTC_TSDR_MU_0                        (0x00000100)        
#define RTC_TSDR_MU_1                        (0x00000200)        
#define RTC_TSDR_MU_2                        (0x00000400)        
#define RTC_TSDR_MU_3                        (0x00000800)        
#define RTC_TSDR_DT                          (0x00000030)        
#define RTC_TSDR_DT_0                        (0x00000010)        
#define RTC_TSDR_DT_1                        (0x00000020)        
#define RTC_TSDR_DU                          (0x0000000F)        
#define RTC_TSDR_DU_0                        (0x00000001)        
#define RTC_TSDR_DU_1                        (0x00000002)        
#define RTC_TSDR_DU_2                        (0x00000004)        
#define RTC_TSDR_DU_3                        (0x00000008)        

#define RTC_TSSSR_SS                         (0x0003FFFF)

#define RTC_CALR_CALP                         (0x00008000)        
#define RTC_CALR_CALW8                        (0x00004000)        
#define RTC_CALR_CALW16                       (0x00002000)        
#define RTC_CALR_CALM                         (0x000001FF)        
#define RTC_CALR_CALM_0                       (0x00000001)        
#define RTC_CALR_CALM_1                       (0x00000002)        
#define RTC_CALR_CALM_2                       (0x00000004)        
#define RTC_CALR_CALM_3                       (0x00000008)        
#define RTC_CALR_CALM_4                       (0x00000010)        
#define RTC_CALR_CALM_5                       (0x00000020)        
#define RTC_CALR_CALM_6                       (0x00000040)        
#define RTC_CALR_CALM_7                       (0x00000080)        
#define RTC_CALR_CALM_8                       (0x00000100)

#define RTC_CAL_CALP                         RTC_CALR_CALP  
#define RTC_CAL_CALW8                        RTC_CALR_CALW8 
#define RTC_CAL_CALW16                       RTC_CALR_CALW16
#define RTC_CAL_CALM                         RTC_CALR_CALM  
#define RTC_CAL_CALM_0                       RTC_CALR_CALM_0
#define RTC_CAL_CALM_1                       RTC_CALR_CALM_1
#define RTC_CAL_CALM_2                       RTC_CALR_CALM_2
#define RTC_CAL_CALM_3                       RTC_CALR_CALM_3
#define RTC_CAL_CALM_4                       RTC_CALR_CALM_4
#define RTC_CAL_CALM_5                       RTC_CALR_CALM_5
#define RTC_CAL_CALM_6                       RTC_CALR_CALM_6
#define RTC_CAL_CALM_7                       RTC_CALR_CALM_7
#define RTC_CAL_CALM_8                       RTC_CALR_CALM_8

