the-nw1-group/acb-modules/acb-common/include/stm32f0xx.inc
#define  SPI_CRCPR_CRCPOLY                   (0xFFFF)            /*!< CRC polynomial register */

#define  SPI_RXCRCR_RXCRC                    (0xFFFF)            /*!< Rx CRC Register */

#define  SPI_TXCRCR_TXCRC                    (0xFFFF)            /*!< Tx CRC Register */

#define  SPI_I2SCFGR_CHLEN                   (0x0001)            /*!<Channel length (number of bits per audio channel) */
#define  SPI_I2SCFGR_DATLEN                  (0x0006)            /*!<DATLEN[1:0] bits (Data length to be transferred) */
#define  SPI_I2SCFGR_DATLEN_0                (0x0002)            /*!<Bit 0 */
#define  SPI_I2SCFGR_DATLEN_1                (0x0004)            /*!<Bit 1 */
#define  SPI_I2SCFGR_CKPOL                   (0x0008)            /*!<steady state clock polarity */
#define  SPI_I2SCFGR_I2SSTD                  (0x0030)            /*!<I2SSTD[1:0] bits (I2S standard selection) */
#define  SPI_I2SCFGR_I2SSTD_0                (0x0010)            /*!<Bit 0 */
#define  SPI_I2SCFGR_I2SSTD_1                (0x0020)            /*!<Bit 1 */
#define  SPI_I2SCFGR_PCMSYNC                 (0x0080)            /*!<PCM frame synchronization */
#define  SPI_I2SCFGR_I2SCFG                  (0x0300)            /*!<I2SCFG[1:0] bits (I2S configuration mode) */
#define  SPI_I2SCFGR_I2SCFG_0                (0x0100)            /*!<Bit 0 */
#define  SPI_I2SCFGR_I2SCFG_1                (0x0200)            /*!<Bit 1 */
#define  SPI_I2SCFGR_I2SE                    (0x0400)            /*!<I2S Enable */
#define  SPI_I2SCFGR_I2SMOD                  (0x0800)            /*!<I2S mode selection */

#define  SPI_I2SPR_I2SDIV                    (0x00FF)            /*!<I2S Linear prescaler */
#define  SPI_I2SPR_ODD                       (0x0100)            /*!<Odd factor for the prescaler */
#define  SPI_I2SPR_MCKOE                     (0x0200)            /*!<Master Clock Output Enable */

#define SYSCFG_CFGR1_MEM_MODE               (0x00000003) /*!< SYSCFG_Memory Remap Config */
#define SYSCFG_CFGR1_MEM_MODE_0             (0x00000001) /*!< SYSCFG_Memory Remap Config Bit 0 */
#define SYSCFG_CFGR1_MEM_MODE_1             (0x00000002) /*!< SYSCFG_Memory Remap Config Bit 1 */
#define SYSCFG_CFGR1_PA11_PA12_RMP          (0x00000010) /*!< PA11 and PA12 remap on QFN28 and TSSOP20 packages (only for STM32F042 devices)*/
#define SYSCFG_CFGR1_ADC_DMA_RMP            (0x00000100) /*!< ADC DMA remap */
#define SYSCFG_CFGR1_USART1TX_DMA_RMP       (0x00000200) /*!< USART1 TX DMA remap */
#define SYSCFG_CFGR1_USART1RX_DMA_RMP       (0x00000400) /*!< USART1 RX DMA remap */
#define SYSCFG_CFGR1_TIM16_DMA_RMP          (0x00000800) /*!< Timer 16 DMA remap */
#define SYSCFG_CFGR1_TIM17_DMA_RMP          (0x00001000) /*!< Timer 17 DMA remap */
#define SYSCFG_CFGR1_TIM16_DMA_RMP2         (0x00002000) /*!< Timer 16 DMA remap 2 (only for STM32F072) */
#define SYSCFG_CFGR1_TIM17_DMA_RMP2         (0x00004000) /*!< Timer 17 DMA remap 2 (only for STM32F072) */
#define SYSCFG_CFGR1_I2C_FMP_PB6            (0x00010000) /*!< I2C PB6 Fast mode plus */
#define SYSCFG_CFGR1_I2C_FMP_PB7            (0x00020000) /*!< I2C PB7 Fast mode plus */
#define SYSCFG_CFGR1_I2C_FMP_PB8            (0x00040000) /*!< I2C PB8 Fast mode plus */
#define SYSCFG_CFGR1_I2C_FMP_PB9            (0x00080000) /*!< I2C PB9 Fast mode plus */
#define SYSCFG_CFGR1_I2C_FMP_I2C1           (0x00100000) /*!< Enable Fast Mode Plus on PB10, PB11, PF6 and PF7(only for STM32F030, STM32F031 and STM32F072 devices) */
#define SYSCFG_CFGR1_I2C_FMP_I2C2           (0x00200000) /*!< Enable I2C2 Fast mode plus (only for STM32F072) */
#define SYSCFG_CFGR1_I2C_FMP_PA9            (0x00400000) /*!< Enable Fast Mode Plus on PA9 (only for STM32F030, STM32F031, STM32F042 and STM32F072 devices) */
#define SYSCFG_CFGR1_I2C_FMP_PA10           (0x00800000) /*!< Enable Fast Mode Plus on PA10(only for STM32F030, STM32F031, STM32F042 and STM32F072 devices) */
#define SYSCFG_CFGR1_SPI2_DMA_RMP           (0x01000000) /*!< SPI2 DMA remap (only for STM32F072) */
#define SYSCFG_CFGR1_USART2_DMA_RMP         (0x02000000) /*!< USART2 DMA remap (only for STM32F072) */
#define SYSCFG_CFGR1_USART3_DMA_RMP         (0x04000000) /*!< USART3 DMA remap (only for STM32F072) */
#define SYSCFG_CFGR1_I2C1_DMA_RMP           (0x08000000) /*!< I2C1 DMA remap (only for STM32F072) */
#define SYSCFG_CFGR1_TIM1_DMA_RMP           (0x10000000) /*!< TIM1 DMA remap (only for STM32F072) */
#define SYSCFG_CFGR1_TIM2_DMA_RMP           (0x20000000) /*!< TIM2 DMA remap (only for STM32F072) */
#define SYSCFG_CFGR1_TIM3_DMA_RMP           (0x40000000) /*!< TIM3 DMA remap (only for STM32F072) */

#define SYSCFG_EXTICR1_EXTI0            (0x000F) /*!< EXTI 0 configuration */
#define SYSCFG_EXTICR1_EXTI1            (0x00F0) /*!< EXTI 1 configuration */
#define SYSCFG_EXTICR1_EXTI2            (0x0F00) /*!< EXTI 2 configuration */
#define SYSCFG_EXTICR1_EXTI3            (0xF000) /*!< EXTI 3 configuration */

/** 
  * @brief  EXTI0 configuration  
  */
#define SYSCFG_EXTICR1_EXTI0_PA         (0x0000) /*!< PA[0] pin */
#define SYSCFG_EXTICR1_EXTI0_PB         (0x0001) /*!< PB[0] pin */
#define SYSCFG_EXTICR1_EXTI0_PC         (0x0002) /*!< PC[0] pin */
#define SYSCFG_EXTICR1_EXTI0_PD         (0x0003) /*!< PD[0] pin */
#define SYSCFG_EXTICR1_EXTI0_PE         (0x0004) /*!< PE[0] pin */
#define SYSCFG_EXTICR1_EXTI0_PF         (0x0005) /*!< PF[0] pin */

/** 
  * @brief  EXTI1 configuration  
  */ 
#define SYSCFG_EXTICR1_EXTI1_PA         (0x0000) /*!< PA[1] pin */
#define SYSCFG_EXTICR1_EXTI1_PB         (0x0010) /*!< PB[1] pin */
#define SYSCFG_EXTICR1_EXTI1_PC         (0x0020) /*!< PC[1] pin */
#define SYSCFG_EXTICR1_EXTI1_PD         (0x0030) /*!< PD[1] pin */
#define SYSCFG_EXTICR1_EXTI1_PE         (0x0040) /*!< PE[1] pin */
#define SYSCFG_EXTICR1_EXTI1_PF         (0x0050) /*!< PF[1] pin */

/** 
  * @brief  EXTI2 configuration  
  */
#define SYSCFG_EXTICR1_EXTI2_PA         (0x0000) /*!< PA[2] pin */
#define SYSCFG_EXTICR1_EXTI2_PB         (0x0100) /*!< PB[2] pin */
#define SYSCFG_EXTICR1_EXTI2_PC         (0x0200) /*!< PC[2] pin */
#define SYSCFG_EXTICR1_EXTI2_PD         (0x0300) /*!< PD[2] pin */
#define SYSCFG_EXTICR1_EXTI2_PE         (0x0400) /*!< PE[2] pin */
#define SYSCFG_EXTICR1_EXTI2_PF         (0x0500) /*!< PF[2] pin */

/** 
  * @brief  EXTI3 configuration  
  */
#define SYSCFG_EXTICR1_EXTI3_PA         (0x0000) /*!< PA[3] pin */
#define SYSCFG_EXTICR1_EXTI3_PB         (0x1000) /*!< PB[3] pin */
#define SYSCFG_EXTICR1_EXTI3_PC         (0x2000) /*!< PC[3] pin */
#define SYSCFG_EXTICR1_EXTI3_PD         (0x3000) /*!< PD[3] pin */
#define SYSCFG_EXTICR1_EXTI3_PE         (0x4000) /*!< PE[3] pin */
#define SYSCFG_EXTICR1_EXTI3_PF         (0x5000) /*!< PF[3] pin */

#define SYSCFG_EXTICR2_EXTI4            (0x000F) /*!< EXTI 4 configuration */
#define SYSCFG_EXTICR2_EXTI5            (0x00F0) /*!< EXTI 5 configuration */
#define SYSCFG_EXTICR2_EXTI6            (0x0F00) /*!< EXTI 6 configuration */
#define SYSCFG_EXTICR2_EXTI7            (0xF000) /*!< EXTI 7 configuration */

/** 
  * @brief  EXTI4 configuration  
  */
#define SYSCFG_EXTICR2_EXTI4_PA         (0x0000) /*!< PA[4] pin */
#define SYSCFG_EXTICR2_EXTI4_PB         (0x0001) /*!< PB[4] pin */
#define SYSCFG_EXTICR2_EXTI4_PC         (0x0002) /*!< PC[4] pin */
#define SYSCFG_EXTICR2_EXTI4_PD         (0x0003) /*!< PD[4] pin */
#define SYSCFG_EXTICR2_EXTI4_PE         (0x0004) /*!< PE[4] pin */
#define SYSCFG_EXTICR2_EXTI4_PF         (0x0005) /*!< PF[4] pin */

/** 
  * @brief  EXTI5 configuration  
  */
#define SYSCFG_EXTICR2_EXTI5_PA         (0x0000) /*!< PA[5] pin */
#define SYSCFG_EXTICR2_EXTI5_PB         (0x0010) /*!< PB[5] pin */
#define SYSCFG_EXTICR2_EXTI5_PC         (0x0020) /*!< PC[5] pin */
#define SYSCFG_EXTICR2_EXTI5_PD         (0x0030) /*!< PD[5] pin */
#define SYSCFG_EXTICR2_EXTI5_PE         (0x0040) /*!< PE[5] pin */
#define SYSCFG_EXTICR2_EXTI5_PF         (0x0050) /*!< PF[5] pin */

/** 
  * @brief  EXTI6 configuration  
  */
#define SYSCFG_EXTICR2_EXTI6_PA         (0x0000) /*!< PA[6] pin */
#define SYSCFG_EXTICR2_EXTI6_PB         (0x0100) /*!< PB[6] pin */
#define SYSCFG_EXTICR2_EXTI6_PC         (0x0200) /*!< PC[6] pin */
#define SYSCFG_EXTICR2_EXTI6_PD         (0x0300) /*!< PD[6] pin */
#define SYSCFG_EXTICR2_EXTI6_PE         (0x0400) /*!< PE[6] pin */
#define SYSCFG_EXTICR2_EXTI6_PF         (0x0500) /*!< PF[6] pin */

/** 
  * @brief  EXTI7 configuration  
  */
#define SYSCFG_EXTICR2_EXTI7_PA         (0x0000) /*!< PA[7] pin */
#define SYSCFG_EXTICR2_EXTI7_PB         (0x1000) /*!< PB[7] pin */
#define SYSCFG_EXTICR2_EXTI7_PC         (0x2000) /*!< PC[7] pin */
#define SYSCFG_EXTICR2_EXTI7_PD         (0x3000) /*!< PD[7] pin */
#define SYSCFG_EXTICR2_EXTI7_PE         (0x4000) /*!< PE[7] pin */
#define SYSCFG_EXTICR2_EXTI7_PF         (0x5000) /*!< PF[7] pin */

#define SYSCFG_EXTICR3_EXTI8            (0x000F) /*!< EXTI 8 configuration */
#define SYSCFG_EXTICR3_EXTI9            (0x00F0) /*!< EXTI 9 configuration */
#define SYSCFG_EXTICR3_EXTI10           (0x0F00) /*!< EXTI 10 configuration */
#define SYSCFG_EXTICR3_EXTI11           (0xF000) /*!< EXTI 11 configuration */

/** 
  * @brief  EXTI8 configuration  
  */
#define SYSCFG_EXTICR3_EXTI8_PA         (0x0000) /*!< PA[8] pin */
#define SYSCFG_EXTICR3_EXTI8_PB         (0x0001) /*!< PB[8] pin */
#define SYSCFG_EXTICR3_EXTI8_PC         (0x0002) /*!< PC[8] pin */
#define SYSCFG_EXTICR3_EXTI8_PD         (0x0003) /*!< PD[8] pin */
#define SYSCFG_EXTICR3_EXTI8_PE         (0x0004) /*!< PE[8] pin */

/** 
  * @brief  EXTI9 configuration  
  */
#define SYSCFG_EXTICR3_EXTI9_PA         (0x0000) /*!< PA[9] pin */
#define SYSCFG_EXTICR3_EXTI9_PB         (0x0010) /*!< PB[9] pin */
#define SYSCFG_EXTICR3_EXTI9_PC         (0x0020) /*!< PC[9] pin */
#define SYSCFG_EXTICR3_EXTI9_PD         (0x0030) /*!< PD[9] pin */
#define SYSCFG_EXTICR3_EXTI9_PE         (0x0040) /*!< PE[9] pin */
#define SYSCFG_EXTICR3_EXTI9_PF         (0x0050) /*!< PF[9] pin */

/** 
  * @brief  EXTI10 configuration  
  */
#define SYSCFG_EXTICR3_EXTI10_PA        (0x0000) /*!< PA[10] pin */
#define SYSCFG_EXTICR3_EXTI10_PB        (0x0100) /*!< PB[10] pin */
#define SYSCFG_EXTICR3_EXTI10_PC        (0x0200) /*!< PC[10] pin */
#define SYSCFG_EXTICR3_EXTI10_PD        (0x0300) /*!< PE[10] pin */
#define SYSCFG_EXTICR3_EXTI10_PE        (0x0400) /*!< PD[10] pin */
#define SYSCFG_EXTICR3_EXTI10_PF        (0x0500) /*!< PF[10] pin */

/** 
  * @brief  EXTI11 configuration  
  */
#define SYSCFG_EXTICR3_EXTI11_PA        (0x0000) /*!< PA[11] pin */
#define SYSCFG_EXTICR3_EXTI11_PB        (0x1000) /*!< PB[11] pin */
#define SYSCFG_EXTICR3_EXTI11_PC        (0x2000) /*!< PC[11] pin */
#define SYSCFG_EXTICR3_EXTI11_PD        (0x3000) /*!< PD[11] pin */
#define SYSCFG_EXTICR3_EXTI11_PE        (0x4000) /*!< PE[11] pin */

#define SYSCFG_EXTICR4_EXTI12           (0x000F) /*!< EXTI 12 configuration */
#define SYSCFG_EXTICR4_EXTI13           (0x00F0) /*!< EXTI 13 configuration */
#define SYSCFG_EXTICR4_EXTI14           (0x0F00) /*!< EXTI 14 configuration */
#define SYSCFG_EXTICR4_EXTI15           (0xF000) /*!< EXTI 15 configuration */

/** 
  * @brief  EXTI12 configuration  
  */
#define SYSCFG_EXTICR4_EXTI12_PA        (0x0000) /*!< PA[12] pin */
#define SYSCFG_EXTICR4_EXTI12_PB        (0x0001) /*!< PB[12] pin */
#define SYSCFG_EXTICR4_EXTI12_PC        (0x0002) /*!< PC[12] pin */
#define SYSCFG_EXTICR4_EXTI12_PD        (0x0003) /*!< PD[12] pin */
#define SYSCFG_EXTICR4_EXTI12_PE        (0x0004) /*!< PE[12] pin */

/** 
  * @brief  EXTI13 configuration  
  */
#define SYSCFG_EXTICR4_EXTI13_PA        (0x0000) /*!< PA[13] pin */
#define SYSCFG_EXTICR4_EXTI13_PB        (0x0010) /*!< PB[13] pin */
#define SYSCFG_EXTICR4_EXTI13_PC        (0x0020) /*!< PC[13] pin */
#define SYSCFG_EXTICR4_EXTI13_PD        (0x0030) /*!< PD[13] pin */
#define SYSCFG_EXTICR4_EXTI13_PE        (0x0040) /*!< PE[13] pin */

/** 
  * @brief  EXTI14 configuration  
  */
#define SYSCFG_EXTICR4_EXTI14_PA        (0x0000) /*!< PA[14] pin */
#define SYSCFG_EXTICR4_EXTI14_PB        (0x0100) /*!< PB[14] pin */
#define SYSCFG_EXTICR4_EXTI14_PC        (0x0200) /*!< PC[14] pin */
#define SYSCFG_EXTICR4_EXTI14_PD        (0x0300) /*!< PD[14] pin */
#define SYSCFG_EXTICR4_EXTI14_PE        (0x0400) /*!< PE[14] pin */

/** 
  * @brief  EXTI15 configuration  
  */
#define SYSCFG_EXTICR4_EXTI15_PA        (0x0000) /*!< PA[15] pin */
#define SYSCFG_EXTICR4_EXTI15_PB        (0x1000) /*!< PB[15] pin */
#define SYSCFG_EXTICR4_EXTI15_PC        (0x2000) /*!< PC[15] pin */
#define SYSCFG_EXTICR4_EXTI15_PD        (0x3000) /*!< PD[15] pin */
#define SYSCFG_EXTICR4_EXTI15_PE        (0x4000) /*!< PE[15] pin */

#define SYSCFG_CFGR2_LOCKUP_LOCK               (0x00000001) /*!< Enables and locks the PVD connection with Timer1 Break Input and also the PVD_EN and PVDSEL[2:0] bits of the Power Control Interface */
#define SYSCFG_CFGR2_SRAM_PARITY_LOCK          (0x00000002) /*!< Enables and locks the SRAM_PARITY error signal with Break Input of TIMER1 */
#define SYSCFG_CFGR2_PVD_LOCK                  (0x00000004) /*!< Enables and locks the LOCKUP (Hardfault) output of CortexM0 with Break Input of TIMER1 */
#define SYSCFG_CFGR2_SRAM_PEF                  (0x00000100) /*!< SRAM Parity error flag */

#define SYSCFG_CFGR2_SRAM_PE                   SYSCFG_CFGR2_SRAM_PEF
#define  TIM_CR1_CEN                         (0x0001)            /*!<Counter enable */
#define  TIM_CR1_UDIS                        (0x0002)            /*!<Update disable */
#define  TIM_CR1_URS                         (0x0004)            /*!<Update request source */
#define  TIM_CR1_OPM                         (0x0008)            /*!<One pulse mode */
#define  TIM_CR1_DIR                         (0x0010)            /*!<Direction */

#define  TIM_CR1_CMS                         (0x0060)            /*!<CMS[1:0] bits (Center-aligned mode selection) */
#define  TIM_CR1_CMS_0                       (0x0020)            /*!<Bit 0 */
#define  TIM_CR1_CMS_1                       (0x0040)            /*!<Bit 1 */

#define  TIM_CR1_ARPE                        (0x0080)            /*!<Auto-reload preload enable */

#define  TIM_CR1_CKD                         (0x0300)            /*!<CKD[1:0] bits (clock division) */
#define  TIM_CR1_CKD_0                       (0x0100)            /*!<Bit 0 */
#define  TIM_CR1_CKD_1                       (0x0200)            /*!<Bit 1 */

#define  TIM_CR2_CCPC                        (0x0001)            /*!<Capture/Compare Preloaded Control */
#define  TIM_CR2_CCUS                        (0x0004)            /*!<Capture/Compare Control Update Selection */
#define  TIM_CR2_CCDS                        (0x0008)            /*!<Capture/Compare DMA Selection */

