the-nw1-group/acb-modules/acb-common/include/stm32f0xx.inc
#define  TIM_CR2_MMS                         (0x0070)            /*!<MMS[2:0] bits (Master Mode Selection) */
#define  TIM_CR2_MMS_0                       (0x0010)            /*!<Bit 0 */
#define  TIM_CR2_MMS_1                       (0x0020)            /*!<Bit 1 */
#define  TIM_CR2_MMS_2                       (0x0040)            /*!<Bit 2 */

#define  TIM_CR2_TI1S                        (0x0080)            /*!<TI1 Selection */
#define  TIM_CR2_OIS1                        (0x0100)            /*!<Output Idle state 1 (OC1 output) */
#define  TIM_CR2_OIS1N                       (0x0200)            /*!<Output Idle state 1 (OC1N output) */
#define  TIM_CR2_OIS2                        (0x0400)            /*!<Output Idle state 2 (OC2 output) */
#define  TIM_CR2_OIS2N                       (0x0800)            /*!<Output Idle state 2 (OC2N output) */
#define  TIM_CR2_OIS3                        (0x1000)            /*!<Output Idle state 3 (OC3 output) */
#define  TIM_CR2_OIS3N                       (0x2000)            /*!<Output Idle state 3 (OC3N output) */
#define  TIM_CR2_OIS4                        (0x4000)            /*!<Output Idle state 4 (OC4 output) */

#define  TIM_SMCR_SMS                        (0x0007)            /*!<SMS[2:0] bits (Slave mode selection) */
#define  TIM_SMCR_SMS_0                      (0x0001)            /*!<Bit 0 */
#define  TIM_SMCR_SMS_1                      (0x0002)            /*!<Bit 1 */
#define  TIM_SMCR_SMS_2                      (0x0004)            /*!<Bit 2 */

#define  TIM_SMCR_OCCS                       (0x0008)            /*!< OCREF clear selection */

#define  TIM_SMCR_TS                         (0x0070)            /*!<TS[2:0] bits (Trigger selection) */
#define  TIM_SMCR_TS_0                       (0x0010)            /*!<Bit 0 */
#define  TIM_SMCR_TS_1                       (0x0020)            /*!<Bit 1 */
#define  TIM_SMCR_TS_2                       (0x0040)            /*!<Bit 2 */

#define  TIM_SMCR_MSM                        (0x0080)            /*!<Master/slave mode */

#define  TIM_SMCR_ETF                        (0x0F00)            /*!<ETF[3:0] bits (External trigger filter) */
#define  TIM_SMCR_ETF_0                      (0x0100)            /*!<Bit 0 */
#define  TIM_SMCR_ETF_1                      (0x0200)            /*!<Bit 1 */
#define  TIM_SMCR_ETF_2                      (0x0400)            /*!<Bit 2 */
#define  TIM_SMCR_ETF_3                      (0x0800)            /*!<Bit 3 */

#define  TIM_SMCR_ETPS                       (0x3000)            /*!<ETPS[1:0] bits (External trigger prescaler) */
#define  TIM_SMCR_ETPS_0                     (0x1000)            /*!<Bit 0 */
#define  TIM_SMCR_ETPS_1                     (0x2000)            /*!<Bit 1 */

#define  TIM_SMCR_ECE                        (0x4000)            /*!<External clock enable */
#define  TIM_SMCR_ETP                        (0x8000)            /*!<External trigger polarity */

#define  TIM_DIER_UIE                        (0x0001)            /*!<Update interrupt enable */
#define  TIM_DIER_CC1IE                      (0x0002)            /*!<Capture/Compare 1 interrupt enable */
#define  TIM_DIER_CC2IE                      (0x0004)            /*!<Capture/Compare 2 interrupt enable */
#define  TIM_DIER_CC3IE                      (0x0008)            /*!<Capture/Compare 3 interrupt enable */
#define  TIM_DIER_CC4IE                      (0x0010)            /*!<Capture/Compare 4 interrupt enable */
#define  TIM_DIER_COMIE                      (0x0020)            /*!<COM interrupt enable */
#define  TIM_DIER_TIE                        (0x0040)            /*!<Trigger interrupt enable */
#define  TIM_DIER_BIE                        (0x0080)            /*!<Break interrupt enable */
#define  TIM_DIER_UDE                        (0x0100)            /*!<Update DMA request enable */
#define  TIM_DIER_CC1DE                      (0x0200)            /*!<Capture/Compare 1 DMA request enable */
#define  TIM_DIER_CC2DE                      (0x0400)            /*!<Capture/Compare 2 DMA request enable */
#define  TIM_DIER_CC3DE                      (0x0800)            /*!<Capture/Compare 3 DMA request enable */
#define  TIM_DIER_CC4DE                      (0x1000)            /*!<Capture/Compare 4 DMA request enable */
#define  TIM_DIER_COMDE                      (0x2000)            /*!<COM DMA request enable */
#define  TIM_DIER_TDE                        (0x4000)            /*!<Trigger DMA request enable */

#define  TIM_SR_UIF                          (0x0001)            /*!<Update interrupt Flag */
#define  TIM_SR_CC1IF                        (0x0002)            /*!<Capture/Compare 1 interrupt Flag */
#define  TIM_SR_CC2IF                        (0x0004)            /*!<Capture/Compare 2 interrupt Flag */
#define  TIM_SR_CC3IF                        (0x0008)            /*!<Capture/Compare 3 interrupt Flag */
#define  TIM_SR_CC4IF                        (0x0010)            /*!<Capture/Compare 4 interrupt Flag */
#define  TIM_SR_COMIF                        (0x0020)            /*!<COM interrupt Flag */
#define  TIM_SR_TIF                          (0x0040)            /*!<Trigger interrupt Flag */
#define  TIM_SR_BIF                          (0x0080)            /*!<Break interrupt Flag */
#define  TIM_SR_CC1OF                        (0x0200)            /*!<Capture/Compare 1 Overcapture Flag */
#define  TIM_SR_CC2OF                        (0x0400)            /*!<Capture/Compare 2 Overcapture Flag */
#define  TIM_SR_CC3OF                        (0x0800)            /*!<Capture/Compare 3 Overcapture Flag */
#define  TIM_SR_CC4OF                        (0x1000)            /*!<Capture/Compare 4 Overcapture Flag */

#define  TIM_EGR_UG                          (0x01)               /*!<Update Generation */
#define  TIM_EGR_CC1G                        (0x02)               /*!<Capture/Compare 1 Generation */
#define  TIM_EGR_CC2G                        (0x04)               /*!<Capture/Compare 2 Generation */
#define  TIM_EGR_CC3G                        (0x08)               /*!<Capture/Compare 3 Generation */
#define  TIM_EGR_CC4G                        (0x10)               /*!<Capture/Compare 4 Generation */
#define  TIM_EGR_COMG                        (0x20)               /*!<Capture/Compare Control Update Generation */
#define  TIM_EGR_TG                          (0x40)               /*!<Trigger Generation */
#define  TIM_EGR_BG                          (0x80)               /*!<Break Generation */

