the-nw1-group/acb-modules/acb-common/include/stm32f0xx.inc
#define  TIM_ARR_ARR                         (0xFFFF)            /*!<actual auto-reload Value */

#define  TIM_RCR_REP                         (0xFF)               /*!<Repetition Counter Value */

#define  TIM_CCR1_CCR1                       (0xFFFF)            /*!<Capture/Compare 1 Value */

#define  TIM_CCR2_CCR2                       (0xFFFF)            /*!<Capture/Compare 2 Value */

#define  TIM_CCR3_CCR3                       (0xFFFF)            /*!<Capture/Compare 3 Value */

#define  TIM_CCR4_CCR4                       (0xFFFF)            /*!<Capture/Compare 4 Value */

#define  TIM_BDTR_DTG                        (0x00FF)            /*!<DTG[0:7] bits (Dead-Time Generator set-up) */
#define  TIM_BDTR_DTG_0                      (0x0001)            /*!<Bit 0 */
#define  TIM_BDTR_DTG_1                      (0x0002)            /*!<Bit 1 */
#define  TIM_BDTR_DTG_2                      (0x0004)            /*!<Bit 2 */
#define  TIM_BDTR_DTG_3                      (0x0008)            /*!<Bit 3 */
#define  TIM_BDTR_DTG_4                      (0x0010)            /*!<Bit 4 */
#define  TIM_BDTR_DTG_5                      (0x0020)            /*!<Bit 5 */
#define  TIM_BDTR_DTG_6                      (0x0040)            /*!<Bit 6 */
#define  TIM_BDTR_DTG_7                      (0x0080)            /*!<Bit 7 */

#define  TIM_BDTR_LOCK                       (0x0300)            /*!<LOCK[1:0] bits (Lock Configuration) */
#define  TIM_BDTR_LOCK_0                     (0x0100)            /*!<Bit 0 */
#define  TIM_BDTR_LOCK_1                     (0x0200)            /*!<Bit 1 */

#define  TIM_BDTR_OSSI                       (0x0400)            /*!<Off-State Selection for Idle mode */
#define  TIM_BDTR_OSSR                       (0x0800)            /*!<Off-State Selection for Run mode */
#define  TIM_BDTR_BKE                        (0x1000)            /*!<Break enable */
#define  TIM_BDTR_BKP                        (0x2000)            /*!<Break Polarity */
#define  TIM_BDTR_AOE                        (0x4000)            /*!<Automatic Output enable */
#define  TIM_BDTR_MOE                        (0x8000)            /*!<Main Output enable */

#define  TIM_DCR_DBA                         (0x001F)            /*!<DBA[4:0] bits (DMA Base Address) */
#define  TIM_DCR_DBA_0                       (0x0001)            /*!<Bit 0 */
#define  TIM_DCR_DBA_1                       (0x0002)            /*!<Bit 1 */
#define  TIM_DCR_DBA_2                       (0x0004)            /*!<Bit 2 */
#define  TIM_DCR_DBA_3                       (0x0008)            /*!<Bit 3 */
#define  TIM_DCR_DBA_4                       (0x0010)            /*!<Bit 4 */

#define  TIM_DCR_DBL                         (0x1F00)            /*!<DBL[4:0] bits (DMA Burst Length) */
#define  TIM_DCR_DBL_0                       (0x0100)            /*!<Bit 0 */
#define  TIM_DCR_DBL_1                       (0x0200)            /*!<Bit 1 */
#define  TIM_DCR_DBL_2                       (0x0400)            /*!<Bit 2 */
#define  TIM_DCR_DBL_3                       (0x0800)            /*!<Bit 3 */
#define  TIM_DCR_DBL_4                       (0x1000)            /*!<Bit 4 */

#define  TIM_DMAR_DMAB                       (0xFFFF)            /*!<DMA register for burst accesses */

#define TIM14_OR_TI1_RMP                       (0x0003)            /*!<TI1_RMP[1:0] bits (TIM14 Input 4 remap) */
#define TIM14_OR_TI1_RMP_0                     (0x0001)            /*!<Bit 0 */
#define TIM14_OR_TI1_RMP_1                     (0x0002)            /*!<Bit 1 */


#define  USART_CR1_UE                        (0x00000001)            /*!< USART Enable */
#define  USART_CR1_UESM                      (0x00000002)            /*!< USART Enable in STOP Mode */
#define  USART_CR1_RE                        (0x00000004)            /*!< Receiver Enable */
#define  USART_CR1_TE                        (0x00000008)            /*!< Transmitter Enable */
#define  USART_CR1_IDLEIE                    (0x00000010)            /*!< IDLE Interrupt Enable */
#define  USART_CR1_RXNEIE                    (0x00000020)            /*!< RXNE Interrupt Enable */
#define  USART_CR1_TCIE                      (0x00000040)            /*!< Transmission Complete Interrupt Enable */
#define  USART_CR1_TXEIE                     (0x00000080)            /*!< TXE Interrupt Enable */
#define  USART_CR1_PEIE                      (0x00000100)            /*!< PE Interrupt Enable */
#define  USART_CR1_PS                        (0x00000200)            /*!< Parity Selection */
#define  USART_CR1_PCE                       (0x00000400)            /*!< Parity Control Enable */
#define  USART_CR1_WAKE                      (0x00000800)            /*!< Receiver Wakeup method */
#define  USART_CR1_M                         (0x00001000)            /*!< Word length */
#define  USART_CR1_MME                       (0x00002000)            /*!< Mute Mode Enable */
#define  USART_CR1_CMIE                      (0x00004000)            /*!< Character match interrupt enable */
#define  USART_CR1_OVER8                     (0x00008000)            /*!< Oversampling by 8-bit or 16-bit mode */
#define  USART_CR1_DEDT                      (0x001F0000)            /*!< DEDT[4:0] bits (Driver Enable Deassertion Time) */
#define  USART_CR1_DEDT_0                    (0x00010000)            /*!< Bit 0 */
#define  USART_CR1_DEDT_1                    (0x00020000)            /*!< Bit 1 */
#define  USART_CR1_DEDT_2                    (0x00040000)            /*!< Bit 2 */
#define  USART_CR1_DEDT_3                    (0x00080000)            /*!< Bit 3 */
#define  USART_CR1_DEDT_4                    (0x00100000)            /*!< Bit 4 */
#define  USART_CR1_DEAT                      (0x03E00000)            /*!< DEAT[4:0] bits (Driver Enable Assertion Time) */
#define  USART_CR1_DEAT_0                    (0x00200000)            /*!< Bit 0 */
#define  USART_CR1_DEAT_1                    (0x00400000)            /*!< Bit 1 */
#define  USART_CR1_DEAT_2                    (0x00800000)            /*!< Bit 2 */
#define  USART_CR1_DEAT_3                    (0x01000000)            /*!< Bit 3 */
#define  USART_CR1_DEAT_4                    (0x02000000)            /*!< Bit 4 */
#define  USART_CR1_RTOIE                     (0x04000000)            /*!< Receive Time Out interrupt enable */
#define  USART_CR1_EOBIE                     (0x08000000)            /*!< End of Block interrupt enable */

#define  USART_CR2_ADDM7                     (0x00000010)            /*!< 7-bit or 4-bit Address Detection */
#define  USART_CR2_LBDL                      (0x00000020)            /*!< LIN Break Detection Length */
#define  USART_CR2_LBDIE                     (0x00000040)            /*!< LIN Break Detection Interrupt Enable */
#define  USART_CR2_LBCL                      (0x00000100)            /*!< Last Bit Clock pulse */
#define  USART_CR2_CPHA                      (0x00000200)            /*!< Clock Phase */
#define  USART_CR2_CPOL                      (0x00000400)            /*!< Clock Polarity */
#define  USART_CR2_CLKEN                     (0x00000800)            /*!< Clock Enable */
#define  USART_CR2_STOP                      (0x00003000)            /*!< STOP[1:0] bits (STOP bits) */
#define  USART_CR2_STOP_0                    (0x00001000)            /*!< Bit 0 */
#define  USART_CR2_STOP_1                    (0x00002000)            /*!< Bit 1 */
#define  USART_CR2_LINEN                     (0x00004000)            /*!< LIN mode enable */
#define  USART_CR2_SWAP                      (0x00008000)            /*!< SWAP TX/RX pins */
#define  USART_CR2_RXINV                     (0x00010000)            /*!< RX pin active level inversion */
#define  USART_CR2_TXINV                     (0x00020000)            /*!< TX pin active level inversion */
#define  USART_CR2_DATAINV                   (0x00040000)            /*!< Binary data inversion */
#define  USART_CR2_MSBFIRST                  (0x00080000)            /*!< Most Significant Bit First */
#define  USART_CR2_ABREN                     (0x00100000)            /*!< Auto Baud-Rate Enable*/
#define  USART_CR2_ABRMODE                   (0x00600000)            /*!< ABRMOD[1:0] bits (Auto Baud-Rate Mode) */
#define  USART_CR2_ABRMODE_0                 (0x00200000)            /*!< Bit 0 */
#define  USART_CR2_ABRMODE_1                 (0x00400000)            /*!< Bit 1 */
#define  USART_CR2_RTOEN                     (0x00800000)            /*!< Receiver Time-Out enable */
#define  USART_CR2_ADD                       (0xFF000000)            /*!< Address of the USART node */

