the-nw1-group/acb-modules/acb-common/include/stm32f0xx.inc
#define  USART_CR3_EIE                       (0x00000001)            /*!< Error Interrupt Enable */
#define  USART_CR3_IREN                      (0x00000002)            /*!< IrDA mode Enable */
#define  USART_CR3_IRLP                      (0x00000004)            /*!< IrDA Low-Power */
#define  USART_CR3_HDSEL                     (0x00000008)            /*!< Half-Duplex Selection */
#define  USART_CR3_NACK                      (0x00000010)            /*!< SmartCard NACK enable */
#define  USART_CR3_SCEN                      (0x00000020)            /*!< SmartCard mode enable */
#define  USART_CR3_DMAR                      (0x00000040)            /*!< DMA Enable Receiver */
#define  USART_CR3_DMAT                      (0x00000080)            /*!< DMA Enable Transmitter */
#define  USART_CR3_RTSE                      (0x00000100)            /*!< RTS Enable */
#define  USART_CR3_CTSE                      (0x00000200)            /*!< CTS Enable */
#define  USART_CR3_CTSIE                     (0x00000400)            /*!< CTS Interrupt Enable */
#define  USART_CR3_ONEBIT                    (0x00000800)            /*!< One sample bit method enable */
#define  USART_CR3_OVRDIS                    (0x00001000)            /*!< Overrun Disable */
#define  USART_CR3_DDRE                      (0x00002000)            /*!< DMA Disable on Reception Error */
#define  USART_CR3_DEM                       (0x00004000)            /*!< Driver Enable Mode */
#define  USART_CR3_DEP                       (0x00008000)            /*!< Driver Enable Polarity Selection */
#define  USART_CR3_SCARCNT                   (0x000E0000)            /*!< SCARCNT[2:0] bits (SmartCard Auto-Retry Count) */
#define  USART_CR3_SCARCNT_0                 (0x00020000)            /*!< Bit 0 */
#define  USART_CR3_SCARCNT_1                 (0x00040000)            /*!< Bit 1 */
#define  USART_CR3_SCARCNT_2                 (0x00080000)            /*!< Bit 2 */
#define  USART_CR3_WUS                       (0x00300000)            /*!< WUS[1:0] bits (Wake UP Interrupt Flag Selection) */
#define  USART_CR3_WUS_0                     (0x00100000)            /*!< Bit 0 */
#define  USART_CR3_WUS_1                     (0x00200000)            /*!< Bit 1 */
#define  USART_CR3_WUFIE                     (0x00400000)            /*!< Wake Up Interrupt Enable */

#define  USART_BRR_DIV_FRACTION              (0x000F)                /*!< Fraction of USARTDIV */
#define  USART_BRR_DIV_MANTISSA              (0xFFF0)                /*!< Mantissa of USARTDIV */

#define  USART_GTPR_PSC                      (0x00FF)                /*!< PSC[7:0] bits (Prescaler value) */
#define  USART_GTPR_GT                       (0xFF00)                /*!< GT[7:0] bits (Guard time value) */


#define  USART_RTOR_RTO                      (0x00FFFFFF)            /*!< Receiver Time Out Value */
#define  USART_RTOR_BLEN                     (0xFF000000)            /*!< Block Length */

#define  USART_RQR_ABRRQ                    (0x0001)                /*!< Auto-Baud Rate Request */
#define  USART_RQR_SBKRQ                    (0x0002)                /*!< Send Break Request */
#define  USART_RQR_MMRQ                     (0x0004)                /*!< Mute Mode Request */
#define  USART_RQR_RXFRQ                    (0x0008)                /*!< Receive Data flush Request */
#define  USART_RQR_TXFRQ                    (0x0010)                /*!< Transmit data flush Request */

#define  USART_ISR_PE                        (0x00000001)            /*!< Parity Error */
#define  USART_ISR_FE                        (0x00000002)            /*!< Framing Error */
#define  USART_ISR_NE                        (0x00000004)            /*!< Noise detected Flag */
#define  USART_ISR_ORE                       (0x00000008)            /*!< OverRun Error */
#define  USART_ISR_IDLE                      (0x00000010)            /*!< IDLE line detected */
#define  USART_ISR_RXNE                      (0x00000020)            /*!< Read Data Register Not Empty */
#define  USART_ISR_TC                        (0x00000040)            /*!< Transmission Complete */
#define  USART_ISR_TXE                       (0x00000080)            /*!< Transmit Data Register Empty */
#define  USART_ISR_LBD                       (0x00000100)            /*!< LIN Break Detection Flag */
#define  USART_ISR_CTSIF                     (0x00000200)            /*!< CTS interrupt flag */
#define  USART_ISR_CTS                       (0x00000400)            /*!< CTS flag */
#define  USART_ISR_RTOF                      (0x00000800)            /*!< Receiver Time Out */
#define  USART_ISR_EOBF                      (0x00001000)            /*!< End Of Block Flag */
#define  USART_ISR_ABRE                      (0x00004000)            /*!< Auto-Baud Rate Error */
#define  USART_ISR_ABRF                      (0x00008000)            /*!< Auto-Baud Rate Flag */
#define  USART_ISR_BUSY                      (0x00010000)            /*!< Busy Flag */
#define  USART_ISR_CMF                       (0x00020000)            /*!< Character Match Flag */
#define  USART_ISR_SBKF                      (0x00040000)            /*!< Send Break Flag */
#define  USART_ISR_RWU                       (0x00080000)            /*!< Receive Wake Up from mute mode Flag */
#define  USART_ISR_WUF                       (0x00100000)            /*!< Wake Up from stop mode Flag */
#define  USART_ISR_TEACK                     (0x00200000)            /*!< Transmit Enable Acknowledge Flag */
#define  USART_ISR_REACK                     (0x00400000)            /*!< Receive Enable Acknowledge Flag */

#define  USART_ICR_PECF                      (0x00000001)            /*!< Parity Error Clear Flag */
#define  USART_ICR_FECF                      (0x00000002)            /*!< Framing Error Clear Flag */
#define  USART_ICR_NCF                      (0x00000004)             /*!< Noise detected Clear Flag */
#define  USART_ICR_ORECF                     (0x00000008)            /*!< OverRun Error Clear Flag */
#define  USART_ICR_IDLECF                    (0x00000010)            /*!< IDLE line detected Clear Flag */
#define  USART_ICR_TCCF                      (0x00000040)            /*!< Transmission Complete Clear Flag */
#define  USART_ICR_LBDCF                     (0x00000100)            /*!< LIN Break Detection Clear Flag */
#define  USART_ICR_CTSCF                     (0x00000200)            /*!< CTS Interrupt Clear Flag */
#define  USART_ICR_RTOCF                     (0x00000800)            /*!< Receiver Time Out Clear Flag */
#define  USART_ICR_EOBCF                     (0x00001000)            /*!< End Of Block Clear Flag */
#define  USART_ICR_CMCF                      (0x00020000)            /*!< Character Match Clear Flag */
#define  USART_ICR_WUCF                      (0x00100000)            /*!< Wake Up from stop mode Clear Flag */

#define  USART_RDR_RDR                       (0x01FF)                /*!< RDR[8:0] bits (Receive Data value) */

#define  USART_TDR_TDR                       (0x01FF)                /*!< TDR[8:0] bits (Transmit Data value) */


#define  WWDG_CR_T                           (0x7F)               /*!< T[6:0] bits (7-Bit counter (MSB to LSB)) */
#define  WWDG_CR_T0                          (0x01)               /*!< Bit 0 */
#define  WWDG_CR_T1                          (0x02)               /*!< Bit 1 */
#define  WWDG_CR_T2                          (0x04)               /*!< Bit 2 */
#define  WWDG_CR_T3                          (0x08)               /*!< Bit 3 */
#define  WWDG_CR_T4                          (0x10)               /*!< Bit 4 */
#define  WWDG_CR_T5                          (0x20)               /*!< Bit 5 */
#define  WWDG_CR_T6                          (0x40)               /*!< Bit 6 */

#define  WWDG_CR_WDGA                        (0x80)               /*!< Activation bit */

#define  WWDG_CFR_W                          (0x007F)            /*!< W[6:0] bits (7-bit window value) */
#define  WWDG_CFR_W0                         (0x0001)            /*!< Bit 0 */
#define  WWDG_CFR_W1                         (0x0002)            /*!< Bit 1 */
#define  WWDG_CFR_W2                         (0x0004)            /*!< Bit 2 */
#define  WWDG_CFR_W3                         (0x0008)            /*!< Bit 3 */
#define  WWDG_CFR_W4                         (0x0010)            /*!< Bit 4 */
#define  WWDG_CFR_W5                         (0x0020)            /*!< Bit 5 */
#define  WWDG_CFR_W6                         (0x0040)            /*!< Bit 6 */

#define  WWDG_CFR_WDGTB                      (0x0180)            /*!< WDGTB[1:0] bits (Timer Base) */
#define  WWDG_CFR_WDGTB0                     (0x0080)            /*!< Bit 0 */
#define  WWDG_CFR_WDGTB1                     (0x0100)            /*!< Bit 1 */

#define  WWDG_CFR_EWI                        (0x0200)            /*!< Early Wakeup Interrupt */

#define  WWDG_SR_EWIF                        (0x01)               /*!< Early Wakeup Interrupt Flag */

/**
  * @}
  */

 /**
  * @}
  */ 

#ifdef USE_STDPERIPH_DRIVER
#endif

/** @addtogroup Exported_macro
  * @{
  */
/**
  * @}
  */

#ifdef __cplusplus
#endif

#endif /* __STM32F0XX_H */

/**
  * @}
  */

  /**
  * @}
  */

